Repository: amaneiro/poss-gl
Catalog: po/*/appa.po
Languages: es

source: "SourceJammer is a source control and versioning system written in Java. It consists of a server-side component that maintains the files and version history, and handles check-in, check-out, etc. and other commands; and a client-side component that makes requests of the server and manages the files on the client-side file system."
es: "PRCS, el Sistema de Control de Revisión de Proyecto (Project Revision Control System), es la interfaz de un conjunto de herramientas que (como CVS) proporcionan una manera de tratar con conjuntos de ficheros y directorios como una entidad, preservando versiones coherentes del conjunto entero... Su proposito es similar al de SCCS, RCS, y CVS, pero (al menos según sus autores), es mucho más simple que cualquiera de aquellos sistemas."

source: <emphasis role="bold">FastCST</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.zedshaw.com/projects/fastcst/index.html"></ulink>
es: <emphasis role="bold">ArX</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.nongnu.org/arx/"></ulink>

source: "A 'modern' system that uses changesets over file revisions and distributed operation rather than centralized control. As long as you have an e-mail account you can use FastCST. For larger distribution you only need an FTP server and/or an HTTP server or use the built in 'serve' command to serve your stuff up directly. All changesets are universally unique and have tons of meta-data so you can reject anything you don't [want] before you try it. Merging is done by comparing a merged changeset against the current directory contents, rather than trying to merge it with another changeset."
es: ArX es un sistema de control de versión distribuído que ofrece características de ramificación y mezcla, verificarión criptográfica de integridad de datos, y la capacidad de publicar archivos fácilmente en cualquier servidor HTTP.

source: <emphasis role="bold">Superversion</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.superversion.org/"></ulink>
es: <emphasis role="bold">SourceJammer</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://sourcejammer.org/"></ulink>

source: "Superversion is a multi-user distributed version control system based on change sets. It aims to be an industrial-strength, open source alternative to commercial solutions that is equally easy to use (or even easier) and similarly powerful. In fact, intuitive and efficient usability has been one of the top priorities in Superversion's development from the very beginning."
es: "SourceJammer es un sistema de versionado y control de código fuente escrito en Java. Consiste en un componente en la parte del servidor que mantiene el historial de la versión y de los ficheros, y maneja subidas , descargas, etc, y otros comandos; y en un componente en la parte del cliente que hace peticiones al servidor y administra ficheros en el sistema de ficheros en la parte del cliente."
