Repository: amaneiro/poss-gl
Catalog: po/*/appa.po
Languages: es

source: Free Version Control Systems
es: Sistemas de Control de Versiones Libres

source: These are all the open source version control systems I was aware of as of mid-2007. The only one I use on a regular basis is Subversion. I have little or no experience with most of these systems, except for Subversion and CVS; the information here is taken from their web sites. See also <ulink url="http://en.wikipedia.org/wiki/List_of_revision_control_software"></ulink>.
es: Estos son todos los sistemas de control de versiones de código abierto de los que soy consciente a mediados de 2007. El único que uso frecuentemente es Subversion. Poseo poca experiencia o ninguna con la mayoría de estos sistemas, excepto con Subversion y CVS; la información de aquí ha sido tomada de sus sitios web. Ver también <ulink url="http://en.wikipedia.org/wiki/List_of_revision_control_software"></ulink>.

source: CVS has been around for a long time, and many developers are already familiar with it. In its day it was revolutionary: it was the first open source version control system with wide-area network access for developers (as far as I know), and the first to offer anonymous read-only checkouts, which gave new developers an easy way to get involved in projects. CVS versions files only, not directories; it offers branching, tagging, and good client-side performance, but doesn't handle large files or binary files very well. It also does not support atomic commits.<emphasis>[Disclaimer: I was active in CVS development for about five years, before helping to start the Subversion project to replace it.]</emphasis>
es: CVS ha estado durante mucho tiempo, y muchos desarrolladores están ya familiarizados con él. En su día fue revolucionario: fue el primer sistema de control de versiones de código abierto con acceso a redes de área amplia para desarrolladores (que yo sepa), y el primero que ofreció ""checkouts"" anónimos de sólo lectura, los que dieron a los desarrolladores una manera fácil de implicarse en los proyectos. CVS sólo versiona ficheros, no directorios; ofrece ramificaciones, etiquetado, y un buen rendimiento en la parte del cliente, pero no maneja muy bien ficheros grandes ni ficheros binarios. Tampoco soporta cambios atómicos. <emphasis>[Descargo: he estado activo en el desarrollo de CVS durante cinco años, antes de ayudar a empezar el proyecto Subversion para reemplazarlo.]</emphasis>

source: Subversion was written first and foremost to be a replacement for CVS&mdash;that is, to approach version control in roughly the same way CVS does, but without the problems and feature omissions that most frequently annoy users of CVS. One of Subversion's goals is for people already accustomed to CVS to find the transition to Subversion relatively smooth. There is not space here to go into detail about Subversion's features; see its web site for more information. <emphasis>[Disclaimer: I am involved in Subversion development, and it is the only one of these systems that I use on a regular basis.]</emphasis>
es: Subversion fue escrito ante todo para reemplazar a CVS&mdash;es decir, para acceder al control de versiones aproximadamente de la misma manera que CVS lo hace, pero sin los problemas o falta de utilidades que más frecuentemente molestan a los usuarios de CVS. Uno de los objetivos de Subversion es encontrar la transición a Subversion relativamente suave para la gente que ya está acostumbrada a CVS. Aquí no hay sitio para entrar en detalles sobre las características de Subversion; acceda a su sitio web para más información. <emphasis>[Descargo: Estoy implicado en el desarrollo de Subversion, y es el único de estos sistemas que uso habitualmente.]</emphasis>

source: Although it is built on top of Subversion, SVK probably resembles some of the decentralized systems below more than it does Subversion. SVK supports distributed development, local commits, sophisticated change merging, and the ability to mirror trees from non-SVK version control systems. See its web site for details.
es: Aunque se ha construido sobre Subversion, probablemente SVK se parece más a algunos anteriores sistemas descentralizados más que Subversión. SVK soporta desarrollo distribuido, cambios locales, mezcla sofisticada de cambios, y la habiluidad de ""reflejar/clonar"" árboles desde sistemas de control de versiones que no son SVK. Vea su sitio web para más detalles.

source: Mercurial is a distributed version control system that offers, among other things, "complete cross-indexing of files and changesets; bandwidth and CPU efficient HTTP and SSH sync protocols; arbitrary merging between developer branches; integrated stand-alone web interface; [portability to] UNIX, MacOS X, and Windows" and more (the preceding feature list was paraphrased from the Mercurial web site).
es: Mercurial es un sistemas de control de versiones distribuido que ofrece, entre otras cosas, "una completa ""indexación cruzada"" de ficheros y conjutos de cambios; unos procotolos de sincronización SSH y HTTP eficientes respecto al uso de CPU y ancho de banda; una fusión arbitraria entre ramas de desarrolladores; una interfaz web autónoma integrada; [portabilidad a] UNIX, MacOS X, y Windows" y más (las anterior lista de características ha sido parafraseada del sitio web de Mercurial).

source: GIT is a project started by Linus Torvalds to manage the Linux kernel source tree. At first GIT was rather narrowly focused on the needs of kernel development, but it has expanded beyond that and is now used by projects other than the Linux kernel. Its home page says it is "...designed to handle very large projects with speed and efficiency; it is used mainly for various open source projects, most notably the Linux kernel. Git falls in the category of distributed source code management tools, similar to e.g. GNU Arch or Monotone (or BitKeeper in the proprietary world). Every Git working directory is a full-fledged repository with full revision tracking capabilities, not dependent on network access or a central server."
es: GIT es un proyecto empezado por Linus Torvalds para manejar el arbol fuente del ""kernel"" de Linux. Al principio GIT se enfoco bastante en las necesidades del desarrollo del ""kernel"", pero se ha expandido más allá que eso y ahora es usado por otros proyectos a parte del ""kernel"" de Linux. Su página web dice que está "... diseñado para manejar proyectos muy grandes eficaz y velozmente; se usa sobre todo en varios proyectos de código abierto, entre los cuales el más notable es el ""kernel"" de Linux. GIT cae en la categoría de herramientas de administración de código abierto distribuído, similar al, por ejemplo, GNU Arch o Monotone (o bitKeeper en el mundo comercial). Cada directorio de trabajo de GIT es un repositorio completo con plenas capacidades de gestión de revisiones, sin depender del acceso a la red o de un servidor central."

source: <emphasis role="bold">Bazaar</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://bazaar-vcs.org/"></ulink>
es: <emphasis role="bold">Bazaar</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://bazaar.canonical.com/"></ulink>

source: Bazaar (or bzr) is a distributed version control system that concentrates on ease-of-use and having a flexible data model. It is an official GNU project, and is the native version control system for the free software project-hosting site Launchpad.net. Bazaar does fully distributed version control: all work takes place in branches, and every developer typically has a full copy of the branch history. Branches can be merged into one another in a decentralized manner, but Bazaar can also be configured to work in a centralized way. Bazaar started out as a fork of GNU Arch, but was rewritten from scratch and now has no direct relation to GNU Arch.
es: Bazaar está todavía en desarrollo. Será una implementación del protocolo GNU Arch, mantendrá compatibilidad con el procotolo GNU Arch a medida que evolucione, y trabajará con el proceso de la comunidad GNU Arch para cualquier cambio de protocolo que fuera requerido a favor del agrado del usuario.

source: <emphasis role="bold">Darcs</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://darcs.net"></ulink>
es: <emphasis role="bold">Bazaar-NG</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://bazaar-ng.org/"></ulink>

source: "David's Advanced Revision Control System is yet another replacement for CVS. It is written in Haskell, and has been used on Linux, MacOS X, FreeBSD, OpenBSD and Microsoft Windows. Darcs includes a cgi script, which can be used to view the contents of your repository."
es: Bazaar-NG (o bzr) está actualmente siendo desarrollado por Canonical (<ulink url="http://canonical.com/"></ulink>). Ofrece la elección entre el trabajo centralizado y el descentralizado dentro de un mismo proyecto. Por ejemplo, cuando en la oficina uno puede trabajar en una rama central compartida; para cambios experimentales o trabajo desconectado, se puede crear una rama en el portatil y mezclarla más tarde.

source: <emphasis role="bold">Arch</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.gnu.org/software/gnu-arch/"></ulink>
es: <emphasis role="bold">Darcs</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://abridgegame.org/darcs/"></ulink>

source: GNU Arch supports both distributed and centralized development. Developers commit their changes to an "archive", which may be local, and the changes can be pushed and pulled to other archives as the managers of those archives see fit. As such a methodology implies, Arch has more sophisticated merge support than CVS. Arch also allows one to easily make branches of archives to which one does not have commit access. This is only a brief summary; see the Arch web pages for details.
es: "El Sistema Avanzado de Control de Revisión de David (David's Advanced Revision Control System) es aún otro reemplazo de CVS. Está escrito en Haskell, y se ha usado en Linux, MacOX, FreeBSD, Open BSD y Microsoft Windows. Darcs incluye un archivo de comandos cgi, el cual puede ser usado para ver los contenidos de su repositorio.

source: <emphasis role="bold">monotone</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.venge.net/monotone/"></ulink>
es: <emphasis role="bold">Arch</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.gnu.org/software/gnu-arch/"></ulink>

source: "monotone is a free distributed version control system. it provides a simple, single-file transactional version store, with fully disconnected operation and an efficient peer-to-peer synchronization protocol. it understands history-sensitive merging, lightweight branches, integrated code review and 3rd party testing. it uses cryptographic version naming and client-side RSA certificates. it has good internationalization support, has no external dependencies, runs on linux, solaris, OSX, and windows, and is licensed under the GNU GPL."
es: GNU Arch soporta tanto desarrollo distribuido como centralizado. Los desarrolladores suben sus cambios a un "archivo", que puede ser local, y los cambios pueden ser metidos y quitados de otros archivos tal y como los administradores de esos archivos vean conveniente. Como toda metodología implica, Arch posee más soporte de mezclado que CVS. Arch tambien permite a uno crear fácilmente ramas de archivos a las cuales uno no tiene acceso para subir cambios. Esto es sólo un breve sumario; para más detalles vea las páginas web de Arch.

source: <emphasis role="bold">Codeville</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://codeville.org/"></ulink>
es: <emphasis role="bold">monotone</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.venge.net/monotone/"></ulink>

source: "Why yet another version control system? All other version control systems require that you keep careful track of the relationships between branches so as not have to repeatedly merge the same conflicts. Codeville is much more anarchic. It allows you to update from or commit to any repository at any time with no unnecessary re-merges."
es: "monotone es un sistema de control de versión distribuido libre. Ofrece un almacén simple de version transacional de un solo fichero, con una operación completa de desconexión y un protocolo de sincronización entre iguales ""peer-to-peer"" eficiente. Comprende el mezclado susceptible al historial, ramas ligeras, revisión de código integrado y pruebas de terceros. Usa nombrado criptográfico de versión y certificados de cliente RSA. Posee un buen soporte de internacionalización, no tiene dependencias externas, se ejecuta en Linux, Solaris, OSX, y windows, y está licenciado bajo la GNU GPL."

source: "Codeville works by creating an identifier for each change which is done, and remembering the list of all changes which have been applied to each file and the last change which modified each line in each file. When there's a conflict, it checks to see if one of the two sides has already been applied to the other one, and if so makes the other side win automatically. When there's an actual not automatically mergeable version conflict, Codeville behaves in almost exactly the same way as CVS."
es: <emphasis role="bold">Codeville</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://codeville.org/"></ulink>

source: <emphasis role="bold">Vesta</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.vestasys.org/"></ulink>
es: "¿Por qué otro sistema de control de versión? Todos los sistemas de control de versión requieren que se mantenga una gestión cuidadosa de las relaciones entre ramas con tal de no tener que mezclar repetidamente los mismos conflcitos. Codeville es mucho más anárquico. Permite actualizar o subir cambios a cualquier repositorio en cualquier momento sin innecesarias re-mezclas."

source: "Vesta is a portable SCM [Software Configuration Management] system targeted at supporting development of software systems of almost any size, from fairly small (under 10,000 source lines) to very large (10,000,000 source lines)."
es: "Codeville funciona creando un identificador para cada cambio que sea hecho, y recordando la lista de todos los cambios que se han aplicado a cada fichero y el último cambio que modificó cada línea de cada fichero. Cuando hay un conflicto, lo comprueba para ver si una de las dos partes se ha aplicado ya a la otra, y si es así hace a la otra automáticamente ganadora. Cuando hay un conflicto de versión real que no se puede mezclar automáticamente, Codeville se comporta de una manera casi exacta que CVS."

source: "Vesta is a mature system. It is the result of over 10 years of research and development at the Compaq/Digital Systems Research Center, and it was in production use by Compaq's Alpha microprocessor group for over two and a half years. The Alpha group had over 150 active developers at two sites thousands of miles apart, on the east and west coasts of the United States. The group used Vesta to manage builds with as much as 130 MB of source data, each producing 1.5 GB of derived data. The builds done at the eastern site in an average day produced about 10-15 GB of derived data, all managed by Vesta. Although Vesta was designed with software development in mind, the Alpha group demonstrated the system's flexibility by using it for hardware development, checking their hardware description language files into Vesta's source code control facility and building simulators and other derived objects with Vesta's builder. The members of the former Alpha group, now a part of Intel, are continuing to use Vesta today in a new microprocessor project."
es: <emphasis role="bold">Vesta</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.vestasys.org/"></ulink>

source: <emphasis role="bold">Aegis</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://aegis.sourceforge.net/"></ulink>
es: "Vesta es un sistema portátil SCM [Administrador de Configuración de Software o Software Configuration Management] orientado a apoyar el desarrollo de sistemas de software de casi cualquier tamaño, desde bastante pequeños (menos de 10.000 líneas de código fuente) hasta muy grandes (10.000.000 líneas de código fuente)."

source: "Aegis is a transaction-based software configuration management system. It provides a framework within which a team of developers may work on many changes to a program independently, and Aegis coordinates integrating these changes back into the master source of the program, with as little disruption as possible."
es: "Vesta es un sistema maduro. Es el resultado de más de 10 años de investigación y desarrollo en el Centro de Desarrollo desistemas Compaq/Digital, y ha estado en uso productivo por el grupo de microprocesador Alpha de Compaq durante más de dos años y medio. El grupo Alpha tuvo más de 150 desarrolladores activos en dos sitios a miles de millas de distancia el uno del otro, en la costa este y en la oeste de los Estados Unidos de América. El grupo usó Vesta para administrar ""builds"" con a lo sumo 130 MB de datos fuente, cada uno produciendo 1,5 GB de datos derivados. Las ""builds"" hechas en la parte oeste de media en un día producieron 10-15 GB de datos derivados, todos administrados por Vesta. Aunque Vesta se diseñó teniendo en mente el desarrollo de software, el grupo Alpha demostró la flexibilidad del sistema usándolo para el desarrollo de hardware, comprobando los ficheros en lenguaje de descripción de su hardware dentro de la facilidad de control de código fuente de Vesta y contruyendo simuladores y otros objetos derivados con el ""constructor"" de Vesta. Los miembros del ex-grupo Alpha, ahora parte de Intel, hoy continuan usado Vesta en el proyecto de un nuevo microprocesador."

source: <emphasis role="bold">CVSNT</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://cvsnt.org/"></ulink>
es: <emphasis role="bold">Aegis</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://aegis.sourceforge.net/"></ulink>

source: "CVSNT is an advanced multiplatform version control system. Compatible with the industry standard CVS protocol it now supports many more features. ... CVSNT is Open Source, Free software licensed under the GNU General Public License." Its feature list includes authentication via all standard CVS protocols, plus Windows specific SSPI and Active Directory; secure transport support, via sserver or encrypted SSPI; cross platform (runs in Windows or Unix environments); NT version is fully integrated with Win32 system; MergePoint processing means no more tagging to merge; under active development.
es: "Aegis es un sistema de administración de configuración de software basado en transacciones. Proporciona un marco dentro del que un equipo de desarrolladores puede trabajar en muchos cambios de un programa independientemente, y Aegis coordina la integración de esos cambios dentro del código fuente maestro del programa, con el menor transtorno posible."

source: <emphasis role="bold">META-CVS</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://common-lisp.net/project/meta-cvs/"></ulink>
es: <emphasis role="bold">CVSNT</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://cvsnt.org/"></ulink>

source: "Meta-CVS is a version control system built around CVS. Although it retains most of the features of CVS, including all of the networking support, it is more capable than CVS, and easier to use." The features listed on META-CVS's web site include: directory structure versioning, improved file type handling, simpler and more user-friendly branching and merging, support for symbolic links, property lists attached to versioned data, improved third-party data importing, and easy upgrading from stock CVS.
es: "CVSNT es un sistema de control de versión multiplataforma avanzado. Compatible con el protocolo estándar CVS de industria ahora soporta muchas más características... CVSNT es Código Abierto, software libre licenciado bajo la Licencia Pública General GNU." Su lista de características incluye autentificación via todos los protocolos estándar de CVS, más SSPI y Directorio Activo específicos de Windows; soporte de transporte seguro, vía sserver o SSPI encriptada; plataformas cruzadas (corre en entornos Windows o Unix); la versión NT está totalmente integrada con el sistemas Win32; el proceso MergePoint significa no tener que mezclar etiquetas más; bajo desarrollo activo.

source: <emphasis role="bold">OpenCM</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.opencm.org/"></ulink>
es: <emphasis role="bold">META-CVS</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://users.footprints.net/~kaz/mcvs.html"></ulink>

source: "OpenCM is designed as a secure, high-integrity replacement for CVS. A list of the key features can be found on the features page. While not as 'feature rich' as CVS, it supports some useful things that CVS lacks. Briefly, OpenCM provides first-class support for renames and configuration, cryptographic authentication and access control, and first-class branches."
es: "Meta-CVS es un sistema de control de versión construído alrededor de CVS. Aunque conserva la mayoría de las características de CVS, incluyendo todo el soporte de red, tiene más capacidad que CVS, y es más fácil de usar." Las características listadas en el sitio web de META-CVS incluyen: versionado de estructura de directorio, manejo de tipos de ficheros mejorado, mezclado y ramificado más simple y más fácil de usar, soporte para enlaces simbólicos, listas de propiedad adjuntadas a los datos versionados, importación mejorada de datos de terceros, y un fácil actualización desde las existencias en CVS.

source: <emphasis role="bold">PRCS</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://prcs.sourceforge.net/"></ulink>
es: <emphasis role="bold">OpenCM</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.opencm.org/"></ulink>

source: "PRCS, the Project Revision Control System, is the front end to a set of tools that (like CVS) provide a way to deal with sets of files and directories as an entity, preserving coherent versions of the entire set. ... Its purpose is similar to that of SCCS, RCS, and CVS, but (according to its authors, at least), it is much simpler than any of those systems."
es: "OpenCM está diseñado como un reemplazo seguro y de alta integridad de CVS. Se puede encontrar una lista de las características clave en la página de características. Aun cuando no es tan 'rico en características' como CVS, soporta algunas cosas útiles de las que carece CVS. En pocas palabras, OpenCM proporciona soporte de primera clase para renombrado y configuración, autentificación criptográfica y control de acceso, y ramas de primera clase."

source: <emphasis role="bold">ArX</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.nongnu.org/arx/"></ulink>
es: <emphasis role="bold">Stellation</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.eclipse.org/stellation/"></ulink>

source: ArX is a distributed version control system offering branching and merging features, cryptographic data integrity verification, and the ability to publish archives easily on any HTTP server.
es: "Stellation es un sistema avanzado y extensible de administración de configuración de software, originalmente desarrollado por IBM Research. Mientras que Stellation proporciona todas las funciones estándar disponibles en cualquier sistema SCM, se distingue por un número de características avanzadas, tales como administración de cambios orientada a tarea, versionado consistente de proyectos y ramificación ligera, destinado para facilitar el desarrollo de sistemas software por grupos grandes de desarrolladores coordinados líbremente."

source: <emphasis role="bold">SourceJammer</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.sourcejammer.org/"></ulink>
es: <emphasis role="bold">PRCS</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://prcs.sourceforge.net/"></ulink>
