Repository: amaneiro/poss-gl
Catalog: po/*/appb.po
Languages: es, gl

source: Free Bug Trackers
es: Gestor de fallos libres
gl: Sistemas libres de xestión de bugs (Bug Trackers)

source: No matter what bug tracker a project uses, some developers always like to complain about it. This seems to be more true of bug trackers than of any other standard development tool. I think it's because bug trackers are so visual and so interactive that it's easy to imagine the improvements one would make (if one only had the time), and to describe those improvements out loud. Take the inevitable complaints with a grain of salt&mdash;many of the trackers below are pretty good.
es: Da igual que gestor de fallos usa un proyecto, a algunos desarrolladores siempre les gusta quejarse de ellos. Esto es inclusive más cierto para gestores de fallos que para cualquier otra herramienta estándar de desarrollo. Creo que es porque los gestores de fallos son tan visuales y tan interactivos que es fácil imaginar las mejoras que uno mismo haría (si solamente tuviera tiempo), y describirlas en voz alta. Toma las inevitables quejas con excepticismo&mdash; muchos de los gestores que se describen más tarde son bastante buenos.
gl: Non importa que sistema de xestión de bugs ("bug tracker") empregue un proxecto, sempre hai desenvolvedores que teñen queixa deles. Isto é máis notorio nos sistemas de xestión de erros que en calquera outra ferramenta habitual de desenvolvemento. Na miña opinión é debido a que os "bug trackers" son tan visuais e interactivos que é fácil imaxinar as melloras que a un mesmo lle gustaría facer (se tiver tempo) e describir esas melloras abertamente. Acepta as inevitables queixas con filosofía, moitos dos sistemas que van ser presentados a seguir son moi bos.

source: Throughout these listings, the word "issue" is used to refer to the items the trackers track. But remember that each system may have its own terminology, in which the corresponding term might be "artifact" or "bug" or something else.
es: A lo largo de estos listados, la palabra ejemplar se usa para referirse a elementos que el gestor gestiona. Pero recuerda que cada sistema puede tener su propia terminología, en la cual el término correspondiente podría ser "artefacto" o "fallo" o cualquier otra cosa.
gl: Ao longo das seguintes listaxes a palabra "problema" ("issue" no orixinal) é empregada para referirse aos elementos que o sistema de notificación de erros rexistra. Mais recorda que cada sistema pode ter a súa propia terminoloxía sendo sinónimos "artefacto" ou "erro" ("artifact" ou "bug" no orixinal) entre outros.

source: Bugzilla is very popular, actively maintained, and seems to make its users pretty happy. I've been using a modified variant of it in my work for four years now, and like it. It's not highly customizable, but in a odd way, that may be one of its features: Bugzilla installations tend to look pretty much the same wherever they are found, which means many developers are already accustomed to its interface and will feel they are in familiar territory.
es: Bugzilla es muy popular, es mantenido activamente, y parece que hace a sus usuarios muy felices. Yo he estado usando una variante modificada de él en mi trabajo desde hace cuatro años, y me gusta. No es altamente personalizable, pero esa puede ser, de una manera curiosa, una de sus características: Las instalaciones de Bugzilla tienden a parecer la misma sea donde sea que se encuentren, lo que significa que muchos desarrolladores estén ya acostumbrados a su interfaz y se sentirán en un territorio familiar.
gl: Bugzilla é moi popular, conta con soporte activo e seus usuarios parecen estar satifeitos. Eu traballei cunha versión modificada durante catro anos e gústame. Non é demasiado personalizable, o que en certa maneira pode considerarse unha das súas características; as instalacións de Bugzilla adoitan ser moi semellantes en todas partes, polo que moitos desenvolvedores están xa afeitos á súa interface e vanse sentir nun terreo coñecido.

source: GNU GNATS is one of the oldest open source bug trackers, and is widely used. Its biggest strengths are interface diversity (it can be used not just through a web browser, but also through email or command-line tools), and plaintext issue storage. The fact that all issue data is stored in text files on disk makes it easier to write custom tools to trawl and parse the data (for example, to generate statistical reports). GNATS can also absorb emails automatically by various means, and add them to the appropriate issues based on patterns in the email headers, which makes logging user/developer conversations very easy.
es: GNU GNATS es uno de los gestores de fallos de código abierto más antiguos, y se usa extensamente. Su mayor fortaleza reside en la diversidad de interfaces (no solamente puede ser usado a través de un navegador WEB, sino que también a través de correo electrónico o utilidades de línea de comandos), y el almacenamiento de los ejemplares en texto plano. El hecho de que los datos de todos los ejemplares se almacenen en ficheros de texto en el disco hace que sea más fácil escribir herramientas a medida para buscar y analizar sintácticamente los datos (por ejemplo, para generar informes estadísticos). GNATS también puede absorber correos electrónicos de muchas maneras, y añadirlos a los ejemplares apropiados basados en patrones dentro de las cabeceras del correo electrónico, lo que hace que el registro de las conversaciones del usuario/desarrollador sean muy fáciles.
gl: GNU GNATS é un dos sistemas máis vellos de xestión de bugs e é empregado amplamente. Os seus puntos fortes son a diversidade de interfaces (pode ser usado non só mediante un navigador web, senón tamén a través do correo electrónico ou de ferramentas de liña de comandos) e a almacenaxe dos erros en texto plano. Ter todos os erros en texto plano no disco facilita a tarefa de escribir ferramentas adaptadas para puxar e parsear os datos (por exemplo, para xerar informes estatísticos). GNATS pode tamén acceder a mensaxes de correo electrónico de diversas maneiras e anexalas aos temas correspondentes en función de patróns existentes nos cabezallos das mensaxes; isto facilita en gran medida o rexistro das conversacións entre usuarios e desenvolvedores.

source: RT's web site says "RT is an enterprise-grade ticketing system which enables a group of people to intelligently and efficiently manage tasks, issues, and requests submitted by a community of users," and that about sums it up. RT has a fairly polished web interface, and seems to have a pretty wide installed base. The interface is a bit visually complex, but that becomes less distracting as you get used to it. RT is licenced under the GNU GPL (for some reason, their web site doesn't make this clear).
es: El sitio Web de RT dice que "RT es un sistema de etiquetado de niveles de seguridad que permite a un grupo de gente manejar tareas, ejemplares, y peticiones enviadas por una comunidad de usuarios de una manera inteligente y eficiente, y todo eso en resumen. RT posee una interfaz web bastante pulida, y parece tener una base bastante ampliamente instalada. La interfaz es un poco compleja en términos visuales, pero que llega a ser menos molesto a medida que se utiliza. RT tiene una licencia GNU GPL (por alguna razón, su sitio web no deja esto claro).
gl: A páxina web de RT di o seguinte: "RT é un sistema de tickets de nivel profesional que permite a un grupo de persoas xerir con eficacia e habilidade tarefas, problemas e peticións enviadas por unha comunidade de usuarios" e, resumindo, iso é o que fai. RT posúe unha interface web bastante polida e parece ter unha ampla base de instalacións. O seu aspecto visual é algo complexo, mais tórnase menos molesto cando estás afeito a empregalo. RT, está rexistrado baixo licenza GNU GPL (por algunha razón, o sitio web non aclara este punto).

source: Trac is a bit more than a bug tracker: it's really an integrated wiki and bug tracking system. It uses wiki linking to connect issues, files, version control changesets, and plain wiki pages. It's fairly simple to set up, and integrates with Subversion (see <xref linkend="vc-systems"/>).
es: Trac es un poco más que un gestor de fallos: realmente es un sistema wiki y gestor de fallos integrado. Usa el enlace Wiki para conectar ejemplares, ficheros, grupos de cambios de control de versión, y simples páginas wiki. Es bastante simple de configurar, y se integra con Subversion (ver <xref linkend="vc-systems"/>).
gl: Trac é máis que un sistema de reporte de bugs, en realidade é un sistema que integra wiki e un "bug tracker". Emprega wiki links para ligar temas, arquivos, grupos de mudanzas de control de versións e páxinas wiki simples. É bastante sinxelo de configurar e pódese integrar con Subversion (ver <xref linkend="vc-systems"/>).

source: Roundup is pretty easy to install (only Python 2.1 or higher is required), and simple to use. It has web, email, and command-line interfaces. The issue data templates and web interface are customizable, as is some of its state-transition logic.
es: Roundup es bastante fácil de instalar (sólo se necesita Python 2.1 o superior), y simple de usar. Tiene interfaces web, para correo electrónico y de línea de comandos. Las plantillas de datos de ejemplares y las interfaces web son parametrizables, al igual que alguna de su lógica de transición de estados.
gl: Roundup é bastante sinxelo de instalar (só é necesario un Python 2.1 o superior) e fácil de usar. Ten tanto interface web, coma interface e-mail e en liña de comandos. O molde ("template") de datos dos bugs e a interface web son personalizables, así como parte da lóxica de transición de estados.

source: Mantis is a web-based bug tracking system, written in PHP, and using MySQL database for storage. It has the features you'd expect. Personally, I find the web interface clean, intuitive, and easy on the eyes.
es: Mantis es un sistema de gestión de fallos basado en web, escrito en PHP, y que usa la base de datos MySQL como almacenaje. Posee las características que se esperarían de él. Personalmente, encuentro la interfaz web limpia, intuituva, y visualmente fácil.
gl: Mantis é un sistema de xestión de bugs en web, escrito en PHP e que emprega MySQL como base de datos de almacenaxe. Presenta as características que calquera esperaría deste tipo de programas. Persoalmente, acho a súa interface web atractiva, elegante e intuitiva.

source: <emphasis role="bold">Flyspray</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.flyspray.org/"></ulink>
es: <emphasis role="bold">Scarab</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://scarab.tigris.org/"></ulink>

source: Flyspray is a web-based bug tracking system written in PHP. Its web pages describe it as "uncomplicated", and the list of features includes: multiple database support (currently MySQL and PGSQL); multiple projects; 'watching' tasks, with notification of changes (via email or Jabber); comprehensive task history; CSS theming; file attachments; advanced search features (though easy to use); RSS/Atom feeds; wiki and plaintext input; voting; dependency graphs.
es: Scarab está pensado para ser un gestor de fallos altamente parametizable y con todas las características, ofreciendo más o menos el conjunto total de las características ofrecidas por otros gestores de fallos: entradas de datos, consultas, informes, notificaciones a grupos interesados, acumulación colaborativa de comentarios, y gestión de dependencias.
gl: Flyspray é un sistema web de xestión de bugs escrito en PHP. Segundo a súa páxina web é un sistema "pouco complicado" que inclúe as seguintes funcionalidades: soporte para diferentes bases de datos (nesta altura MySQL e PGSQL), xestión de múltiples proxectos, monitoramento de tarefas con notificacións de mudanzas (vía email ou jabber), histórico de tarefas exaustivo, deseño CSS, ficheiros adxuntos, ferramentas avanzadas de procura (mais sinxelas de manexar), sindicación vía RSS/Atom, admite entradas en wiki ou texto plano, mecanismos de votacións e gráficos de dependencia.

source: <emphasis role="bold">Scarab</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://scarab.tigris.org/"></ulink>
es: Se parametriza a través de páginas web administrativas. Se puede tener múltiples "módulos" (proyectos) activos en una única instalación de Scarab. Dentro de un módulo dado, se puede crear nuevos tipos de ejemplares (defectos, mejoras, tareas, peticiones de apoyo, etc.), y añadir atributos arbitrarios, para afinar el gestor a los requisitos específicos de tu proyecto.

source: Scarab is meant to be a highly customizable, full-featured bug tracker, offering more or less the union of the features offered by other bug trackers: data entry, queries, reports, notifications to interested parties, collaborative accumulation of comments, and dependency tracking.
es: A últimos de 2004, Scarab se acercaba a su versión liberada 1.0.
gl: A idea principal de Scarab é operar como un sistema completo de xestión de bugs, altamente adaptable, que ofrece, máis ou menos, a unión das ferramentas que ofrecen outros sistemas de este tipo: entrada de datos, consultas, informes, notificacións ás partes interesadas, almacenaxe de comentarios colaborativos e rexistro de dependencias.

source: It is customizable through administrative web pages. You can have multiple "modules" (projects) active in a single Scarab installation. Within a given module, you can create new issue types (defects, enhancements, tasks, support requests, etc.), and add arbitrary attributes, to tune the tracker to your project's specific requirements.
es: <emphasis role="bold">Sistema de Gestión de Fallos de Debian (Debian Bug Tracking System (DBTS))</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.chiark.greenend.org.uk/~ian/debbugs/"></ulink>
gl: Pode ser personalizado mediante páxinas web de admistración. Permite ter activos, nunha única instalación de Scarab, varios "módulos" (proxectos) simultáneamente. Dentro de cada módulo é posible crear novos tipos de elementos (soporte de peticións, defectos, melloras, tarefas, etc.) e engadir outros atributos arbitrarios. Todo isto permite adaptar o sistema aos requisitos determinados de cada proxecto.

source: As of late 2004, Scarab was getting close to its 1.0 release.
es: El Sistema de Gestión de Fallos de Debian (Debian Bug Tracking System) es inusual en el sentido que todas las entradas y manipulaciones de ejemplares se hace vía correo electrónico: cada ejemplar obtiene su propia dirección de correo electrónico dedicada. El DBTS escala bastante bien: <ulink url="http://bugs.debian.org/"></ulink> tiene 227.741 ejemplares, por ejemplo.
gl: A finais de 2004 estaba a punto de ser publicada a versión 1.0 de Scarab.

source: <emphasis role="bold">Debian Bug Tracking System (DBTS)</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.chiark.greenend.org.uk/~ian/debbugs/"></ulink>
es: Ya que la interacción se hace vía clientes de correo normales, un entorno que es familiar y fácilmente accesible para la mayoría de gente, el DBTS es bueno para manejar grandes volúmenes de informes entrantes que necesitan una rápida clasificación y respuesta. Por supuesto, también existen desventajas. Los desarrolladores deben dedicar el tiempo necesario a aprender el sistema de comando del correo electrónico, y los usuarios deben escribir sus informes de fallos sin un formulario web que los guíe en la elección de la información que hay que escribir. Hay algunas herramientas disponibles para ayudar a los usuarios a enviar mejor sus informes de fallos, tales como el programa de línea de comandos <command>reportbug</command> o el paquete <systemitem>debbugs-el</systemitem> para Emacs. Pero la mayoría de la gente no usará estas herramientas; sólo escribirán correos electrónicos a mano, y podrán o no seguir las pautas para reportar fallos publicadas por su proyecto.

source: The Debian Bug Tracking System is unusual in that all input and manipulation of issues is done via email: each issue gets its own dedicated email address. The DBTS scales pretty well: <ulink url="http://bugs.debian.org/"></ulink> has 277,741 issues, for example.
es: El DBTS tiene una interfaz web de sólo lectura, para ver y consultar ejemplares.
gl: O Debian Bug Tracking System é inusual en tanto que toda a introdución e manipulación de erros se fai vía e-mail: cada erro recibe o seu propio enderezo de e-mail. O DBTS escala bastante ben: por exemplo. <ulink url="http://bugs.debian.org/"></ulink> ten 277.741 erros.

source: Since interaction is done via regular mail clients, an environment which is familiar and easily accessible to most people, the DBTS is good for handling high volumes of incoming reports that need quick classification and response. There are disadvantages too, of course. Developers must invest the time needed to learn the email command system, and users must write their bug reports without a web form to guide them in choosing what information to write. There are tools available to help users send better bug reports, such as the command-line <command>reportbug</command> program or the <systemitem>debbugs-el</systemitem> package for Emacs. But most people won't use these tools; they'll just write email manually, and they may or may not follow the bug reporting guidelines posted by your project.
es: Gestores de Etiquetado de Problema
gl: Dado que a interacción é feita mediante clientes de e-mail, un entorno fácilmente accesible e ao que están afeitos moitos usuarios, o DBTS é bo para manexar, clasificar e responder rapidamente a un gran volume de notificacións de erro. Por suposto, ten desvantaxes tamén. Os desenvolvedores deben investir tempo para aprenderen o sistema de comandos de e-mail e os usuarios deben escribir os informes de erro sen un formulario que os guíe na información que hai que incluír. Existen ferramentas para axudar os usuarios a escribiren mellores informes de erros tais como un programa en liña de comandos ou o paquete <systemitem>debbugs-el</systemitem> para Emacs. A maioría da xente non usa estas ferramentas xa que prefiren escribir os e-mails manualmente, e pode que cumpran ou non as regras sobre notificación do proxecto.

source: The DBTS has a read-only web interface, for viewing and querying issues.
es: Estos están más orientados hacia la gestión de etiquetas del escritorio de ayuda que a la gestión de fallos de software. Probablemente sería mejor con un gestor de fallos habitual, pero estos se han listado por completitud, y porque posiblemente podría tener proyectos poco comunes para los cuales un sistema de etiquetado de problemas podría ser más apropiado que un gestor de fallos tradicional.
gl: O DBTS ten unha interface web exclusivamente de lectura para visualizar e consultar erros.

source: Trouble-Ticket Trackers
es: <emphasis role="bold">WebCall</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://myrapid.com/webcall/"></ulink>
gl: <emphasis role="bold">Sistemas de rexistro de tickets de problemas (Trouble-Ticket Trackers)</emphasis>

source: These are more oriented toward help desk ticket tracking than software bug tracking. You'll probably do better with a regular bug tracker, but these are listed for the sake of completeness, and because there could conceivably be unusual projects for which a trouble-ticket system might be more appropriate than a traditional bug tracker.
es: <emphasis role="bold">Teacup</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://www.altara.org/teacup.html"></ulink>
gl: Estes sistemas están máis orientados á xestión de tickets de axuda que á xestión de erros en programas de software. A pesar de que un sistema "bugtracker" normal pode ser o máis adecuado, estes sistemas inclúense nesta obra en prol dun traballo o máis completo posible. Porén, en algúns proxectos poden ser máis axeitados que os tradicionais sistemas de xestión de erros.

source: <emphasis role="bold">WebCall</emphasis>&nbsp;&mdash;&nbsp;<ulink url="http://myrapid.com/webcall/"></ulink>
es: (Teacup no parece estar activo bajo desarrollo, pero los ficheros para descargar están todavía accesibles. Nota que tiene tanto interfaz web como por correo electrónico.)

source: BTT is somewhere between a standard trouble-ticket tracker and a bug tracker. It offers privacy features that are somewhat unusual among open source bug trackers: users of the system are categorized as Staff, Friend, Customer, or Anonymous, and more or less data is available depending on one's category. It offers some email integration, a command-line interface, and mechanisms for converting emails into tickets. It also has features for maintaining information not associated with any specific ticket, such as internal documentation or FAQs.
es: El BTT se situa en algún lugar entre un gestor de etiquetas de problema y un gestor de fallos. Ofrece características de privacidad que son algo inusuales entre los gestores de fallos de código abierto: los usuarios del sistema se clasifican como Plantilla (Staff), Amigo (Friend), Cliente (Customer), o Anónimo (Anonymous), y más o menos los datos son accesibles según la categoría de uno mismo. Ofrece algo de integración con el correo electrónico, una interfaz por línea de comandos, y un mecanismo para convertir correos electrónicos en etiquetas. También posee utilidades para mantener la información no asociada con una etiqueta específica, tal como documentación interna o FAQs. BTT is somewhere between a standard trouble-ticket tracker and a bug tracker. It offers privacy features that are somewhat unusual among open source bug trackers: users of the system are categorized as Staff, Friend, Customer, or Anonymous, and more or less data is available depending on one's category. It offers some email integration, a command-line interface, and mechanisms for converting emails into tickets. It also has features for maintaining information not associated with any specific ticket, such as internal documentation or FAQs.
gl: BTT é unha mestura entre un sistema de rexistro de tickets e un xestor de bugs. Ofrece mecanismos de privacidade que non son frecuentes entre os xestores de bugs. Os usuarios do sistema son clasificados en categorías: empregado (staff), amigo (friend), cliente (customer) ou anónimo. Esta clasificación define o nivel de acceso a máis ou menos datos en función da categoría de cada usuario. Ofrece unha certa integración co e-mail, unha interface de liña de comandos e mecanismos para a conversión de mensaxes de correo electrónico en tickets. Tamén pode xestionar certa información non vinculada directamente a un ticket específico, como documentación interna ou preguntas frecuentes.
