Repository: amaneiro/poss-gl
Catalog: po/*/ch00.po
Languages: es, gl

source: This is not a complete list, of course. Like most open source programmers, I keep loose tabs on many different projects, just to have a sense of the general state of things. I won't name all of them here, but they are mentioned in the text where appropriate.
es: Ésta no es la lista completa, por supuesto. Como muchos de los programadores de Open Source, mantengo varios frentes abiertos en diferentes proyectos, sólo para tener una visión del estado general. No los voy a nombrar a todos aquí, pero seran mencionados a lo largo del libro cuando sea apropiado.
gl: A lista apenas está completa, dado que, como a maior parte dos programadores de código aberto, non mantenho unha memoria exhaustiva dos proxectos nos que colaboro, o xusto para ter unha idea global de como están as cousas. Non os vou enumerar todos nesta sección, mais si están citados en outras partes da obra.

source: Acknowledgments
es: Reconocimientos
gl: Recoñecementos

source: This book took four times longer to write than I thought it would, and for much of that time felt rather like a grand piano suspended above my head wherever I went. Without help from many people, I would not have been able to complete it while staying sane.
es: Éste libro me tomó cuatro veces el tiempo que esperaba para escribirlo, y durante mucho tiempo sentia como si un piano estuviese suspendido sobre mi cabeza a cada lugar al que iba. Sin la ayuda de mucha gente, no habría podido completarlo y seguir cuerdo.
gl: Tardei catro veces máis do que tinha previsto en redactar a presente obra, e durante a maior parte dese tempo o traballo pendente producíame un gran desacougo. Se non tivese recibido a axuda de numerosos colaboradores, non daría rematado o libro sen perder o xuízo.

source: Andy Oram, my editor at O'Reilly, was a writer's dream. Aside from knowing the field intimately (he suggested many of the topics), he has the rare gift of knowing what one meant to say and helping one find the right way to say it. It has been an honor to work with him. Thanks also to Chuck Toporek for steering this proposal to Andy right away.
es: Andy Oram, mi editor en O'Reilly fue el sueño de todo escritor. Aparte de conocer el tema intimamente (él sugirió muchos de los temas), tiene el raro don de saber lo que se intenta decir y ayudar a encontrar la manera correcta de decirlo. Ha sido un honor trabajar con él. Gracias tambien a Chuck Toporek por pasarle ésta propuesta a Andy Right desde el principio.
gl: Andy Oram, de O'Reilly, é o editor que todo autor desexaría ter. Para alén dun fondo conhecemento do campo (suxeriume moitos dos temas), posúe o escaso don de comprender o que un quere dicir e de axudarlle a atopar a mellor maneira de dicilo. Tamén quero agradecerlle a Chuck Toporek o terlle trasladado esta proxecto a Andy de maneira inmediata.

source: Brian Fitzpatrick reviewed almost all of the material as I wrote it, which not only made the book better, but kept me writing when I wanted to be anywhere in the world but in front of the computer. Ben Collins-Sussman and Mike Pilato also checked up on progress, and were always happy to discuss&mdash;sometimes at length&mdash;whatever topic I was trying to cover that week. They also noticed when I slowed down, and gently nagged when necessary. Thanks, guys.
es: Brian Fritzpatrick revisó casí todo el material mientras lo escribía, lo que no sólo hizo el libro mejor, pero me mantuvo escribiendo cuando quería estar en cualquier lugar menos frente a un ordenador. Ben Collins-Sussman y Hike Pilato tambien revisaban de vez en cuando el progreso y siempre se contentaban con discutir&mdash;algunas veces en profundidad&mdash;cualquier tema que intentaba cubrir esa semana. Tambien se daban cuenta cuando reducia la marcha y gentilmente me regañaban cuando era necesario. Gracias tios.
gl: Brian Fitzpatrick revisou a maior parte do material a medida que o redactaba, algo que non só mellorou a obra, senón que tamén me obrigou a escribir mesmo cando o último que quería facer era sentarme diante do computador. Ben Collins-Sussman e Mike Pilato tamén supervisaban o avance da obra, e sempre estaban prontos a debatir (ás veces durante horas) calquera tema no que estivese a traballar na altura. Tamén vixiaban o meu ritmo de traballo, e animábanme a seguir cando se ralentizaba. Desde aquí agradézolles a súa axuda.

source: Biella Coleman was writing her dissertation at the same time I was writing this book. She knows what it means to sit down and write every day, and provided an inspiring example as well as a sympathetic ear. She also has a fascinating anthropologist's-eye view of the free software movement, giving both ideas and references that I was able use in the book. Alex Golub&mdash;another anthropologist with one foot in the free software world, and also finishing his dissertation at the same time&mdash;was exceptionally supportive early on, which helped a great deal.
es: Biela Coleman estaba escribiendo su tésis al mismo tiempo que yo escribía éste libro. Ella sabe lo que significa sentarse cada día a escribir, dandome un ejemplo de inspiración como un oido amigo. Tambien tiene una fascinante vista antropologica del movimiento free software, dandome ídeas y referencias que podría utilizar en el libro. Alex Golub&mdash;otro antropólogo con un pie en el mundo del software libre&mdash;fue un apoyo excepcional que me ayudo inmensamente.
gl: Biella Coleman estaba a redactar a súa tese na altura na que eu estaba a redactar este libro, e sabe o que é sentarse a escribir un día si e outro tamén, tamén foi unha fonte de inspiración e un gran apoio. A súa formación como antropóloga fai que posúa unha fascinante visión do movemento do software libre, e achegou ideas e referencias que empreguei nesta obra. Alex Golub (outro antropólogo que ten un pé no mundo do software libre, e quen tamén estaba a rematar a súa tese na altura) apoioume moito nas fases iniciais, o que foi unha gran axuda.

source: Micah Anderson somehow never seemed too oppressed by his own writing gig, which was inspiring in a sick, envy-generating sort of way, but he was ever ready with friendship, conversation, and (on at least one occasion) technical support. Thanks, Micah!
es: Micah Anderson de alguna manera nunca parecio oprimido por su propio trabajo de escritor, el cual me inspiraba en alguna forma enfermiza y envidiable, pero siempre estuvo listo con su amistad, conversación y (al menos en una ocasión) soporte técnico. ¡Gracias Micah!
gl: Agradecementos tamén a Micah Anderson, que nunca deixou que o atormentase a presión de redactar as súas obras, o que me serviu de inspiración (e me deu algo de envexa tamén). Porén, sempre estaba pronto a axudar, conversar e, polo menos nunha ocasión, prestar apoio técnico.

source: Jon Trowbridge and Sander Striker gave both encouragement and concrete help&mdash;their broad experience in free software provided material I couldn't have gotten any other way.
gl: Jon Trowbridge e Sander Striker animáronme na minha empresa e brindáronse a colaborar nela, sen a súa experiencia en productos de software libre nunca tería rematado a obra.

source: Thanks to Greg Stein not only for friendship and well-timed encouragement, but for showing the Subversion project how important regular code review is in building a programming community. Thanks also to Brian Behlendorf, who tactfully drummed into our heads the importance of having discussions publicly; I hope that principle is reflected throughout this book.
gl: Quero agradecerlle tamén a Greg Stein non só a súa amizade e os seus ánimos no momento adecuado, senón tamén terlle mostrado ao proxecto Subversive a importancia de revisar o código con frecuencia cando se quere crear unha comunidade de programadores. Estendo o meu agradecemento tamén a Brian Behlendorf, quen con gran tacto nos gravou na mente a importancia de debatir as cousas en público, espero que o libro recolla ese principio.

source: Thanks to Benjamin "Mako" Hill and Seth Schoen, for various conversations about free software and its politics; to Zack Urlocker and Louis Suarez-Potts for taking time out of their busy schedules to be interviewed; to Shane on the Slashcode list for allowing his post to be quoted; and to Haggen So for his enormously helpful comparison of canned hosting sites.
gl: Agradézolle a Benjamin «Mako» Hill e a Seth Schoen as conversacións sobre software libre e a súa política, a Zack Urlocker e a Louis Suarez-Potts térense deixado entrevistar a pesar de estaren moi atarefados, a Shane da lista de Slashcode permitirme citar os seus posts, e a Haggen So as comparacións que fixo de aloxamentos web estándar.

source: Thanks to Alla Dekhtyar, Polina, and Sonya for their unflagging and patient encouragement. I'm very glad that I will no longer have to end (or rather, try unsuccessfully to end) our evenings early to go home and work on "The Book."
gl: Agradézolle a Alla Dekthyar, a Polina e a Sonya térenme animado con carinho e paciencia. Alégrame que a partir de agora non tenhamos que rematar (ou debería dicir tratar de rematar) prematuramente as nosas veladas para voltar a casa a traballar no «Libro».

source: Thanks to Jack Repenning for friendship, conversation, and a stubborn refusal to ever accept an easy wrong analysis when a harder right one is available. I hope that some of his long experience with both software development and the software industry rubbed off on this book.
gl: Agradézolle a Jack Repenning a súa amizade, as conversacións que mantivemos e a súa teimuda negativa a aceptar unha análise fácil, mais errada, se for posible facer unha análise correcta, mais difícil. Espero que esta obra se impreganse de parte da súa larga experiencia no desenvolvemento de software libre e a industria do software.

source: CollabNet was exceptionally generous in allowing me a flexible schedule to write, and didn't complain when it went on far longer than originally planned. I don't know all the intricacies of how management arrives at such decisions, but I suspect Sandhya Klute, and later Mahesh Murthy, had something to do with it&mdash;my thanks to them both.
gl: CollabNet fixo gala dunha gran xenerosidade ao facilitarme un horario flexible para poder escribir, e non protestaron cando a redacción do libro demorou máis do previsto. Ignoro os complicados métodos de xestión que existen tras ese tipo de decisións, mais sospeito que Sandra Klute, e máis tarde Mahesh Murthy, tiveron algo que ver. Agradézolle a ambos a súa axuda.

source: The entire Subversion development team has been an inspiration for the past five years, and much of what is in this book I learned from working with them. I won't thank them all by name here, because there are too many, but I implore any reader who runs into a Subversion committer to immediately buy that committer the drink of his choice&mdash;I certainly plan to.
gl: O equipo de desenvolvemento de Subversion serviume de inspiración durante os últimos cinco anos, e unha gran parte do que escribín neste libro aprendino deles. Non vou redactar os meus agradecementos un por un, xa que son demasiados, mais prégolle ao lector que, se coincidir cun membro de Subversion, o invite a unha copa (eu penso facelo).

source: Many times I ranted to Rachel Scollon about the state of the book; she was always willing to listen, and somehow managed to make the problems seem smaller than before we talked. That helped a lot&mdash;thanks.
gl: Queixeime a Rachel Scollon de como levaba a redacción do libro en numerosas ocasións; nunca se negou a escoitarme e de algunha maneira conseguía que os problemas parecesen menos problemas. Agradézolle desde aquí a súa inestimable axuda.

source: Thanks (again) to Noel Taylor, who must surely have wondered why I wanted to write another book given how much I complained the last time, but whose friendship and leadership of Golos&aacute; helped keep music and good fellowship in my life even in the busiest times. Thanks also to Matthew Dean and Dorothea Samtleben, friends and long-suffering musical partners, who were very understanding as my excuses for not practicing piled up. Megan Jennings was constantly supportive, and genuinely interested in the topic even though it was unfamiliar to her&mdash;a great tonic for an insecure writer. Thanks, pal!
gl: Transmítolle (mais unha vez) o meu agradecemento a Noel Taylor, quen con certeza se ten preguntado por que quixen escribir outro libro despois de queixarme tanto a primeira vez, mais cuxa amizade e xestión de Golosá contribuíron a que non me faltase nin música nin boa companhía mesmo cando estaba moi atrarefado. Agradézolle tamén a Matthew Dean e a Dorothea Samtleben, amigos e companheiros de desventuras musicais, a súa comprensión ante as minhas cada vez máis frecuentes excusas para non ensaiar. Megan Jennings apoioume en todo momento, e sempre mostrou un grande interese pola obra a pesar de non conhecer o tema de perto, o que é unha gran axuda para un autor inseguro. Agradézolle a súa axuda a ela tamén.

source: I had four knowledgeable and diligent reviewers for this book: Yoav Shapira, Andrew Stellman, Davanum Srinivas, and Ben Hyde. If I had been able to incorporate all of their excellent suggestions, this would be a better book. As it was, time constraints forced me to pick and choose, but the improvements were still significant. Any errors that remain are entirely my own.
gl: Esta obra foi revisada por catro persoas eruditas e dilixentes: Yoav Shapira, Andrew Stellman, Davanum Srinivas, and Ben Hyde. Este libro ganharía moito se puider inserir todas as súas brillantes suxestións, mais a escaseza de tempo obrigoume a facer unha escolma; contodo, a mellora foi significativa. Calquera erro que houber é responsabilidade exclusiva minha.

source: My parents, Frances and Henry, were wonderfully supportive as always, and as this book is less technical than the previous one, I hope they'll find it somewhat more readable.
gl: Os meus pais, Frances e Henry, ofrecéronme o seu apoio, como sempre, e dado que este libro é menos técnico que o anterior, espero que atopen a súa lectura máis agradable.

source: Finally, I would like to thank the dedicatees, Karen Underhill and Jim Blandy. Karen's friendship and understanding have meant everything to me, not only during the writing of this book but for the last seven years. I simply would not have finished without her help. Likewise for Jim, a true friend and a hacker's hacker, who first taught me about free software, much as a bird might teach an airplane about flying.
gl: Para rematar, gustaríame estender o meu agradecemento ás persoas a quen está dedicada esta obra, Karen Underhill e Jim Blandy. A amizade e o apoio de Karen son todo para min, non só durante a redacción deste libro, senón tamén durante os últimos sete anos. Non o tería rematado se non for por ela. Ídem a respecto de Jim, un grande amigo e hacker entre hackers, e a persoa que me introduciu no software libre pola primeira vez, algo en certa maneira semellante a un paxaro que lle aprendese a voar a un avión.

source: Disclaimer
gl: Renuncia de responsabilidade

source: The thoughts and opinions expressed in this book are my own. They do not necessarily represent the views of CollabNet or of the Subversion project.
es: Los pensamientos y opiniones expresadas en este libro son propias. No representan los puntos de vista de CollabNet o del proyecto Subversion.
gl: As reflexións e opinións reflectidas nesta obra son exclusivamente do autor. Non representan necesariamente a postura de CollabNet ou do proxecto Subversion.
