Repository: amaneiro/poss-gl
Catalog: po/*/ch00.po
Languages: es, gl

source: Preface
es: Prefacio
gl: Preámbulo

source: Why Write This Book?
es: ¿Por qué escribir éste libro?
gl: Por que escribín este libro?

source: At parties, people no longer give me a blank stare when I tell them I write free software. "Oh, yes, open source&mdash;like Linux?" they say. I nod eagerly in agreement. "Yes, exactly! That's what I do." It's nice not to be completely fringe anymore. In the past, the next question was usually fairly predictable: "How do you make money doing that?" To answer, I'd summarize the economics of open source: that there are organizations in whose interest it is to have certain software exist, but that they don't need to sell copies, they just want to make sure the software is available and maintained, as a tool instead of a commodity.
es: Ahora cuando estoy en una fiesta, la gente no se queda con la mirada en blanco cuando les digo que escribo software libre. "Oh sí, código abierto ¿cómo Linux?" me dicen mientras asiento con aprovación. "¡Sí, exactamente! Eso es lo que hago." Es agradable no estar más completamente aislado. Antes, la siguiente pregunta era predecible: "¿Cómo ganas dinero haciendo eso?" Para responder, resumiría así la economía del código abierto: que existen organizaciones interesadas en que cierta clase de software exista, pero que no necesitan vender copias, sólo quieren asegurarse de que esté disponible y mantenido, como una herramienta en lugar de como un servicio.
gl: Nas festas, a xente xa non fica con expresión de dúbida cando lles digo que traballo con software libre. «Ah, si, código aberto, como Linux?» din, tras o que aceno con emoción: «si, iso mesmo!». É agradable deixar de ser un becho raro. Hai tempo, o que preguntarían a seguir era bastante predecible: «e como ganhas a vida con iso?». Para responder a esta pregunta, facíalles un resumo dos aspectos económicos do código aberto; nomeadamente, que hai organizacións ás que lles interesa que exista un determinado software, mais que non precisan vender copias do mesmo, o que lles interesa é asegurarse de que ese software se mantén e de que está á súa disposición; ven nel unha ferramenta antes que un producto.

source: Lately, however, the next question has not always been about money. The business case for open source software<footnote><para>The terms "open source" and "free" are essentially synonymous in this context; they are discussed more in <xref linkend="free-vs-open-source"/><phrase output="printed"> in <xref linkend="introduction"/></phrase>.</para></footnote> is no longer so mysterious, and many non-programmers already understand&mdash;or at least are not surprised&mdash;that there are people employed at it full time. Instead, the question I have been hearing more and more often is "<emphasis>Oh, how does that work?</emphasis>"
es: En cambio, últimamente, la siguiente pregunta no siempre ha tenido que ver con el dinero. El <foreignphrase>Business Case</foreignphrase> del software Open Source <footnote><para>Los términos "código abierto" y "libre" son sinónimos esenciales en éste contexto; son discutidos en mayor profundidad en el <xref linkend="free-vs-open-source"/><phrase output="printed">, en <xref linkend="introduction"/></phrase>.</para></footnote> ya no es tan misterioso, y muchos no-programadores ya entienden&mdash;o al menos no se sorprenden&mdash;que haya gente empleada en ello a tiempo completo. En su lugar, la pregunta que voy escuchando cada vez más es "<emphasis>¿Cómo funciona todo esto?</emphasis>"
gl: Ultimamente, porén, as preguntas que fan a seguir non son sempre de carácter pecuniario. O modelo económico do software libre perdeu boa parte do seu misterio, e moitas persoas alleas á programación xa comprenden (ou ao menos non se sorprenden ao escoitaren) que hai quen traballa con software libre a tempo enteiro. Antes ben, a pregunta que máis tenho escoitado é a seguinte: «e como é que funciona iso?»

source: I didn't have a satisfactory answer ready, and the harder I tried to come up with one, the more I realized how complex a topic it really is. Running a free software project is not exactly like running a business (imagine having to constantly negotiate the nature of your product with a group of volunteers, most of whom you've never met!). Nor, for various reasons, is it exactly like running a traditional non-profit organization, nor a government. It has similarities to all these things, but I have slowly come to the conclusion that free software is <foreignphrase>sui generis</foreignphrase>. There are many things with which it can be usefully compared, but none with which it can be equated. Indeed, even the assumption that free software projects can be "run" is a stretch. A free software project can be <emphasis>started</emphasis>, and it can be influenced by interested parties, often quite strongly. But its assets cannot be made the property of any single owner, and as long as there are people somewhere&mdash;anywhere&mdash;interested in continuing it, it cannot be unilaterally shut down. Everyone has infinite power; everyone has no power. It makes for an interesting dynamic.
es: No tenía una respuesta satisfactoria lista y cuan más duro intentaba pensar en una, más me daba cuenta de cuan complejo realmente es el tema. Llevar un proyecto de software libre no es exactamente como dirigir un negocio (imaginemos tener que negociar constantemente la naturaleza de nuestro producto con un grupo de voluntarios, muchos de los cuales ¡ni siquiera conocemos!). Tampoco es, por varias razones, como llevar una organización sin ánimo de lucro tradicional o un gobierno. Es similar a todas ellas, pero poco a poco he llegado a la conclusión de que el software libre es <foreignphrase>sui generis</foreignphrase>. Existen muchas cosas con las que puede ser comparado por su utilidad, pero con ninguna puede ser igualado. En realidad, asumir que el software libre puede ser dirigido es iluso. Un proyecto de software libre puede ser <emphasis>iniciado</emphasis> y puede ser influenciado, fuertemente, por algunas partes interesadas. Pero sus activos no pueden ser hechos propiedad de un sólo dueño, así que mientras haya gente en alguna parte&mdash;cualquier parte&mdash; interesada en continuar con el proyecto, no puede ser cancelado unilateralmente. Todos tienen poder infinito; nadie tiene poder. Una dinámica muy interesante.
gl: Todavía non dei cunha resposta satisfactoria, e canto máis trato de atopar unha, máis me decato de que se trata dun tema moi complexo. Xerir un proxecto de software libre non é exactamente como xerir un negocio (imaxinade como sería ter que negociar constantemente a natureza do voso producto cunha turma de voluntarios, moitos dos cales non conheceriades persoalmente), mais tampouco é exactamente como xerir unha organización non gubernamental clásica, nin tampouco un governo. Ten analoxías con todo iso, mais, co tempo, cheguei á conclusión de que o software libre constitúe un xénero per se. Pode ser comparado con maior ou menor suceso con multitude de cousas, mais nunca en relación de igualdade. Mesmo a presunción de que os proxectos de software libre poden ser «xeridos» é unha esaxeración: un proxecto de software libre pode ser iniciado, e pode ser influenciado polas partes interesadas, frecuentemente de maneira considerable, mais o material non pode pasar a mans dun único propietario e, sempre que houber alguén (en calquera lugar) interesado en continuar co proxecto, este non pode ser cancelado de maneira unilateral. Todos os membros tenhen poder ilimitado e todos son impotentes, o que crea unha dinámica interesante.

source: That is why I wanted to write this book. Free software projects have evolved a distinct culture, an ethos in which the liberty to make the software do anything one wants is a central tenet, and yet the result of this liberty is not a scattering of individuals each going their own separate way with the code, but enthusiastic collaboration. Indeed, competence at cooperation itself is one of the most highly valued skills in free software. To manage these projects is to engage in a kind of hypertrophied cooperation, where one's ability not only to work with others but to come up with new ways of working together can result in tangible benefits to the software. This book attempts to describe the techniques by which this may be done. It is by no means complete, but it is at least a beginning.
es: Es por esto que quería escribir éste libro. Los proyectos de software libre han permitido a una nueva cultúra evolucionar, un <foreignphrase>ethos</foreignphrase> en el cual la libertad de hacer que el software haga cualquier cosa que deseamos sea el eje central, sin embargo, el resultado de ésta libertad no es la dispersión de los individuos, cada uno trabajando por su cuenta en el código, sino la colaboración entusiasta. De hecho, ser un cooperador competente es en si, una de las cualidades mas valoradas en el software libre. Dirigir uno de estos proyectos es abordar un tipo de cooperación hipertrofiada, donde la habilidad de, no sólo trabajar con otros, pero de ingeniar nuevas maneras de trabajar en conjunto, pueden producir beneficios tangibles para el desarrollo. Este libro intenta describir las técnicas con las que esto se puede lograr. No es de ninguna manera completo, pero al menos es un inicio.
gl: Eses son os motivos que me impulsaron a redactar este libro. Os proxectos de software libre tornáronse nunha cultura característica, un etos que ten como dogma central a liberdade de lograr que o software faga o que un quixer, sen que isto suponha a disgregación dos programadores, antes ben, que colaboren con máis forza. A capacidade de cooperación é, de facto, unha das habilidades máis cotizadas no ámbito do software libre. Xerir un proxecto desta índole implica mergullarse nunha especie de cooperacion hipertrofiada, e a capacidade de descubrir novas vías de cooperación, para alén da capacidade de traballo en equipo, pode repercutir de maneira moi positiva sobre o producto. A finalidade deste libro é describir as técnicas que poden axudar a conseguilo. Non é unha obra exhaustiva, mais serve polo menos como punto de partida.

source: Good free software is a worthy goal in itself, and I hope that readers who come looking for ways to achieve it will be satisfied with what they find here. But beyond that I also hope to convey something of the sheer pleasure to be had from working with a motivated team of open source developers, and from interacting with users in the wonderfully direct way that open source encourages. Participating in a successful free software project is <emphasis>fun</emphasis>, and ultimately that's what keeps the whole system going.
es: El buen software libre es ya en si mismo un objetivo y espero que aquellos lectores que vengan buscando como lograrlo esten satisfechos con lo que van a encontrar aquí. Pero más allá de esto, espero transmitir algo del doloroso placer de trabajar con un equipo motivado de desarrolladores de código abierto y de la interacción con los usuarios en la maravillosa manera directa que el Open Source anima. Participar en un proyecto de software libre exitoso es <emphasis>divertido</emphasis> y en última instancia es esto lo que mantiene a todo el sistema funcionando.
gl: O software libre de calidade constitúe un obxectivo en si mesmo, e espero que esta obra satisfaga os lectores que se sirvan dela para o atinxiren. Para alén diso, espero tamén que participen do pracer que se obtén ao traballar nun equipo de desenvolvedores de código aberto motivados, e da relación directa co usuario que alenta o código aberto. Participar nun proxecto de software libre ben sucedido é divertido, e é, en definitiva, a causa de que o proceso non se detenha.

source: Who Should Read This Book?
es: ¿Quíen debería leer éste libro?
gl: A quen está orientado este libro?

source: This book is meant for software developers and managers who are considering starting an open source project, or who have started one and are wondering what to do now. It should also be helpful for people who just want to participate in an open source project but have never done so before.
es: Este libro está enfocado a desarrolladores y directores quienes esten considerando iniciar un proyecto de software libre o que ya hayan iniciado uno y esten planeado qué hacer ahora. Tambien debería ser útil para aquellas personas que quieren participar en un proyecto Open Source y que nunca lo han hecho.
gl: A presente obra está orientada a desenvolvedores de software e xerentes que tenhen en mente iniciar un proxecto de software libre, ou que xa o iniciaran e non saben como continuar; tamén pode ser de utilidade a quen quixer participar nun proxecto de software libre pola primeira vez.

source: The reader need not be a programmer, but should know basic software engineering concepts such as source code, compilers, and patches.
es: El lector no necesita ser un programador, pero debe conocer conceptos básicos de ingéniera informática como código fuente, compiladores y parches.
gl: O lector non ten por que saber programar, porén, debería pusuír nocións básicas de conceptos de enxenharía de software tales como código fonte, compiladores e remendos (patches).

source: Prior experience with open source software, as either a user or a developer, is not necessary. Those who have worked in free software projects before will probably find at least some parts of the book a bit obvious, and may want to skip those sections. Because there's such a potentially wide range of audience experience, I've made an effort to label sections clearly, and to say when something can be skipped by those already familiar with the material.
es: Experiencia anterior con software Open Source como usuario o desarrollador no es necesaria. Quienes hayan trabajado en proyectos de software libre con anterioridad probablemente encuentren algunas partes del libro algo obvias y quizas deseen saltar esas secciones. Dado que potencialmente existe una amplia audiencia experimientada, he hecho un esfuerzo para etiquetar claramente cada sección y decir cuando algo puede ser omitido por quienes ya estan familiarizados en la materia.
gl: Non é necesario posuír experiencia previa como usuario ou desenvolvedor de software libre. É posible que quen tiver traballado con anterioridade en proxectos de software libre pense que certas partes da obra son obvias de mais, e talvez desexe evitar esas seccións; mais o grao de experiencia dos lectores é tan variable que fixen un esforzo para etiquetar as seccións con claridade, e indiquei cales poden ser ignoradas se xa se dominan os conceptos que nelas se tratan.

source: Sources
es: Fuentes
gl: Fontes

source: Much of the raw material for this book came from five years of working with the Subversion project (<ulink url="http://subversion.tigris.org/"></ulink>). Subversion is an open source version control system, written from scratch, and intended to replace CVS as the <foreignphrase>de facto</foreignphrase> version control system of choice in the open source community. The project was started by my employer, CollabNet (<ulink url="http://www.collab.net/"></ulink>), in early 2000, and thank goodness CollabNet understood right from the start how to run it as a truly collaborative, distributed effort. We got a lot of volunteer developer buy-in early on; today there are 50-some developers on the project, of whom only a few are CollabNet employees.
es: Mucha de la materia prima para éste libro viene de trabajar durante cinco años con el proyecto Subversion (<ulink url="http://subversion.tigris.org/"></ulink>). Subversion es un sistema de código abierto para el control de versiones, escrito desde cero con la intención de reemplazar a CVS como el sistema de control de versiones <foreignphrase>de facto</foreignphrase> utilizado por la comunidad Open Source. El proyecto fue iniciado por la empresa en la que trabajo, CollabNet (<ulink url="http://www.collab.net/"></ulink>), a principios del año 2000 y gracias a Dios, CollabNet entendio desde el inicio a llevarlo como un esfuerzo colaborativo y distribuido. Desde el principio tuvimos muchos desarrolladores voluntarios; hoy somos unos 50 en el proyecto, de los cuales sólo unos pocos son empleados de CollabNet.
gl: Gran parte do material que forma a obra é debido aos cinco anos que traballei co proxecto Subversion (<ulink url="http://subversion.tigris.org/"></ulink>) . Subversion é un sistema de control de versións de código aberto escrtio desde cero, e preténdese que substitúa CVS para tornarse no sistema de control de versións de preferencia na comunidade de código aberto. O proxecto foi iniciado pola empresa para a que traballaba, CollabNet (<ulink url="http://www.collab.net/"></ulink>), a comezos de 2000 e, afortunadamente, souberon administralo desde o inicio como un proxecto de colaboración de múltiples partes. Un elevado número de desenvolvedores voluntarios aderíronse ao proxecto desde o inicio, que conta na actualidade con máis de 50 desenvolvedores, dos que unicamente unha pequena parte traballan para CollabNet.

source: Subversion is in many ways a classic example of an open source project, and I ended up drawing on it more heavily than I originally expected. This was partly a matter of convenience: whenever I needed an example of a particular phenomenon, I could usually call one up from Subversion right off the top of my head. But it was also a matter of verification. Although I am involved in other free software projects to varying degrees, and talk to friends and acquaintances involved in many more, one quickly realizes when writing for print that all assertions need to be fact-checked. I didn't want to make statements about events in other projects based only on what I could read in their public mailing list archives. If someone were to try that with Subversion, I knew, she'd be right about half the time and wrong the other half. So when drawing inspiration or examples from a project with which I didn't have direct experience, I tried to first talk to an informant there, someone I could trust to explain what was really going on.
es: Subversion es de muchas maneras un clásico ejemplo de un proyecto Open Source y termine aproximandome más de lo que originalmente esperaba. Parte de esto fue una cuestión de conveniencia: cada vez que necesitaba un ejemplo de un fenómeno en partícular, usualmente podía recordar alguno sobre Subversion. Pero tambien fue una cuestión de verificación. Aunque estoy inmerso en otros proyecto de software libre a diversos niveles, y que converso con amigos y conocidos envueltos en muchos otros, rapidamente me he dado cuenta que al escribir para la imprenta, todas las afirmaciones deben ser veríficadas con hechos. No deseaba hacer declaraciones acerca de situaciones presentes en otros proyectos basandome sólo en lo que podía leer en las listas de correo. Si alguien intentase algo así con Subversion sé que sólo estaria en lo correcto la mitad de las veces y equivocado la otra mitad. Así que al buscar inspiración o ejemplos en proyectos con los que no tenía experiencia directa, intentaba primero hablar con algún informador, alguien en quien confiará para explicarme qué estaba sucediendo realmente
gl: Subversion é un exemplo case perfecto do que debe ser un proxecto de software libre, e finalmente baseeime nel máis do que pensaba facer inicialmente; en parte polas vantaxes que ofrecía, xa que me fornecía de inesgotables exemplos para ilustrar determinados fenómenos, mais tamén por cuestións de fidelidade. Embora colaboro con outros proxectos de software libre en maior ou menor grao, e tenho amigos e conhecidos que traballan en moitos outros, un decátase logo de que, ao ponher as cousas sobre o papel, é necesario procurar referentes reais de todo o que se afirma. Non quería facer referencias a outros proxectos baseándome exclusivamente no que lía nas listas públicas de correo, xa que se alguén actuase deste xeito con Subversion acertaría só a metade das veces. Así, sempre que me mergullei en proxectos cos que non tinha experiencia de primeira man á procura de inspiración ou exemplos, tratei de falar con algún membro dos mesmos para que me explicase a situación real dos mesmos.

source: Subversion has been my job for the last 5 years, but I've been involved in free software for 12. Other projects that influenced this book include:
es: Subversion ha sido mi trabajo durante los ultimos cinco años pero he estado involucrado en el software libre durante otros doce. Otros proyectos que han influenciado éste libro son:
gl: Traballei en Subversion os últimos 5 anos, mais xa levo 12 anos no mundo do software libre. Outros proxectos que deron forma a esta obra son:

source: The GNU Emacs text editor project at the Free Software Foundation, in which I maintain a few small packages.
es: El proyecto de la Free Software Foundation GNU Emacs, un editor de texto del cual mantengo algunos páquetes pequeños
gl: O proxecto de editor de texto GNU Emacs da Fundación para o Software Libre (Free Software Foundation), no que mantenho uns poucos pacotes.

source: Concurrent Versions System (CVS), which I worked on intensely in 1994&ndash;1995 with Jim Blandy, but have been involved with only intermittently since.
es: Sistema de versiones concurrentes, del íngles Concurrent Version System (CVS) en el que trabajé intensamente en 1994&dash;1995 con Jim Blandy y en el que sigo trabajando intermitentemente desde entonces.
gl: Concurrent Version System (CVS, Sistema de Versións Concorrentes), no que traballei a fondo en 1994-95 con Jim Bandy, mais co que colaboro só esporádicamente desde entón.

source: The collection of open source projects known as the Apache Software Foundation, especially the Apache Portable Runtime (APR) and Apache HTTP Server.
es: La colección de proyectos Open Source conocidos como la Fundación de Software Apache, especialmente en el Apache Portable Runtime (APR) y en el servidor Apache HTTP.
gl: A colección de proxectos de código aberto conhecida como Apache Software Foundation, en particular o Apache Portable Runtime (APR) e o Servidor HTTP Apache (Apache HTTP Server).

source: OpenOffice.org, the Berkeley Database from Sleepycat, and MySQL Database; I have not been involved with these projects personally, but have observed them and, in some cases, talked to people there.
es: OpenOffice.org, las bases de datos Berkeley de Sleepycat y MySQL; No he estado envuelto personalmente en estos proyectos, pero los he observado y, en algunos casos, hablado con personas en ellos.
gl: OpenOffice.org, a base de datos de Berkeley de Sleepycat, e a base de datos MySQL; non formei parte deses proxectos persoalmente, mais os seguín de perto e en ocasións falei con algúns dos seus membros.

source: GNU Debugger (GDB) (likewise).
es: GNU Debugger (GDB) (igual que con los anteriores).
gl: GNU Debugger (GDB) (ídem)

source: The Debian Project (likewise).
es: Proyecto Debian (igual que con los anteriores).
gl: O proxecto Debian (ídem).
