Repository: amaneiro/poss-gl
Catalog: po/*/ch01.po
Languages: gl

source: Introduction
gl: Introdución

source: Most free software projects fail.
gl: Case todos os proxectos de software libre fracasan.

source: We tend not to hear very much about the failures. Only successful projects attract attention, and there are so many free software projects in total<footnote><para>SourceForge.net, one popular hosting site, had 79,225 projects registered as of mid-April 2004. This is nowhere near the total number of free software projects on the Internet, of course; it's just the number that chose to use SourceForge.</para></footnote> that even though only a small percentage succeed, the result is still a lot of visible projects. We also don't hear about the failures because failure is not an event. There is no single moment when a project ceases to be viable; people just sort of drift away and stop working on it. There may be a moment when a final change is made to the project, but those who made it usually didn't know at the time that it was the last one. There is not even a clear definition of when a project is expired. Is it when it hasn't been actively worked on for six months? When its user base stops growing, without having exceeded the developer base? What if the developers of one project abandon it because they realized they were duplicating the work of another&mdash;and what if they join that other project, then expand it to include much of their earlier effort? Did the first project end, or just change homes?
gl: Poucas veces nos chegan noticias dos fracasos. Os únicos proxectos que chaman a atención son os ben sucedidos, e o cantidade total de proxectos é tan elevada <footnote><para>SourceForge.net, un aloxamento web moi conhecido, tinha rexistrados 79.225 proxectos a mediados de abril de 2004. Este número é moi inferior ao total de proxectos en activo, trátase unicamente dos que escolleron Sourceforge.</footnote></para> que, embora só unha pequena porcentaxe sobreviven o fracaso, o número de sucesos é alto. E non nos chegan noticias dos fracasos porque un fracaso non é un acontecemento importante. Un proxecto non deixa de ser viable nunha altura concreta, máis ben pódese considerar que os membros vanse afastando pouco a pouco do mesmo e deixan de traballar nel. É posible que, nunha altura concreta, sexa feita unha mudanza definitiva no proxecto, mais é frecuente que os responsables non se decaten de que se trata da derradeira modificación ata tempo despois. Nin sequera existe unha definición clara de cando remata un proxecto. Cando pasan seis meses sen que ninguén traballe nel? Cando a base de usuarios deixa de medrar, sen ultrapasar a base de desenvolvedores? Que acontece se os desenvolvedores dun proxecto o abandonan porque se decatan de que están a duplicar o traballo de outros, e que acontece se adscriben a outro proxecto, e o amplían ata incluíren nel a maior parte do seu traballo anterior? Consideráse que o proxecto inicial rematou, ou que simplemente mudou de nome?

source: Because of such complexities, it's impossible to put a precise number on the failure rate. But anecdotal evidence from over a decade in open source, some casting around on SourceForge.net, and a little Googling all point to the same conclusion: the rate is extremely high, probably on the order of 90&ndash;95%. The number climbs higher if you include surviving but dysfunctional projects: those which <emphasis>are</emphasis> producing running code, but which are not pleasant places to be, or are not making progress as quickly or as dependably as they could.
gl: Estas complicacións fan que sexa difícil especificar o número de proxectos que fracasan, mais a experiencia de máis de unha década no mundo do código aberto, unha pequena procura en SourceForge.net e un toque de Google lévanos a concluír que a procentaxe de fracasos é moi elevada, posiblemente de 90-95%. Esta porcentaxe aumenta se incluírmos proxectos activos mais disfuncionais (aqueles que están a producir código operativo, mais que non son atractivos, ou cuxos avances non son tan rápidos ou fiables como deberían).

source: This book is about avoiding failure. It examines not only how to do things right, but how to do them wrong, so you can recognize and correct problems early. My hope is that after reading it, you will have a repertory of techniques not just for avoiding common pitfalls of open source development, but also for dealing with the growth and maintenance of a successful project. Success is not a zero-sum game, and this book is not about winning or getting ahead of the competition. Indeed, an important part of running an open source project is working smoothly with other, related projects. In the long run, every successful project contributes to the well-being of the overall, worldwide body of free software.
gl: O obxectivo desta obra é aprender como evitar o fracaso. Non se limita a examinar como facer as cousas ben, senón tamén como facelas mal, para que poidas decatarte dos problemas a tempo. Espero que este libro che forneza un repertorio de técnicas non só para evitares os atrancos máis frecuentes no desenvolvemento do código aberto, senón tamén para administrares o desenvolvemento e mantemento dun proxecto ben sucedido. O suceso non é un xogo de soma cero, e esta obra non explica como ganhar ou ultrapasar a concorrencia. Unha parte importante da xestión dun proxecto de código aberto é, de facto, traballar en harmonía con outros proxectos relacionados. A longo prazo, todo proxecto ben sucedido contribúe á saúde do software libre a nivel mundial.

source: It would be tempting to say that free software projects fail for the same sorts of reasons proprietary software projects do. Certainly, free software has no monopoly on unrealistic requirements, vague specifications, poor resource management, insufficient design phases, or any of the other hobgoblins already well known to the software industry. There is a huge body of writing on these topics, and I will try not to duplicate it in this book. Instead, I will attempt to describe the problems peculiar to free software. When a free software project runs aground, it is often because the developers (or the managers) did not appreciate the unique problems of open source software development, even though they might have been quite prepared for the better-known difficulties of closed-source development.
gl: Podemos sentir a tentación de dicir que os os proxectos de software libre fracasan polos mesmos motivos que os proxectos de software propietario. Os requisitos irreais, as especificacións vagas, a xestión inadecuada de recursos, as fases de desenho insuficientes, ou calquera outro atranco non son patrimonio exclusivo do software libre, tamén son ben conhecidos por calquera que traballe na industria do software. Existen numerosas publicacións que tratan eses temas, así que non os vou comentar nesta obra; tratarei de describir os problemas exclusivos do software libre. Con frecuencia, o fracaso dun proxecto de software libre é debido a que os desenvolvedores (ou os administradores) non se decatan dos problemas que presenta o desenvolvemento de código aberto, embora sexan que de indentificar as dificultades, máis conhecidas, que presenta o desenvolvemento de código pechado.

source: One of the most common mistakes is unrealistic expectations about the benefits of open source itself. An open license does not guarantee that hordes of active developers will suddenly volunteer their time to your project, nor does open-sourcing a troubled project automatically cure its ills. In fact, quite the opposite: opening up a project can add whole new sets of complexities, and cost <emphasis>more</emphasis> in the short term than simply keeping it in-house. Opening up means arranging the code to be comprehensible to complete strangers, setting up a development web site and email lists, and often writing documentation for the first time. All this is a lot of work. And of course, if any interested developers <emphasis>do</emphasis> show up, there is the added burden of answering their questions for a while before seeing any benefit from their presence. As developer Jamie Zawinski said about the troubled early days of the Mozilla project:
gl: Un dos erros máis frecuentes é crearse expectativas irreais sobre as vantaxes do código aberto en sí mesmo. Unha licenza de código aberto non é garantía de que milleiros de desenvolvedores van participar no teu proxecto; nin liberar o código dun proxecto vai solucionar os problemas que este tiver. Antes ben, soe acontecer o contrario: liberar un proxecto pode acarretar novas dificultades, e ser máis custoso a curto prazo que se se mantiver en privado. Liberar un proxecto implica ordenar o código para que persoas alleas ao mesmo o poidan comprender, crear un sito web de desenvolvemento e listas de correo, e en moitos casos redactar documentación pola primeira vez, o que supón unha carga considerable de traballo. E, por suposto, se algúns desenvolvedores sí se prestan voluntarios, hai que resolver as súas dúbidas antes de comezar a ver os resultados do seu traballo. O desenvolvedor Jamie Zawinski dicía o seguinte sobre os duros comezos do proxecto Mozilla:

source: Open source does work, but it is most definitely not a panacea. If there's a cautionary tale here, it is that you can't take a dying project, sprinkle it with the magic pixie dust of "open source," and have everything magically work out. Software is hard. The issues aren't that simple.
gl: O código aberto funciona, mais non é unha panacea. Podemos tirar a seguinte conclusión: non se pode coller un proxecto moribundo, botarlle os pós máxicos do «código aberto» e esperar que todo saia ben. O software é un terreo difícil, os problemas non son sinxelos.

source: (from <emphasis role="bold"><ulink url="http://www.jwz.org/gruntle/nomo.html"></ulink></emphasis>)
gl: (de <emphasis role="bold"><ulink url="http://www.jwz.org/gruntle/nomo.html"></ulink></emphasis>)

source: A related mistake is that of skimping on presentation and packaging, figuring that these can always be done later, when the project is well under way. Presentation and packaging comprise a wide range of tasks, all revolving around the theme of reducing the barrier to entry. Making the project inviting to the uninitiated means writing user and developer documentation, setting up a project web site that's informative to newcomers, automating as much of the software's compilation and installation as possible, etc. Many programmers unfortunately treat this work as being of secondary importance to the code itself. There are a couple of reasons for this. First, it can feel like busywork, because its benefits are most visible to those least familiar with the project, and vice versa. After all, the people who develop the code don't really need the packaging. They already know how to install, administer, and use the software, because they wrote it. Second, the skills required to do presentation and packaging well are often completely different from those required to write code. People tend to focus on what they're good at, even if it might serve the project better to spend a little time on something that suits them less. <xref linkend="getting-started"/> discusses presentation and packaging in detail, and explains why it's crucial that they be a priority from the very start of the project.
gl: Un problema que ten a ver con isto é a escasa importancia que se lle dá á presentación e á configuración dos pacotes, partindo da premisa de que sempre se pode facer máis adiante. A presentación a configuración dos pacotes envolven múltiples tarefas, todas elas encaminhadas a mellorar a accesibilidade. Para tornar o proxecto atractivo para os non iniciados, é necesario redactar documentación para os usuarios e os desenvolvedores, crear un Web do proxecto con información para os que acaban de chegar, automatizar a compilación e instalación o máximo posible, etc. Infelizmente, moitos programadores contemplan estas tarefas como algo secundario en comparación co código en si mesmo. Isto é debido a dous motivos principalmente. En primeiro lugar, pode parecer traballo inútil, xa que os máis beneficiados son aqueles que menos familiarizados están co proxecto, e viceversa; despois de todo, os desenvolvedores do código non necesitan os pacotes, porque xa saben como administrar, instalar e utilizar o software, non hai que esquecer que o código foi escrito por eles. E en segundo lugar, as habilidades necesarias para configurar a presentación e os pacotes son frecuentemente moi distintas das habilidades necesarias para crear o código. Os individuos tenden a concentrarse no que destacan, mesmo se facendo outra cousa na que tenhen menos destreza lle darían un maior pulo ao proxecto. O capítulo 2, Primeiros Pasos, fala de maneira detallada sobre a presentación e a configuración de pacotes, e explica por que é extremadamente importante darlles prioridade desde o inicio do proxecto.

source: Next comes the fallacy that little or no project management is required in open source, or conversely, that the same management practices used for in-house development will work equally well on an open source project. Management in an open source project isn't always very visible, but in the successful projects, it's usually happening behind the scenes in some form or another. A small thought experiment suffices to show why. An open source project consists of a random collection of programmers&mdash;already a notoriously independent-minded category&mdash;who have most likely never met each other, and who may each have different personal goals in working on the project. The thought experiment is simply to imagine what would happen to such a group <emphasis>without</emphasis> management. Barring miracles, it would collapse or drift apart very quickly. Things won't simply run themselves, much as we might wish otherwise. But the management, though it may be quite active, is often informal, subtle, and low-key. The only thing keeping a development group together is their shared belief that they can do more in concert than individually. Thus the goal of management is mostly to ensure that they continue to believe this, by setting standards for communications, by making sure useful developers don't get marginalized due to personal idiosyncracies, and in general by making the project a place developers want to keep coming back to. Specific techniques for doing this are discussed throughout the rest of this book.
gl: Outro erro común é crer que non se necesita xerir os proxectos de código aberto, ou pola contra, crer que as estratexias de xestión empregadas nos proxectos pechados terán o mesmo suceso se foren aplicadas a proxectos de código aberto. As tarefas de xestión dun proxecto de código aberto non sempre son aparentes, mais case sempre están, dunha maneira ou de outra, detrás dos proxectos ben sucedidos, como mostra un sinxelo experimento mental. Un proxecto de código aberto consta dun conxunto variable de programadores (ben conhecidos por seren unha turma anárquica de seu) que, na maioría dos casos, non se conhecen persoalmente, e que posiblemente participarán no proxecto por motivos distintos. O experimento mental consiste en imaxinar como acabaría un grupo destas características sen administradores. Se non intervir un milagre, desaparecería ou disolveríase logo. Os proxectos non avanzan de motu propio, por máis que quixeramos que así fose. Mais as tarefas de xestión, embora activas, adoitan ser informais, sutís e elementais. O único que mantén unido o grupo de desenvolvedores é a crenza de que xuntos poden chegar máis lonxe que por separado. A finalidade das tarefas de xestión é, principalmente, garantir que mantenhan esa crenza, establecendo reglas básicas de comunicación, asegurando que bos desenvolvedores non sexan marxinados debido a idiosincrasias persoais e, en xeral, tornando o proxecto atractivo para os desenvolvedores. A presente obra explica con detalle as técnicas específicas para atinxir estes obxectivos.

source: Finally, there is a general category of problems that may be called "failures of cultural navigation." Ten years ago, even five, it would have been premature to talk about a global culture of free software, but not anymore. A recognizable culture has slowly emerged, and while it is certainly not monolithic&mdash;it is at least as prone to internal dissent and factionalism as any geographically bound culture&mdash;it does have a basically consistent core. Most successful open source projects exhibit some or all of the characteristics of this core. They reward certain types of behaviors, and punish others; they create an atmosphere that encourages unplanned participation, sometimes at the expense of central coordination; they have concepts of rudeness and politeness that can differ substantially from those prevalent elsewhere. Most importantly, longtime participants have generally internalized these standards, so that they share a rough consensus about expected conduct. Unsuccessful projects usually deviate in significant ways from this core, albeit unintentionally, and often do not have a consensus about what constitutes reasonable default behavior. This means that when problems arise, the situation can quickly deteriorate, as the participants lack an already established stock of cultural reflexes to fall back on for resolving differences.
gl: En último lugar, existe unha categoría de problemas que se pode denominar «fracasos da navigación cultural». Hai dez anos, mesmo hai cinco, sería prematuro falarmos dunha cultura global do software libre, mais isto xa non é así. Unha cultura identificable apareceu de vagar e, embora non sexa monolítica (é tan propensa a sufrir discordancias internas e sectarismos como calquera outra cultura asociada a un lugar xeográfico), posúe un núcleo razonablemente sólido. A maior parte dos proxectos de software libre comparten unha ou varias das características deste núcleo: recompensan certo tipo de comportamentos e condenan outros, crean unha atmosfera que invita á participación espontánea (ás veces a expensas dunha coordinación central), a súa visión do que é correcto ou incorrecto pode diferir notablemente da visión maioritaria noutros ámbitos. E, sobre todo, moitos dos colaboradores a longo prazo xa interiorizaron estas características, polo que comparten un certo consenso sobre cal debe ser a conducta a seguir. Os proxectos que fracasan soen afastarse dese núcleo, aínda que o fagan inconscientemente, e xeralmente carecen de ese consenso a respecto do comportamento que cabe esperar. Cando aparecen os problemas, a situación pode empeorar rapidamente, xa que os participantes carecen dos reflexos culturais nos que apoiarse para resolveren a súas diferenzas.

source: This book is a practical guide, not an anthropological study or a history. However, a working knowledge of the origins of today's free software culture is an essential foundation for any practical advice. A person who understands the culture can travel far and wide in the open source world, encountering many local variations in custom and dialect, yet still be able to participate comfortably and effectively everywhere. In contrast, a person who does not understand the culture will find the process of organizing or participating in a project difficult and full of surprises. Since the number of people developing free software is still growing by leaps and bounds, there are many people in that latter category&mdash;this is largely a culture of recent immigrants, and will continue to be so for some time. If you think you might be one of them, the next section provides background for discussions you'll encounter later, both in this book and on the Internet. (On the other hand, if you've been working with open source for a while, you may already know a lot of its history, so feel free to skip the next section.)
gl: Este libro é unha guía práctica, non unha historia nin un estudo antropolóxico. Porén, uns certos conhecementos útiles sobre as orixes da cultura do software libre actual constitúen o alicerce fundamental de calquera consello práctico. Un individuo con conhecementos sobre esta cultura pode chegar lonxe no mundo do software libre; atopará multitude de peculiaridades e «dialectos», mais poderá participar comoda e eficazmente en calquera lugar. En troca, un individuo que non comprenda esta cultura, atopará o proceso de organización ou participación nun proxecto difícil e cheo de sorpresas. Dado que o número de desenvolvedores de software continúa a aumentar, hai moita xente nesta última categoría. É esta unha cultura de inmigrantes recentes, e continuará a selo durante un tempo. Se pensas que es un destes últimos, a seguinte sección proporcionarache conceptos básicos útiles para posteriores discusións, tanto na presente obra como en Internet. (Por outra banda, se levas tempo traballando con código aberto, é posible que saibas moito sobre a súa historia, e talvez desexes saltar a seguinte sección).

source: History
gl: Historia

source: Software sharing has been around as long as software itself. In the early days of computers, manufacturers felt that competitive advantages were to be had mainly in hardware innovation, and therefore didn't pay much attention to software as a business asset. Many of the customers for these early machines were scientists or technicians, who were able to modify and extend the software shipped with the machine themselves. Customers sometimes distributed their patches back not only to the manufacturer, but to other owners of similar machines. The manufacturers often tolerated and even encouraged this: in their eyes, improvements to the software, from whatever source, just made the machine more attractive to other potential customers.
gl: O feito de compartir software é tan vello como o propio software. Nos inicios da era dos computadores, os fabricantes crían que as vantxes competitivas dependían das innovacións no terreo do hardware, e en consecuencia non contemplaban o software como un factor de negocio. Moitos dos compradores deses computadores eran cientistas e técnicos, capaces de modificar e ampliar o software que acompanhaba as máquinas. Con frecuencia, os clientes enviasen as súas versións non só aos fabricantes, senón tamén a outros propietarios de computadores semellantes. Os fabricantes soían tolerar e mesmo alentar este comportamento: para eles, as melloras feitas no software, sen importar por quen, tornaban o compoutador máis atractivo para outros clientes potenciais.
