Repository: amaneiro/poss-gl
Catalog: po/*/ch01.po
Languages: gl

source: But the real reason for the re-labeling is a marketing one. We're trying to pitch our concept to the corporate world now. We have a winning product, but our positioning, in the past, has been awful. The term "free software" has been misunderstood by business persons, who mistake the desire to share with anti-commercialism, or worse, theft.
gl: Mais a mudanza de nome é de carácter puramente mercantil, xa que queremos trasladar as nosas ideas ao mundo empresarial. Disponhemos dun producto excelente, mais a nos posición no pasado era desastrosa. Os executivos non comprenden o significado real do termo «software libre», identifican o desexo de compartir con estratexias anticomerciais, ou aínda peor, con roubar.

source: Mainstream corporate CEOs and CTOs will never buy "free software." But if we take the very same tradition, the same people, and the same free-software licenses and change the label to "open source" ? that, they'll buy.
gl: A maior parte dos grandes executivos nunca van comprar «software libre». Mais se collermos a mesma tendencia, a mesma xente e as mesmas licenzas, e mudarmos o nome para «código aberto», si van comprar.

source: Some hackers find this hard to believe, but that's because they're techies who think in concrete, substantial terms and don't understand how important image is when you're selling something.
gl: Para algúns hackers é difícil de crer, porque son especialistas que pensan en termos concretos e substanciais e que non comprenden a importancia da imaxe cando se quere vender algo.

source: In marketing, appearance is reality. The appearance that we're willing to climb down off the barricades and work with the corporate world counts for as much as the reality of our behavior, our convictions, and our software.
gl: No marketing, as apariencias son a realidade. Aparentar que temos vontade de saír das barricadas e de cooperar co mundo empresarial é tan importante como os nosos principios, as nosas conviccións e o noso software.

source: (from <ulink url="http://www.opensource.org/"></ulink>. Or rather, <emphasis>formerly</emphasis> from that site&nbsp;&mdash;&nbsp;the OSI has apparently taken down the pages since then, although they can still be seen at <ulink url="http://web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php"></ulink> and <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing"></ulink>.)
gl: (de <ulink url="http://www.opensource.org/"></ulink>. Parece que a OSI ten eliminado as páxinas dende entón, aínda que poden ser lidas en <ulink url="http://web.archive.org/web/20021204155057/http://www.opensource.org/advocacy/faq.php"></ulink> e <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing"></ulink>.)

source: The tips of many icebergs of controversy are visible in that text. It refers to "our convictions", but smartly avoids spelling out exactly what those convictions are. For some, it might be the conviction that code developed according to an open process will be better code; for others, it might be the conviction that all information should be shared. There's the use of the word "theft" to refer (presumably) to illegal copying&mdash;a usage that many object to, on the grounds that it's not theft if the original possessor still has the item afterwards. There's the tantalizing hint that the free software movement might be mistakenly accused of anti-commercialism, but it leaves carefully unexamined the question of whether such an accusation would have any basis in fact.
gl: No téxto pódense enxergar vestixios de controversia. Fai referencia a «as nosas conviccións», mais evita con habilidade concretar en que consisten esas conviccións. Algúns pensarán que as conviccións tenhen a ver con que o código desenvolvido nun proceso aberto vai ser mellor; outros, que defenden que toda a información debe ser compartida. Fálase de «roubar» para referirse (presuntamente) ás copias ilegais, un concepto co que moita xente discrepa, xa que o elemento copiado segue en posesión do propietario orixinal despois de feita a copia. O texto deixa entrever que o movemento polo software libre pode ser acusado erroneamente de anticomercialismo, mais deixa no aire a cuestión de se tais acusacións son lexítimas.

source: None of which is to say that the OSI's web site is inconsistent or misleading. It's not. Rather, it is an example of exactly what the OSI claims had been missing from the free software movement: good marketing, where "good" means "viable in the business world." The Open Source Initiative gave a lot of people exactly what they had been looking for&mdash;a vocabulary for talking about free software as a development methodology and business strategy, instead of as a moral crusade.
gl: Con isto non quero dicir que o web da OSI sexa incoherente ou conduza a equivocacións, non é así. Máis ben, trátase dun exemplo perfecto das carencias que ten o movemento polo software libre, e que a OSI leva tempo denunciando; en concreto, unha boa estratexia de marketing, onde por «boa» se entende «viable no mundo empresarial». A Iniciativa polo Código Aberto forneceulle a moita xente o que estaban a procurar, un vocabulario que permite falar sobre o software libre como unha metodoloxía de desenvolvemento e unha estratexia empresarial, en troca de unha cruzada moral.

source: The appearance of the Open Source Initiative changed the landscape of free software. It formalized a dichotomy that had long been unnamed, and in doing so forced the movement to acknowledge that it had internal politics as well as external. The effect today is that both sides have had to find common ground, since most projects include programmers from both camps, as well as participants who don't fit any clear category. This doesn't mean people never talk about moral motivations&mdash;lapses in the traditional "hacker ethic" are sometimes called out, for example. But it is rare for a free software / open source developer to openly question the basic motivations of others in a project. The contribution trumps the contributor. If someone writes good code, you don't ask them whether they do it for moral reasons, or because their employer paid them to, or because they're building up their resum&eacute;, or whatever. You evaluate the contribution on technical grounds, and respond on technical grounds. Even explicitly political organizations like the Debian project, whose goal is to offer a 100% free (that is, "free as in freedom") computing environment, are fairly relaxed about integrating with non-free code and cooperating with programmers who don't share exactly the same goals.
gl: A creación da Iniciativa polo Código Aberto mudou a paisaxe do software libre. Formalizou unha dicotomía que ficara anónima durante moito tempo, o que forzou o movemento a reconhecer que posuía unha política tanto interna como externa. Como resultado, hoxe en día, ambas partes tenhen que atopar un elemento común, xa que programadores de ambas faccións colaboran en moitos proxectos, e hai participantes que non poden ser adscritos a ningunha das dúas categorías. Isto non quere dicir que non se fale de motivacións de carácter moral (ás veces advírtese de problemas coa «ética hacker» tradicional, mais é infrecuente que un desenvolvedor de software libre/código aberto cuestione abertamente as motivacións do resto de persoas que participan no proxecto). A contribución é o que prevalece, se alguén escribe bo código non lle preguntas se o fai por conviccións morais, porque cobra por iso, porque quere ter un bo currículo, etc. A contribución é avaliada en termos técnicos, e respóndese en termos técnicos. Mesmo organizacións cunha política explícita como o proxecto Debian, cuxo obxectivo é ofrecer un entorno de computacion 100% libre, non ponhen impedimentos á hora de traballar con código non libre e de cooperar con programadores que non comparten os seus obxectivos.

source: The Situation Today
gl: A situación actual

source: When running a free software project, you won't need to talk about such weighty philosophical matters on a daily basis. Programmers will not insist that everyone else in the project agree with their views on all things (those who do insist on this quickly find themselves unable to work in any project). But you do need to be aware that the question of "free" versus "open source" exists, partly to avoid saying things that might be inimical to some of the participants, and partly because understanding developers' motivations is the best way&mdash;in some sense, the <emphasis>only</emphasis> way&mdash;to manage a project.
gl: Ao xestionares un proxecto de software libre non terás que tratar temas filosóficos tan profundos con frecuencia. Os programadores non van esixir que todos os participantes do proxecto compartan as súas ideas en todos os ámbitos (os que si o fan decátanse logo de que non poden colaborar en ningún proxecto). Mais tes que ser consciente da existencia das diferencias entre «software libre» e «código aberto», en parte para evitares ferir a sensibilidade de algúns dos colaboradores, e en parte tamén porque comprender as motivacións dos desenvolvedores é o mellor xeito (e ata certo punto o único) de xerir un proxecto.

source: Free software is a culture by choice. To operate successfully in it, you have to understand why people choose to be in it in the first place. Coercive techniques don't work. If people are unhappy in one project, they will just wander off to another one. Free software is remarkable even among volunteer communities for its lightness of investment. Most of the people involved have never actually met the other participants face-to-face, and simply donate bits of time whenever they feel like it. The normal conduits by which humans bond with each other and form lasting groups are narrowed down to a tiny channel: the written word, carried over electronic wires. Because of this, it can take a long time for a cohesive and dedicated group to form. Conversely, it's quite easy for a project to lose a potential volunteer in the first five minutes of acquaintanceship. If a project doesn't make a good first impression, newcomers rarely give it a second chance.
gl: O software libre é unha cultura de libre elección, e para desenvolvéreste nela con suceso tes que comprender os motivos que levan a determinadas persoas a desexaren ser parte da mesma. A coerción non funciona; se os colaboradores dun proxecto non estiveren contentos co mesmo migrarán a outro. Un dos aspectos máis salientables do software libre, mesmo entre comunidades de voluntarios, é a pouca dedicación que esixe. A maioría dos colaboradores dun proxecto non se conhecen persoalmente, e limítanse a doar parte do seu tempo cando lles apetecer. Os condutos habituais de interacción entre os seres humanos vense reducidos a un único elemento: a palabra escrita, propagada a través de circuitos electrónicos. A consecuencia disto pode pasar moito tempo ata que se forma un grupo comprometido e, de igual maneira, é fácil perder voluntarios potenciais nos cinco primeiros minutos de «conversa». Se un proxecto non causar unha boa primeira impresión, os recén chegados rara vez lle dan unha segunda oportunidade.

source: The transience, or rather the <emphasis>potential</emphasis> transience, of relationships is perhaps the single most daunting task facing a new project. What will persuade all these people to stick together long enough to produce something useful? The answer to that question is complex enough to occupy the rest of this book, but if it had to be expressed in one sentence, it would be this:
gl: A volatilidade (ou mellor dito a volatilidade potencial) das relacións é quizais o maior desafío ao que se enfrontan os proxectos nas súas fases iniciais. Que vai manter a toda esa xente unida o bastante como para produciren algo de utilidade?. A resposta a esta pregunta é o bastante complexa como para ocupar o resto desta obra, mais se tivermos que resumila nunha oración, diría así:

source: People should feel that their connection to a project, and influence over it, is directly proportional to their contributions.
gl: Os colaboradores deberían percibir que a súa implicación nun proxecto e a súa influencia sobre o mesmo son directamente proporcionais ás súas aportacións.

source: No class of developers, or potential developers, should ever feel discounted or discriminated against for non-technical reasons. Clearly, projects with corporate sponsorship and/or salaried developers need to be especially careful in this regard, as <xref linkend="money"/> discusses in detail. Of course, this doesn't mean that if there's no corporate sponsorship then you have nothing to worry about. Money is merely one of many factors that can affect the success of a project. There are also questions of what language to choose, what license, what development process, precisely what kind of infrastructure to set up, how to publicize the project's inception effectively, and much more. Starting a project out on the right foot is the topic of <link linkend="getting-started">the next chapter</link>.
gl: Ningún grupo de desenvolvedores, ou de desenvolvedores en potencia, debería sentirse discriminado por razóns de carácter non técnico. É obvio que os proxectos que contaren con patrocinio empresarial e/ou desenvolvedores asalariados deben prestar especial coidado neste sentido, como se explica no capítulo 5, Diñeiro. Isto non quere dicir que se non houber patrocinio empresarial non hai nada de que se preocupar; o dinheiro non é máis ca un dos múltiples factores que poden afectar o suceso dun proxecto. Tamén hai cuestións como que linguaxe empregar, que licenza, que proceso de desenvolvemento, que tipo de estrutura vai ser implementada, como publicitar a creación do proxecto de maneira eficaz, e moitas máis. O próximo capítulo explica como iniciar un proxecto con bo pé.
