Repository: amaneiro/poss-gl
Catalog: po/*/ch01.po
Languages: gl

source: Much of the software on this new operating system was not produced by the GNU project. In fact, GNU wasn't even the only group working on producing a free operating system (for example, the code that eventually became NetBSD and FreeBSD was already under development by this time). The importance of the Free Software Foundation was not only in the code they wrote, but in their political rhetoric. By talking about free software as a cause instead of a convenience, they made it difficult for programmers <emphasis>not</emphasis> to have a political consciousness about it. Even those who disagreed with the FSF had to engage the issue, if only to stake out a different position. The FSF's effectiveness as propagandists lay in tying their code to a message, by means of the GPL and other texts. As their code spread widely, that message spread as well.
gl: Unha grande parte do software deste sistema operativo non foi producido polo proxecto GNU. De facto, a GNU non era o único grupo que estaba a traballar na produción dun sistema operativo libre (por exemplo, o código que co tempo desembocou en NetBSD e FreeBSD xa estaba en proceso de desenvolvemento nesta altura). A relevancia da Fundación polo Software Libre non se limita ao código que creou, senón que se estende tamén á súa retórica política. O feito de que contemplasen o software libre como unha causa e non como un produto despertaba unha certa conciencia política nos programadores. Mesmo aqueles que non concordaban cos postulados da FSL víanse na obriga de participaren no debate, aínda que só fose para manifestaren unha opinión diverxente. A efectividade da FSF como órgano propagandístico radicaba no feito de vincularen o código a unha mensaxe, coa axuda da GPL entre outros. Ao estenderse o código, estendeuse tamén a mensaxe.

source: Accidental resistance
gl: Resistencia accidental

source: There were many other things going on in the nascent free software scene, however, and few were as explictly ideological as Stallman's GNU Project. One of the most important was the <firstterm>Berkeley Software Distribution</firstterm> (<firstterm>BSD</firstterm>), a gradual re-implementation of the Unix operating system&mdash;which up until the late 1970's had been a loosely proprietary research project at AT&amp;T&mdash;by programmers at the University of California at Berkeley. The BSD group did not make any overt political statements about the need for programmers to band together and share with one another, but they <emphasis>practiced</emphasis> the idea with flair and enthusiasm, by coordinating a massive distributed development effort in which the Unix command-line utilities and code libraries, and eventually the operating system kernel itself, were rewritten from scratch mostly by volunteers. The BSD project became a prime example of non-ideological free software development, and also served as a training ground for many developers who would go on to remain active in the open source world.
gl: Porén, os inicios do software libre foron unha época de gran actividade, e poucas accións tinhan un componhente ideolóxico tan explícito como o Proxecto GNU de Stallman. Un dos movementos máis destacados foi a Berkeley Software Distribution (BSD), unha reimplementación gradual do sistema operativo UNIX (que ata finais dos 70 foi un proxecto de investigación da AT&T de carácter lixeiramente propietario) xerido por programadores da Universidade de California en Berkeley. A turma da BSD non fixo declaracións de carácter político sobre a necesidade de os programadores se uniren e compartiren entre eles, mais puxeron a idea en práctica con talento e entusiasmo, coordinando un esforzo desenvolvedor distribuido no que os intérpretes de comandos e as librerías de códigos, e despois o propio núcleo do sistema operativo, foron reescritos desde cero, principalmente por voluntarios. O proxecto BSD tornouse no exemplo perfecto de desenvolvemento de software libre sen vinculacións ideolóxicas, e tamén lle serviu de adestramento a moitos desenvolvedores que pasaron a traballar no mundo do código aberto.

source: Another crucible of cooperative development was the <firstterm>X Window System</firstterm>, a free, network-transparent graphical computing environment, developed at MIT in the mid-1980's in partnership with hardware vendors who had a common interest in being able to offer their customers a windowing system. Far from opposing proprietary software, the X license deliberately allowed proprietary extensions on top of the free core&mdash;each member of the consortium wanted the chance to enhance the default X distribution, and thereby gain a competitive advantage over the other members. X Windows<footnote><para>They prefer it to be called the "X Window System", but in practice, people usually call it "X Windows", because three words is just too cumbersome.</para></footnote> itself was free software, but mainly as a way to level the playing field between competing business interests, not out of some desire to end the dominance of proprietary software. Yet another example, predating the GNU project by a few years, was TeX, Donald Knuth's free, publishing-quality typesetting system. He released it under a license that allowed anyone to modify and distribute the code, but not to call the result "TeX" unless it passed a very strict set of compatibility tests (this is an example of the "trademark-protecting" class of free licenses, discussed more in <xref linkend="legal"/>). Knuth wasn't taking a stand one way or the other on the question of free-versus-proprietary software, he just needed a better typesetting system in order to complete his <emphasis>real</emphasis> goal&mdash;a book on computer programming&mdash;and saw no reason not to release his system to the world when done.
gl: Outro crisol de desenvolvemento cooperativo foi o X Window System, un entorno gráfico de computación libre e transparente, desenvolvido polo MIT a mediados dos 80 en colaboración con distribuidores de hardware interesados en ofrecer un sistema de xanelas aos seus clientes. Lonxe de oponherse ao sistema propietario, a licenza X permitía engadir extensións propietarias ao núcleo libre de maneira deliberada (cada un dos membros do consorcio quería ter a oportunidade de perfeccionar a distribución X, obtendo así unha vantaxe competitiva sobre o resto dos membros). X Windows <footnote><para>Prefiren chamalo «X Window System», mais na práctica emprégase o nome «X Windows» por simple comodidade. </para></footnote> era software libre en si mesmo, mais o seu obxectivo era igualar as condicións de xogo entre intereses empresariais, non ponher fin ao dominio do software propietario. Outro exemplo que se anticipou ao proxecto GNU nuns poucos anos foi TeX, un sistema de tipografía de calidade profesional creado por Donald Knuth e publicado baixo unha licenza que permite modificar e distribuír o código, mais proíbe referirse a esas novas versións como TeX a menos que superen unha serie de probas de compatibilidade moi estrictas (trátase dun exemplo de licenza libre con «protección da marca comercial», das que falarei en maior profundidade no capítulo 9, Licenzas, dereitos de autor (copyright) e patentes). Knuth non se posicionou no debate software libre versus software propietario, simplemente necesitaba un sistema tipográfico mellor para atinxir o seu auténtico obxectivo (un libro sobre programación de computadores) e non viu motivo ningún para non ponher o seus sistema ao alcance do resto do mundo unha vez rematase.

source: Without listing every project and every license, it's safe to say that by the late 1980's, there was a lot of free software available under a wide variety of licenses. The diversity of licenses reflected a corresponding diversity of motivations. Even some of the programmers who chose the GNU GPL were much less ideologically driven than the GNU project itself. Although they enjoyed working on free software, many developers did not consider proprietary software a social evil. There were people who felt a moral impulse to rid the world of "software hoarding" (Stallman's term for non-free software), but others were motivated more by technical excitement, or by the pleasure of working with like-minded collaborators, or even by a simple human desire for glory. Yet by and large these disparate motivations did not interact in destructive ways. This is partly because software, unlike other creative forms like prose or the visual arts, must pass semi-objective tests in order to be considered successful: it must run, and be reasonably free of bugs. This gives all participants in a project a kind of automatic common ground, a reason and a framework for working together without worrying too much about qualifications beyond the technical.
gl: Sen enumerar todos os proxectos e licenzas, pódese dicir que, a finais dos 80, existía unha gran cantidade de software libre baixo unha ampla variedade de licenzas. Esta diversidade de licenzas correspondíase cunha gran diversidade de motivacións. Mesmo algúns dos programadores que escolleran a GNU GPL tinhan menos motivacións ideolóxicas ca o propio proxecto GNU. Embora traballasen con gusto con software libre, moitos desenvolvedores non percibían o software poropietario como un mal social. Había quen sentía o compromiso moral de librar o mundo do «software acaparador» (termo coinado por Stallman para referirse ao software non libre), mais a outros animábaos o carácter técnico dos proxectos, ou traballar con colegas con esquemas mentais semellantes, outros simplemente ambicionaban a gloria. Con todo, esta gran variedade de motivacións non entraban en conflicto entre elas. A causa radica en que o software, a diferenza de outras modalidades creativas como a prosa ou as belas artes, debe superar probas moderadamente obxectivas para ser considerado ben sucedido: debe funcionar, e non pode presentar demasiados erros (bugs). Isto proporciónalles aos participantes nun proxecto unha especie de base común, un motivo e un marco para cooperaren sen se preocuparen de demasiados detalles de outro carácter que non sexa o técnico.

source: Developers had another reason to stick together as well: it turned out that the free software world was producing some very high-quality code. In some cases, it was demonstrably technically superior to the nearest non-free alternative; in others, it was at least comparable, and of course it always cost less. While only a few people might have been motivated to run free software on strictly philosophical grounds, a great many people were happy to run it because it did a better job. And of those who used it, some percentage were always willing to donate their time and skills to help maintain and improve the software.
gl: Os desenvolvedores tenhen aínda outro motivo para traballaren xuntos: veuse a demostrar que o universo do software libre estaba a crear código de moi boa calidade, que nalgúns casos mesmo chegaba a superar a outras alternativas non libres desde o punto de vista técnico; noutros casos era polo menos igual de bo, e por suposto sempre máis barato. Mentres que só unhas poucas persoas se sentían motivadas a empregar software libre por motivos puramente filosóficos, un gran número de individuos o empregaban porque funcionaba mellor, e unha porcentaxe dos que o utilizaban estaban dispostos a doar o seu tempo e habilidades para axudar a manter e a mellorar o software.

source: This tendency to produce good code was certainly not universal, but it was happening with increasing frequency in free software projects around the world. Businesses that depended heavily on software gradually began to take notice. Many of them discovered that they were already using free software in day-to-day operations, and simply hadn't known it (upper management isn't always aware of everything the IT department does). Corporations began to take a more active and public role in free software projects, contributing time and equipment, and sometimes even directly funding the development of free programs. Such investments could, in the best scenarios, repay themselves many times over. The sponsor only pays a small number of expert programmers to devote themselves to the project full time, but reaps the benefits of <emphasis>everyone's</emphasis> contributions, including work from unpaid volunteers and from programmers being paid by other corporations.
gl: Esta tendencia cara a produción de código de calidade non era universal, mais estaba a ganhar cada vez maior presenza nos proxectos de software libre a nivel mundial. Os negocios que dependían moito do software comezaron a decatarse diso, e moitos deles descubriron que xa estaban a utilizar software libre en tarefas do día a día, sen sabelo (os xestores de alto nivel moitas veces non saben o que fai o departamento de TI). As corporacións comezaron a tomar parte de maneira máis activa e aberta en proxectos de software libre. Os beneficios derivados podían, nalgúns casos, multiplicar varias veces o investimento inicial. A empresa contrata unicamente un pequeno grupo de programadores expertos para traballaren a tempo enteiro no proxecto, mais benefíciase das contribucións de todo o mundo, voluntarios e programadores contratados por outras compañías incluidas.

source: "Free" Versus "Open Source"
gl: «Libre» fronte a «código aberto (open source)»

source: As the corporate world gave more and more attention to free software, programmers were faced with new issues of presentation. One was the word "free" itself. On first hearing the term "free software" many people mistakenly think it means just "zero-cost software." It's true that all free software is zero-cost,<footnote><para>One may charge a fee for giving out copies of free software, but since one cannot stop the recipients from offering it at no charge afterwards, the price is effectively driven to zero immediately.</para></footnote> but not all zero-cost software is free. For example, during the battle of the browsers in the 1990s, both Netscape and Microsoft gave away their competing web browsers at no charge, in a scramble to gain market share. Neither browser was free in the "free software" sense. You couldn't get the source code, and even if you could, you didn't have the right to modify or redistribute it.<footnote><para>The source code to Netscape Navigator <emphasis>was</emphasis> eventually released under an open source license, in 1998, and became the foundation for the Mozilla web browser. See <ulink url="http://www.mozilla.org/"></ulink>.</para></footnote> The only thing you could do was download an executable and run it. The browsers were no more free than shrink-wrapped software bought in a store; they merely had a lower price.
gl: Á medida que aumentou o interese das corporacións polo software libre, os programadores enfrontáronse a novos retos de presentación, un dos cales era a propia palabra «libre». Ao escoitaren o termo «libre» pola primeira vez, moita xente cre que se trata simplemente de «software gratuíto»1. É certo que todo o softare libre é gratuíto2, mais non todo o software gratuíto é libre. Por exemplo, na altura da guerra dos navigadores, nos anos 90, tanto Netscape como Microsoft regalaban copias dos seus respectivos navigadores co ánimo de ampliar a súa cota de mercado, mais en ningún caso se trataba de «software libre». Non se podía acceder ao código fonte, e se alguén o conseguía, non tinha dereito a modificalo nin a redistribuílo3. O único que podía facer era descargalo como ficheiro executable e abrilo. Estes navigadores eran tan libres como calquera programa comprado na tenda, a única diferencia era o prezo.

source: This confusion over the word "free" is due entirely to an unfortunate ambiguity in the English language. Most other tongues distinguish low prices from liberty (the distinction between <emphasis>gratis</emphasis> and <emphasis>libre</emphasis> is immediately clear to speakers of Romance languages, for example). But English's position as the de facto bridge language of the Internet means that a problem with English is, to some degree, a problem for everyone. The misunderstanding around the word "free" was so prevalent that free software programmers eventually evolved a standard formula in response: "It's <emphasis>free</emphasis> as in <emphasis>freedom</emphasis>&mdash;think <emphasis>free speech</emphasis>, not <emphasis>free beer</emphasis>." Still, having to explain it over and over is tiring. Many programmers felt, with some justification, that the ambiguous word "free" was hampering the public's understanding of this software.
gl: A confusión causada pola palabra «free» é debida a unha ambigüidade do adxectivo en inglés. A maior parte das demais linguas diferencian entre a liberdade e o barato (a distinción entre gratis e libre é obvia para calquera falante dunha lingua romance, por exemplo). Mais o estatus que o inglés ten como lingua franca da Internet implica que un problema co inglés é, ata certo punto, un problema para todo o mundo. A confusión creada pola palabra «free» estaba tan estendida que o programadores crearon unha fórmula explicativa: «It's free as in freedom- think free speech, not free beer» (libre de liberdade, pensa en «discurso libre», non en «cervexa gratis»). Contodo, ter que explicalo constantemente cansa, e moitos programadores opinaban, con razón, que a palabra «free» impedía que a xente comprendese as características dese software.

source: But the problem went deeper than that. The word "free" carried with it an inescapable moral connotation: if freedom was an end in itself, it didn't matter whether free software also happened to be better, or more profitable for certain businesses in certain circumstances. Those were merely pleasant side effects of a motive that was, at bottom, neither technical nor mercantile, but moral. Furthermore, the "free as in freedom" position forced a glaring inconsistency on corporations who wanted to support particular free programs in one aspect of their business, but continue marketing proprietary software in others.
gl: Mais as raíces do problema eran máis profundas, xa que a palabra «libre» posuía connotacións morais evidentes: se a liberdade constituía un fin en sí mesma, era indiferente que o software libre fose superior, ou máis rentable para determinados negocios en determinadas circunstancias. Estes eran simplemente efectos colaterais positivos dunha empresa que non era, en esencia, nin técnica nin mercantil, senón simplemente moral. Aínda máis, a filosofía «free as in freedom» (libre de liberdade) presentaba un problema de conciencia para as empresas que desexaban apoiar programas específicos de software libre, pero que ao mesmo tempo querían continuar a vender software propietario.

source: These dilemmas came to a community that was already poised for an identity crisis. The programmers who actually <emphasis>write</emphasis> free software have never been of one mind about the overall goal, if any, of the free software movement. Even to say that opinions run from one extreme to the other would be misleading, in that it would falsely imply a linear range where there is instead a multidimensional scattering. However, two broad categories of belief can be distinguished, if we are willing to ignore subtleties for the moment. One group takes Stallman's view, that the freedom to share and modify is the most important thing, and that therefore if you stop talking about freedom, you've left out the core issue. Others feel that the software itself is the most important argument in its favor, and are uncomfortable with proclaiming proprietary software inherently bad. Some, but not all, free software programmers believe that the author (or employer, in the case of paid work) <emphasis>should</emphasis> have the right to control the terms of distribution, and that no moral judgement need be attached to the choice of particular terms.
gl: Estes dilemas aterraron nunha comunidade que xa era propensa de seu ás crises de indentidade. Os programadores que producen software libre nunca foron unánimes a respecto de cal debería ser o obxectivo común do movemento polo software libre, se houber algún. Mesmo dicir que as opinións van de un estremo ao outro crearía confusión, xa que daría a entender a existencia de unha gradación linear en lugar da distribución multidimensional que existe na realidade. Porén, pódense distinguir dúas grandes categorías ideolóxicas, se ignorarmos as sutilezas polo momento. Uns comparten o punto de vista de Stallman de que que a liberdade de compartir e facer modificacións é o máis importante, e se perdérmonos de vista a liberdade, non atenderiamos ao elemento principal. Outros cren que o software en sí mesmo constitúe a baza principal, e séntense incómodos ao identificaren o software propietario como algo malo de seu. Algúns programadores, mais non todos, cren que o autor (ou o contratista, se o traballo for remunerado), debería ter control sobre a distribución, e que a escolla dos termos non debería ficar supeditada a xuízos morais de ningún tipo.

source: For a long time, these differences did not need to be carefully examined or articulated, but free software's burgeoning success in the business world made the issue unavoidable. In 1998, the term <firstterm>open&nbsp;source</firstterm> was created as an alternative to "free", by a coalition of programmers who eventually became The Open Source Initiative (OSI).<footnote><para>OSI's web home is <ulink url="http://www.opensource.org/"></ulink>.</para></footnote> The OSI felt not only that "free software" was potentially confusing, but that the word "free" was just one symptom of a general problem: that the movement needed a marketing program to pitch it to the corporate world, and that talk of morals and the social benefits of sharing would never fly in corporate boardrooms. In their own words:
gl: Estas diferenzas non requeriron unha análise detallada nin unha articulación profunda durante moito tempo, mais o auxe do software libre no mundo dos negocios mudou esta situación. O termo código aberto (open source) foi creado en 1998 como alternativa ao termo «libre» (free) por un grupo de programadores que daría orixe á Iniciativa do Código Aberto (OSI1 polas siglas en inglés). Para a OSI, non só o termo «sofware libre» (free software) era potencialmente confuso, senón que a propia palabra «libre» (free) era un sintoma dun problema máis amplo, concretamente, de que o movemento necesitaba unha campanha de marketing para tornalo atractivo ante os ollos do mundo empresarial, e que falar de aspectos morais e dos beneficios sociais de compartir non espertarían interese nas reunións de executivos. Nas súas propias palabras:

source: The Open Source Initiative is a marketing program for free software. It's a pitch for "free software" on solid pragmatic grounds rather than ideological tub-thumping. The winning substance has not changed, the losing attitude and symbolism have.&nbsp;...
gl: A Iniciativa do Código Aberto é unha campanha de marketing de software libre. Dálle un pulo ao «software libre» desde unha visión pragmática, sen recorrer a discursos ideolóxicos inflamados. A esencia segue a ser a mesma, mais a actitude derrotista e o simbolismo mudaron. […]

source: The case that needs to be made to most techies isn't about the concept of open source, but the name. Why not call it, as we traditionally have, free software?
gl: O que hai que lograr que comprendan a maior parte dos especialistas non é o concepto de código aberto, senón o nome. Por que non chamalo, como fixemos sempre, software libre?

source: One direct reason is that the term "free software" is easily misunderstood in ways that lead to conflict.&nbsp;...
gl: Un dos motivos principais é que o termo «software libre» (free software) crea tal confusión que pode propiciar conflictos...
