Repository: amaneiro/poss-gl
Catalog: po/*/ch01.po
Languages: gl

source: Although this early period resembled today's free software culture in many ways, it differed in two crucial respects. First, there was as yet little standardization of hardware&mdash;it was a time of flourishing innovation in computer design, but the diversity of computing architectures meant that everything was incompatible with everything else. Thus, software written for one machine would generally not work on another. Programmers tended to acquire expertise in a particular architecture or family of architectures (whereas today they would be more likely to acquire expertise in a programming language or family of languages, confident that their expertise will be transferable to whatever computing hardware they happen to find themselves working with). Because a person's expertise tended to be specific to one kind of computer, their accumulation of expertise had the effect of making that computer more attractive to them and their colleagues. It was therefore in the manufacturer's interests for machine-specific code and knowledge to spread as widely as possible.
gl: Aínda que este período inicial se asemella á cultura do software libre actual en moitos aspectos, diferénciase desta en dous puntos fundamentais. En primeiro lugar, a compatibilidade entre equipos era mínima (esta etapa caracterizouse por unha innovación constante no desenho dos computadores, mais debido á diversidade de arquitecturas case ningún equipo era compatible co resto), polo que o software escrito para un equipo poucas veces servía para outros. Os programadores soían adquirir experiencia nunha arquitectura ou familia de arquitecturas determinada (na actualidade é frecuente que se especializen nunha linguaxe ou nunha familia de linguaxes de programación en particular, coa convicción de que as destrezas adquiridas poderán ser transferidas a calquera tipo de hardware co que tiveren que traballar). Dado que as destrezas dun individuo soían estar confinadas a un tipo concreto de computador, a acumulación de destrezas tornaba ese equipo máis atractivo para o resto dos seus colegas. A expansión deses conhecementos e dos códigos específicos para cada equipo beneficiaban por tanto os intereses dos fabricantes.

source: Second, there was no Internet. Though there were fewer legal restrictions on sharing than today, there were more technical ones: the means of getting data from place to place were inconvenient and cumbersome, relatively speaking. There were some small, local networks, good for sharing information among employees at the same research lab or company. But there remained barriers to overcome if one wanted to share with everyone, no matter where they were. These barriers <emphasis>were</emphasis> overcome in many cases. Sometimes different groups made contact with each other independently, sending disks or tapes through land mail, and sometimes the manufacturers themselves served as central clearing houses for patches. It also helped that many of the early computer developers worked at universities, where publishing one's knowledge was expected. But the physical realities of data transmission meant there was always an impedance to sharing, an impedance proportional to the distance (real or organizational) that the software had to travel. Widespread, frictionless sharing, as we know it today, was not possible.
gl: En segundo lugar, non había Internet. Embora as restriccións legais sobre o acto de compartir fosen menores que hoxe, as restriccións de carácter técnico eran maiores: trasladar datos de un sitio a outro era, en termos relativos, incómodo e custoso. Existían pequenas redes locais, idóneas para compartir información entre os empregados dunha mesma empresa ou laboratorio de investigación, mais era necesario superar barreiras para compartir material co resto da xente, sen importar onde vivisen. Estas barreiras eran superadas en moitos casos: ás veces algúns grupos contactaban con outros de maneira independente, e trocaban discos ou fitas por correo, ás veces os propios fabricantes obraban como intermediarios na elaboración de remendos (patches). Tamén axudou o feito de que moitos dos primeiros desenvolvedores informáticos pertencesen ao ámbito universitario, onde é frecuente publicar os novos avances. Mais a realidade física da transmisión de datos dificultaba o acto de compartir, tanto máis canto maior fose a distancia (real ou en termos organizativos) que tivese que cruzar o software. O acto de compartir a gran escala e con facilidade, como o conhecemos hoxe, era imposible.

source: The Rise of Proprietary Software and Free Software
gl: A aparición do software privativo e do software libre

source: As the industry matured, several interrelated changes occurred simultaneously. The wild diversity of hardware designs gradually gave way to a few clear winners&mdash;winners through superior technology, superior marketing, or some combination of the two. At the same time, and not entirely coincidentally, the development of so-called "high level" programming languages meant that one could write a program once, in one language, and have it automatically translated ("compiled") to run on different kinds of computers. The implications of this were not lost on the hardware manufacturers: a customer could now undertake a major software engineering effort without necessarily locking themselves into one particular computer architecture. When this was combined with the gradual narrowing of performance differences between various computers, as the less efficient designs were weeded out, a manufacturer that treated its hardware as its only asset could look forward to a future of declining profit margins. Raw computing power was becoming a fungible good, while software was becoming the differentiator. Selling software, or at least treating it as an integral part of hardware sales, began to look like a good strategy.
gl: Ao ir madurando a industria, tiveron lugar de maneira simultánea mudanzas que estaban interrelacionadas. A enorme diversidade de desenhos de hardware foi desaparecendo en favor duns poucos vencedores, que se impuxeron mercé de unha tecnoloxía superior, mellor publicidade ou unha combinación de ambos. Nesa altura, e non de maneira casual, o desenvolvemento das chamadas linguaxes de programación de «alto nivel» permitiron que programas escritos nunha linguaxe puidesen ser traducidos automaticamente («compilados») e utilizados en distintos computadores. Os fabricantes decatáronse logo das posibilidades deste método: un cliente podía levar a cabo un gran esforzo de creación de software sen restrinxirse a unha arquitectura determinada. Se combinarmos o anterior coa cada vez menor diferencia de rendemento entre os distintos computadores, consecuencia da desaparición dos desenhos menos eficientes, os fabricantes que contemplaban o seu hardware como o seu único activo enfrontábanse a unha futura reducción da súa marxe de beneficios. O rendemento bruto das máquinas estaba a se tornar nun ben funxible, en canto o software estaba a se tornar no elemento diferenciador. A venda de software, ou polo menos a súa integración na venda de hardware, tornouse nunha boa estratexia.

source: This meant that manufacturers had to start enforcing the copyrights on their code more strictly. If users simply continued to share and modify code freely among themselves, they might independently reimplement some of the improvements now being sold as "added value" by the supplier. Worse, shared code could get into the hands of competitors. The irony is that all this was happening around the time the Internet was getting off the ground. Just when truly unobstructed software sharing was finally becoming technically possible, changes in the computer business made it economically undesirable, at least from the point of view of any single company. The suppliers clamped down, either denying users access to the code that ran their machines, or insisting on non-disclosure agreements that made effective sharing impossible.
gl: Como consecuencia do anterior, os fabricantes comezaron a imponher dereitos autorais cada vez máis estrictos sobre o seu código, dado que os usuarios, se continuaren a compartir e modificar o código entre eles, poderían chegar a reimplementar algúns dos avances comercializados como «valor engadido» polo distribuidor. Ironicamente, todo isto aconteceu na altura en que Internet comezaba a coller folgos. Apenas o acto de compartir software comezaba a ser posible desde o punto de vista técnico, cando o as mudanzas no negocio dos computadores o tornaron en algo pouco desexable desde o punto de vista económico, polo menos desde o pounto de vista de calquera empresa a nivel individual. Os fornecedores impediron o acceso, ben negándolle o acceso ao código aos utentes dos seus equipoa, ben imponhendo acordos de non divulgación que imposibilitaban o acto de compartir.

source: Conscious resistance
gl: A resistencia consciente

source: As the world of unrestricted code swapping slowly faded away, a counterreaction crystallized in the mind of at least one programmer. Richard Stallman worked in the Artificial Intelligence Lab at the Massachusetts Institute of Technology in the 1970s and early '80s, during what turned out to be a golden age and a golden location for code sharing. The AI Lab had a strong "hacker ethic",<footnote><para>Stallman uses the word "hacker" in the sense of "someone who loves to program and enjoys being clever about it," not the relatively new meaning of "someone who breaks into computers."</para></footnote> and people were not only encouraged but expected to share whatever improvements they made to the system. As Stallman wrote later:
gl: En canto desaparecía o universo do código sen restriccións, un programador reaccionou ante este feito. Richard Stallman traballaba no Laboratorio de Intelixencia Artificial do Instituto Tecnolóxico de Massachussets (MIT) na década dos 70 e inicios dos 80, durante o que viu a verificarse a mellor época e o mellor lugar para quen quixese compartir código. No laboratorio de IA reinaba unha forte «ética hacker1», e animábase os traballadores a compartiren calquera mellora que fixesen no sistema. Tempo despois, o propio Stallman escribiu:

source: <blockquote> <para><emphasis>We did not call our software "free software", because that term did not yet exist; but that is what it was. Whenever people from another university or a company wanted to port and use a program, we gladly let them. If you saw someone using an unfamiliar and interesting program, you could always ask to see the source code, so that you could read it, change it, or cannibalize parts of it to make a new program. </emphasis></para> <para>(from <emphasis role="bold"><ulink url="http://www.gnu.org/gnu/thegnuproject.html"></ulink></emphasis>)</para> </blockquote> <para>This Edenic community collapsed around Stallman shortly after 1980, when the changes that had been happening in the rest of the industry finally caught up with the AI Lab. A startup company hired away many of the Lab's programmers to work on an operating system similar to what they had been working on at the Lab, only now under an exclusive license. At the same time, the AI Lab acquired new equipment that came with a proprietary operating system.</para> <para>Stallman saw the larger pattern in what was happening:</para> <blockquote> <para><emphasis>The modern computers of the era, such as the VAX or the 68020, had their own operating systems, but none of them were free software: you had to sign a nondisclosure agreement even to get an executable copy.</emphasis> </para> <para><emphasis>This meant that the first step in using a computer was to promise not to help your neighbor. A cooperating community was forbidden. The rule made by the owners of proprietary software was, "If you share with your neighbor, you are a pirate. If you want any changes, beg us to make them." </emphasis> </para> </blockquote>
gl: <blockquote> <para><emphasis>Non chamabamos o noso software «software libre» porque o termo aínda non existía, mais era exactamente software libre. Cando calquera persoa de outra universidade ou empresa quería levar e utilizar un programa, dabamoslle permiso encantados. Se vías alguén traballar cun programa novidoso e interesante, podías perdirlle que che deixase ver o código fonte, para poder mudalo ou copiar partes e facer un programa novo.</emphasis></para> <para>(de <emphasis role="bold"><ulink url="http://www.gnu.org/gnu/thegnuproject.html"></ulink></emphasis>)</para> </blockquote> <para>Esta comunidade idílica desapareceu pouco despois de 1980, cando as mudanzas que tiveran lugar no resto do mundo chegaron ao Laoboratorio de IA. Unha empresa de recente creación contratou a maior parte dos programadores do Laboratorio para traballaren nun sistema operativo moi semellante a aquel co que traballaran na etapa anterior, mais esta vez baixo licenza exclusiva. Na mesma altura, o laboratorio de IA adquiriu unha serie de equipos que xa traían un sistema operativo propietario. </para> <para>Stallman reconheceu un padrón na cadea de acontecementos:</para> <blockquote> <para><emphasis>Os computadores modernos naquela altura, como o VAX ou o 68020, posuían os seus propios sistemas operativos, mais non se trataba en ningún caso de software libre, xa que estabas obrigado a asinar un acordo de non divulgación mesmo para obter unha copia executable. </emphasis> </para> <para><emphasis>Así, o primeiro paso para utilizar un computador pasaba por negarlle axuda ao vecinho, era proibida a existencia dunha comunidade de cooperación. A norma imposta polos donos do software propietario era: «se queres compartir co teu vecinho, es un pirata; se quixeres modificar algo, préganos que o fagamos nós».</emphasis> </para> </blockquote>

source: By some quirk of personality, he decided to resist the trend. Instead of continuing to work at the now-decimated AI Lab, or taking a job writing code at one of the new companies, where the results of his work would be kept locked in a box, he resigned from the Lab and started the GNU Project and the Free Software Foundation (FSF). The goal of GNU<footnote><para>It stands for "GNU's Not Unix", and the "GNU" in that expansion stands for...the same thing.</para></footnote> was to develop a completely free and open computer operating system and body of application software, in which users would never be prevented from hacking or from sharing their modifications. He was, in essence, setting out to recreate what had been destroyed at the AI Lab, but on a world-wide scale and without the vulnerabilities that had made the AI Lab's culture susceptible to disintegration.
gl: Algo dentro del opúxose a esta tendencia. En troca de continuar co seu traballo no (agora moi debilitado) Laboratorio de IA, ou de dixitar código nunha das novas companhías, onde o produto do seu traballo ficaría fechado nunha caixa, deixou o Laboratorio e iniciou o Proxecto GNU e a Fundación polo Software Libre (FSF). GNU1 procuraba desenvolver un sistema operativo e un conxunto de aplicacións completamente libres e gratuitas, que os usuarios puidesen hackear e compartir as modificacións que fixesen. Estaba a recrear, en esencia, o que se perdera no Laboratorio de IA, mais a escala mundial e sen as vulnerabilidades que tornaran a cultura do Laboratorio de IA en algo susceptible de desaparecer.

source: In addition to working on the new operating system, Stallman devised a copyright license whose terms guaranteed that his code would be perpetually free. The GNU General Public License (GPL) is a clever piece of legal judo: it says that the code may be copied and modified without restriction, and that both copies and derivative works (i.e., modified versions) must be distributed under the same license as the original, with no additional restrictions. In effect, it uses copyright law to achieve an effect opposite to that of traditional copyright: instead of limiting the software's distribution, it prevents <emphasis>anyone</emphasis>, even the author, from limiting it. For Stallman, this was better than simply putting his code into the public domain. If it were in the public domain, any particular copy of it could be incorporated into a proprietary program (as has also been known to happen to code under permissive copyright licenses). While such incorporation wouldn't in any way diminish the original code's continued availability, it would have meant that Stallman's efforts could benefit the enemy&mdash;proprietary software. The GPL can be thought of as a form of protectionism for free software, because it prevents non-free software from taking full advantage of GPLed code. The GPL and its relationship to other free software licenses are discussed in detail in <xref linkend="legal"/>.
gl: Para alén de traballar no novo sistema operativo, Stallman creou unha licenza de dereitos autorais cuxos termos garantían que o seu código ficaría libre para sempre. A Licenza Pública Xeral da GNU (GPL) constitúe unha obra maxistral de enxenharía legal: establece que o código pode ser copiado e modificado sen restricións de ningún tipo, e que tanto as copias como os produtos derivados (por exemplo, as versións modificadas) deben ser distribuidas baixo a mesma licenza que o orixinal, sen ningunha clase de restricións adicionais. O que fai é aproveitarse das leis autorais para atinxir o efecto contrario ao que perseguen as leis autorais tradicionais: en troca de limitar a distribución do software, evita que calquera, mesmo o autor, a limite. Stallman considerou que este sistema era mellor que limitarse a entregar o seu código ao dominio público. Se for de dominio público, calquera copia particular do mesmo podería ser incorporada a un programa propietario (como xa aconteceu con código protexido por licenzas autorais permisivas). Embora tal incorporación non afectaría en absoluto á disponibilidade do código, si implicaría que os esforzos de Stallman poderían beneficiar o inimigo, o software propietario. A GPL pode ser contemplada como unha medida protectora do software libre, en canto evita que o software non libre tire vantaxes do código protexido pola GPL. O capítulo 9, Licenzas, dereitos de autor (copyright) e patentes, analiza a GPL e a súa relación con outras licenzas de software libre.

source: With the help of many programmers, some of whom shared Stallman's ideology and some of whom simply wanted to see a lot of free code available, the GNU Project began releasing free replacements for many of the most critical components of an operating system. Because of the now-widespread standardization in computer hardware and software, it was possible to use the GNU replacements on otherwise non-free systems, and many people did. The GNU text editor (Emacs) and C compiler (GCC) were particularly successful, gaining large and loyal followings not on ideological grounds, but simply on their technical merits. By about 1990, GNU had produced most of a free operating system, except for the kernel&mdash;the part that the machine actually boots up, and that is responsible for managing memory, disk, and other system resources.
gl: Coa axuda de numerosos programadores, algúns dos que compartían a ideoloxía de Stallman e outros que simplemente querían que houbese unha gran cantidade de código libre en circulación, o proxecto GNU comezou a publicar substitutos libres da maior parte dos componentes fundamentais dun sistema operativo. A estandarización actual de hardware e software, amplamente estendida, posibilitou a utilización de substitutos GNU en sistemas non libres, algo do que se beneficiou moita xente. O editor de texto da GNU (Emacs) e o compilador C (GCC) tiveron un suceso especial, e gozaron de unha gran aceptación non por motivos ideolóxicos, senón pola súa perfección técnica. Por volta de 1990, a GNU producira a maoir parte dun sistema operativo, excepto o núcleo (kernel), a parte da máquina responsable do arranque, de administrar a memoria, o disco e outros recursos do sistema.

source: Unfortunately, the GNU project had chosen a kernel design that turned out to be harder to implement than expected. The ensuing delay prevented the Free Software Foundation from making the first release of an entirely free operating system. The final piece was put into place instead by Linus Torvalds, a Finnish computer science student who, with the help of volunteers around the world, had completed a free kernel using a more conservative design. He named it Linux, and when it was combined with the existing GNU programs, the result was a completely free operating system. For the first time, you could boot up your computer and do work without using any proprietary software.
gl: Infelizmente, o proxecto GNU seleccionara un núcleo (kernel) cuxa implementación deu en ser máis complexa do que se esperara. A demora impediu que a Fundación polo Software Libre lanzase a primeira versión dun sistema operativo completamente libre. A derradeira peza foi colocada por Linus Torvalds, estudante finés de ciencias da computación quen, axudado por voluntarios de todo o mundo, completara un núcleo libre de desenho máis tradicional. Púxolle o nome de Linux, e cando foi combinado cos programas GNU existentes, deu orixe a un sistema operativo totalmente libre. Pola primeira vez era posible ligar o computador e traballar sen utilizar software propietario.

source: Technically, Linux was not the first. A free operating system for IBM-compatible computers, called 386BSD, had come out shortly before Linux. However, it was a lot harder to get 386BSD up and running. Linux made such a splash not only because it was free, but because it actually had a high chance of booting your computer when you installed it.
gl: Técnicamente, Linux non foi o primeiro. Un sistema operativo libre para computadoras IBM-compatibles chamado 386BSD, tiña sido publicado antes que Linux. Nembargantes, era máis complexo de configurar e executar o 386BSD. Linux tivo tanto éxito non so por ser libre, senón porque tiñas grandes oportunidades de arrancar a túa computadora con el cando o instalabas.
