Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Branches are valuable because they turn a scarce resource&mdash;working room in the project's code&mdash;into an abundant one. Normally, all developers work together in the same sandbox, constructing the same castle. When someone wants to add a new drawbridge, but can't convince everyone else that it would be an improvement, branching makes it possible for her to go to an isolated corner and try it out. If the effort succeeds, she can invite the other developers to examine the result. If everyone agrees that the result is good, they can tell the version control system to move ("merge") the drawbridge from the branch castle over to the main castle.
es: Las ramas son muy importantes porque convierten un recurso escaso&mdash;espacio de trabajo en el código del proyecto&mdash;en uno abundante. Normalmente, todos los desarrolladores trabajan juntos en la misma caja de arena, construyendo el mismo castillo. Cuando alguien desea añadir un nuevo puente levadizo, pero no puede convencer a los demás de que sería una mejora, entonces las ramas hacen posible que vaya a una esquina aislada donde probar su puente. Si el esfuerzo tiene éxito, puede invitar a otros desarrolladores para que evalúen el resultado. Si todos están de acuerdo en que el resultado es bueno, pueden hacer que el sistema de control de versiones mueva ("merge") el puente levadizo de la rama del castillo a la rama principal del castillo.
gl: As ramas son valiosas xa que converten un recurso escaso &mdash;espazos de traballo no código do proxecto&mdash; nun considerablemente máis abundante. Normalmente todos os desenvolvedores traballan conxuntamente sobre unha mesma versión do software, construíndo un único castelo. Cando alguén quere engadir unha nova torreta, mais non é quen de convencer o resto de que se debería facer iso, a creación dunha rama vaille dar a oportunidade de facelo nunha esquiniña. Se o esforzo ten éxito, pode convidar os outros desenvolvedores a examinaren os resultados. Se todos estiveren de acordo en que o resultado paga a pena, entón poden dicirlle ao sistema de control de versións que mova (fusione -merge) a torreta desde a rama ao castelo principal.

source: It's easy to see how this ability helps collaborative development. People need the freedom to try new things without feeling like they're interfering with others' work. Equally importantly, there are times when code needs to be isolated from the usual development churn, in order to get a bug fixed or a release stabilized (see <xref linkend="stabilizing-a-release"/> and <xref linkend="release-lines"/><phrase output="printed"> in <xref linkend="development-cycle"/></phrase>) without worrying about tracking a moving target.
es: Es fácil ver como esta habilidad ayuda al desarrollo colaborativo, ya que la gente necesita de cierta libertad para probar cosas nuevas sin sentir que están interfiriendo con el trabajo de otros. Igual de importante es cuando el código debe ser aislado del CHURN usual de desarrollo de manera que un fallo sea reparado o un lanzamiento sea estabilizado (más en <xref linkend="stabilizing-a-release"/> y en <xref linkend="release-lines"/><phrase output="printed"> en <xref linkend="development-cycle"/></phrase>) sin la preocupación de seguir un blanco en movimiento.
gl: É doado ver como esta habilidade axuda ao desenvolvemento colaborativo. A xente precisa da liberdade de probaren cousas novas sen sentiren que están a interferir co traballo dos demais. Igualmente importante, hai momentos en que o código precisa ser isolado das tarefas habituais, para corrixir un erro ou estabilizar unha versión para ser liberada(véxase <xref linkend="stabilizing-a-release"/> e <xref linkend="release-lines"/><phrase output="printed"> en <xref linkend="development-cycle"/></phrase>) sen ter que se preocupar acerca de manter controlada unha diana móbil.

source: Use branches liberally, and encourage others to use them. But also make sure that a given branch is only active for exactly as long as needed. Every active branch is a slight drain on the community's attention. Even those who are not working in a branch still maintain a peripheral awareness of what's going on in it. Such awareness is desirable, of course, and commit emails should be sent out for branch commits just as for any other commit. But branches should not become a mechanism for dividing the development community. With rare exceptions, the eventual goal of most branches should be to merge their changes back into the main line and disappear.
es: Hay que utilizar las ramas libremente y fomentar su uso entre otros. Pero también hay que asegurarse de que una rama en particular se mantenga activa exactamente durante el tiempo que sea necesaria. Incluso quienes no trabajan en la rama principal mantienen una visión periférica de lo que está sucediendo en ésta. Esta visión es deseable, por supuesto, y los correos con cambios deben salir de estas ramas como de cualquier otra. Pero las ramas no deben convertirse en un mecanismo que divida a la comunidad de desarrolladores. Con raras excepciones, el objetivo eventual de la mayoría de las ramas debe de ser su unión a la rama principal y desaparecer.
gl: Usa as ramas con liberalidade, e aconsella os demais a que tamén o fagan. Mais tamén debes estar seguro de que cada rama vai permanecer activa exactamente o tempo estritamente necesario. Cada rama é unha pequena fuga na atención da comunidade. Mesmo os que non están a traballar na rama manteñen un interese periférico sobre o que está a acontecer nela. Ese interese é desexable, por suposto, e deberíanse enviar correos de incorporación de mudanzas exactamente igual que no caso dos correspondentes ao corpo principal do proxecto. Mais as ramas non deben tornar nun mecanismo de división da comunidade de desenvolvemento. Salvo raras excepcións, o obxectivo final das máis das ramas debería ser o de que as súas mudanzas sexan reintegradas á liña principal e que a rama desapareza.

source: Singularity of information
es: Singularidad de la información
gl: Singularidade da información

source: Merging has an important corollary: never commit the same change twice. That is, a given change should enter the version control system exactly once. The revision (or set of revisions) in which the change entered is its unique identifier from then on. If it needs to be applied to branches other than the one on which it entered, then it should be merged from its original entry point to those other destinations&mdash;as opposed to committing a textually identical change, which would have the same effect in the code, but would make accurate bookkeeping and release management impossible.
es: Las uniones tienen un corolario importante: nunca se debe enviar el mismo cambio dos veces, es decir, un cambio dado sólo debe ser introducido al sistema de control de versiones solo una vez. La revisión (o conjunto de revisiones) en la que el cambio es introducido es su identificador único desde ese momento. Si debe ser aplicado a otras ramas aparte de la cual en la que ha sido hecho, entonces deberá ser unido desde su punto de entrada original a sus otros destinos &mdash;al contrario de enviar cambios textualmente idénticos, que tendrían el mismo efecto en el código, pero harían del mantenimiento eficaz y de la gestión de lanzamientos una tarea imposible.
gl: A fusión (merging) ten un corolario importante: nunca envíes unha mesma mudanza dúas veces. Isto é, cada mudanza dada debería ser incorporada ao sistema de control de versións exactamente unha soa vez. A revisión (ou conxunto de revisións) na que a mudanza foi incorporada será o seu identificador único de aí en diante. Se for necesario incorporala a outras ramas distintas daquela na que tivo a súa orixe, entón debería ser fusionada (merged) desde o seu punto de entrada orixinal cara a eses outros destinos&mdash;en oposición á integración dunha mudanza textualmente idéntica, que tería o mesmo efecto sobre o código, mais que tornaría imposibles o arquivamento preciso e a xestión de liberacións.

source: The practical effects of this advice differ from one version control system to another. In some systems, merges are special events, fundamentally distinct from commits, and carry their own metadata with them. In others, the results of merges are committed the same way other changes are committed, so the primary means of distinguishing a "merge commit" from a "new change commit" is in the log message. In a merge's log message, don't repeat the log message of the original change. Instead, just indicate that this is a merge, and give the identifying revision of the original change, with at most a one-sentence summary of its effect. If someone wants to see the full log message, she should consult the original revision.
es: Los efectos prácticos de este consejo difieren entre sistemas de control de versiones. En algunos sistemas, las uniones son eventos especiales, fundamentalmente distintos de los commits y acarrean sus meta-datos propios. En otros, el resultado de las uniones son enviadas de la misma manera que los cambios son enviados así que la mejor manera de distinguir una unión de un nuevo cambio es leyendo los mensajes de registro. El mensaje de registro de una unión no repite el mensaje de registro del cambio original, en cambio, sólo indica que es una unión y da la identificación de la revisión del cambio original, con como mucho una línea de sumario del sus efectos. Si alguien desea ver el mensaje de registro completo, deberá consultar la revisión original.
gl: Os efectos prácticos deste consello van diferir dun sistema de control de versións a outro. Nalgúns sistemas, as fusións son acontecementos especiais, fundamentalmente diferentes da incorporación de mudanzas, e presentan o seu propio conxunto de metadatos. Noutros, o resultado das fusións é incorporado exactamente igual que calquera outra mudanza de xeito que o medio fundamental para distinguir unha "incorporación dun ha fusión" dunha "incorporación dunha mudanza" estará nos contidos da mensaxe de rexistro. Nunha mensaxe de rexistro dunha fusión nunca debes repetir a mensaxe de rexistro da mudanza orixinal. Pola contra, debes indicar tan só que se trata dunha fusión, e asígnalle o identificador de revisión da mudanza orixinal, engadindo como moito un breve resumo dos seus efectos. Se alguén quixer ver a mensaxe de rexistro completa, deberá consultar a revisión orixinal.

source: The reason it's important to avoid repeating the log message is that log messages are sometimes edited after they've been committed. If a change's log message were repeated at each merge destination, then even if someone edited the original message, she'd still leave all the repeats uncorrected&mdash;which would only cause confusion down the road.
es: La razón por la cual es importante evitar la repetición de los mensajes de registro es que estos pueden ser editados después de que se hayan enviado. Si un mensaje de registro es repetido en el destino de cada unión, entonces incluso si alguien edita el mensaje original, deja todos los otros mensajes sin corregir&mdash;lo cual sólo puede causar confusión a largo plazo.
gl: A razón pola que a repetición das mensaxes de rexistro é importante é que ás veces son editadas despois de enviada a mudanza. Se a mensaxe de rexistro de cada mudanza fose repetida en cada destino de fusión, entón se alguén editara a mensaxe orixinal, quedarían sen corrixir as distintas repeticións&mdash;o que simplemente causaría confusión no futuro.

source: The same principle applies to reverting a change. If a change is withdrawn from the code, then the log message for the reversion should merely state that some specific revision(s) is being reverted, <emphasis>not</emphasis> describe the actual code change that results from the reversion, since the semantics of the change can be derived by reading the original log message and change. Of course, the reversion's log message should also state the reason why the change is being reverted, but it should not duplicate anything from the original change's log message. If possible, go back and edit the original change's log message to point out that it was reverted.
es: El mismo principio se aplica al retirar un cambio. Si esto llegara a suceder, entonces el mensaje de registro para la retirada solo debe indicar que una revisión en particular está siendo retirada, no debe describir el cambio en el código resultante, pues la semántica del cambio se puede intuir al leer el mensaje de registro original del cambio. Por supuesto, el mensaje de registro del retiro también debe indicar la razón por la cual ese cambio ha sido retirado, pero no debe duplicar nada del mensaje de registro del cambio original. Si es posible, hay que volver y editar el mensaje de registro original para señalar que ha sido retirado.
gl: O mesmo principio pode ser aplicado cando se reverte unha mudanza. No caso de que unha mudanza sexa descartada do código, a única mensaxe de rexistro que debería engadirse debería tan só especificar que unha revisión concreta está a ser descartada, <emphasis>nunca</emphasis> se debería describir a mudanza resultante desa operación, xa que a semántica da mudanza pode derivarse mediante a simple lectura da mensaxe de rexistro da mudanza orixinal. Por suposto, a mensaxe de rexistro do descarte debería igualmente deixar claro por que se decide ese descarte, mais non debería duplicar ningunha información procedente da mensaxe orixinal de rexistro. Sempre que for posible, o que si se debe facer é editar esa mensaxe orixinal para explicar nela que a mudanza á que se refire foi finalmente descartada.

source: All of the above implies that you should use a consistent syntax for referring to revisions. This is helpful not only in log messages, but in emails, the bug tracker, and elsewhere. If you're using CVS, I suggest "<literal>path/to/file/in/project/tree:REV</literal>", where REV is a CVS revision number such as "1.76". If you're using Subversion, the standard syntax for revision 1729 is "r1729" (file paths are not needed because Subversion uses global revision numbers). In other systems, there is usually a standard syntax for expressing the changeset name. Whatever the appropriate syntax is for your system, encourage people to use it when referring to changes. Consistent expression of change names makes project bookkeeping much easier (as we will see in <xref linkend="communications"/> and <xref linkend="development-cycle"/>), and since a lot of the bookkeeping will be done by volunteers, it needs to be as easy as possible.
es: Todo lo anterior implica que se debe utilizar una sintaxis consistente al referirnos a las revisiones. Esto es de gran ayuda no sólo en los mensajes de registro, sino en los correos electrónicos, en el gestor de fallos y en todas partes. Si se esta utilizando CVS, recomiendo "<literal>directorio/al/fichero/del/proyecto/rama:REV</literal>", donde REV es un número de revisión en CVS como "1.76". Si se esta utilizando Subversion, la sintaxis estándar para la revisión 1729 es "r1729" (el directorio de los ficheros no es necesario porque Subversion utiliza números globales para las revisiones). En otros sistemas, existe por lo general una sintaxis estándar para expresar el nombre del conjunto de cambios. Cualquiera que sea la sintaxis apropiada para el sistema utilizado, hay que animar a la gente a que lo utilicen al referirse a algún cambio. El uso consistente en el nombre de los cambios permiten que el mantenimiento del proyecto sea mucho más sencillo (como ya veremos en <xref linkend="communications"/> y en <xref linkend="development-cycle"/>), y dado que mucho de este mantenimiento será realizado por voluntarios, debe ser lo más sencillo posible.
gl: Todo o que antecede implica que se debería empregar unha sintaxe coherente para referirse ás revisións. Isto non é só importante para as mensaxes de rexistro, senón tamén nas de correo electrónico, o xestor de erros (bugtracker), e en toda a documentación do proxecto. Se estás a usar CVS, suxírote "<literal>path/to/file/in/project/tree:REV</literal>", na que REV é un número de revisión concreto do CVS tal como "1.76". Se estás a empregar Subversion, a sintaxe estándar para as revisións 1729 é "r1729" (as rutas dos arquivos non son precisas xa que Subversion emprega números de revisión globais). Noutros sistemas, normalmente hai tamén unha sintaxe estándar para denominar o conxunto de mudanzas. Calquera que for a sintaxe axeitada para o teu sistema, anima a xente a usárena para referírense ás mudanzas. A expresión coherente dos nomes de mudanzas axuda a facer máis doado o arquivamento do proxecto (como veremos en <xref linkend="communicacións"/> and <xref linkend="ciclo-de-desenvolvemento"/>) e como unha boa parte do traballo de arquivamento vai ser feita por voluntarios, mellor mantelo tan simple como for posible.

source: See also <xref linkend="releases-and-daily-development"/><phrase output="printed"> in <xref linkend="development-cycle"/></phrase>.
es: Más información en <xref linkend="releases-and-daily-development"/><phrase output="printed"> <xref linkend="development-cycle"/></phrase>.
gl: Podes ver tamén <xref linkend="liberacións-e-desenvolvemento-diario"/><phrase output="printed"> en <xref linkend="ciclo-de-desenvolvemento"/></phrase>.

source: Authorization
es: Autorizaciones
gl: Autorización

source: Most version control systems offer a feature whereby certain people can be allowed or disallowed from committing in specific sub-areas of the repository. Following the principle that when handed a hammer, people start looking around for nails, many projects use this feature with abandon, carefully granting people access to just those areas where they have been approved to commit, and making sure they can't commit anywhere else. (See <xref linkend="committers"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase> for how projects decide who can commit where.)
es: Muchos de los sistemas de control de versiones ofrecen la posibilidad por la cual a ciertas personas se les permite o no, realizar cambios en áreas específicas del repositorio. Siguiendo el principio de que cuando a las personas se les entrega un martillo empiezan a buscar clavos para golpear, muchos proyectos utilizan esta característica con ABANDON, permitiendo cuidadosamente el acceso solo a las áreas donde tienen permiso de enviar cambio y asegurándose de que no lo puedan hacer en ningún otro sitio. (Más información en <xref linkend="committers"/><phrase output="printed"> <xref linkend="managing-volunteers"/></phrase> sobre como los proyectos deciden quienes pueden hacer cambios y donde.)
gl: Os máis dos sistemas de control de versións ofrecen unha característica pola cal determinadas persoas poden ser autorizadas ou non a introduciren mudanzas en subáreas concretas do repositorio do proxecto. Seguindo o principio de que cando agarras un martelo, a xente comeza a ollar ao redor en busca de cravos, moitos proxectos empregan esta característica con abandono, garantindo coidadosamente que a xente teña acceso a xusto aquelas áreas para as que están autorizados a subiren mudanzas, e que non poidan facelo en ningunha outra parte. (Podes consultar <xref linkend="committers"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase> para entenderes como se decide quen vai poder introducir mudanzas en que partes do proxecto)

source: There is probably little harm done by exercising such tight control, but a more relaxed policy is fine too. Some projects simply use an honor system: when a person is granted commit access, even for a sub-area of the repository, what they actually receive is a password that allows them to commit anywhere in the project. They're just asked to keep their commits in their area. Remember that there is no real risk here: in an active project, all commits are reviewed anyway. If someone commits where they're not supposed to, others will notice it and say something. If a change needs to be undone, that's simple enough&mdash;everything's under version control anyway, so just revert.
es: Probablemente hayan pequeños daños implementar un control así de estricto, pero una política un poco más relajada también esta bien. Algunos proyectos utilizan un sistema basado en el honor: cuando a una persona se le permite la posibilidad de realizar cambios, aunque sea a una pequeña área del repositorio, lo que reciben es una contraseña que les permite realizar cambios en cualquier otro sitio del repositorio y sólo se les pide que mantengan sus cambios en su área. Hay que recordar que no existe ningún peligro aquí: de todas formas, en un proyecto activo, todos los cambios son revisados. Si alguien hace un cambio donde no debía, alguien más se dará cuenta y dirá algo. Es muy sencillo si un cambio debe ser rectificado&mdash;todo está bajo el control de versiones de todas formas, así que sólo hay que volver atras.
gl: Probablemente haxa pouco risco de danos por exercer un control tan estrito, mais unha política máis relaxada é tamén viable. Algúns proxectos simplemente usan un sistema honorífico: cando alguén recibe autorización para acceder ao sistema de control de mudanzas, mesmo para unha subárea do repositorio, o que en realidade están a recibir é un pasaporte para poderen introducir mudanzas en calquera parte do proxecto. Simplemente se lles suxire que manteñan as súas mudanzas na súa área. Ten en conta que non existe ningún risco real en facelo así: nun proxecto activo, todos as mudanzas integradas son revisadas por alguén. Se un colaborador introducir mudanzas nunha área na que non está autorizado a traballar, outros vanse decatar e o van comentar. Se for preciso desfacer unha mudanza, chega con iso&mdash;todo está sometido ao sistema de control de versións, así que simplemente terás que reverter a mudanza.

source: There are several advantages to the relaxed approach. First, as developers expand into other areas (which they usually will if they stay with the project), there is no administrative overhead to granting them wider privileges. Once the decision is made, the person can just start committing in the new area right away.
es: Existen varias ventajas en tal aproximación tan relajada. Primero, mientras los desarrolladores se vayan expandiendo en las diferentes áreas (lo cual harán a menudo si siguen en el proyecto), no es necesario un trabajo administrativo extra de tener que dar y quitar privilegios. Una vez que la decisión es tomada, la persona puede empezar a enviar sus cambios a la nueva área sin problemas.
gl: Hai moitas vantaxes nunha aproximación relaxada. Primeiro, segundo os desenvolvedores van expandíndose por outras áreas (o que con seguridade vai ocorrer, se é que se manteñen no proxecto), non hai ningunha dificultade administrativa en ampliarlles os privilexios de acceso. Unha vez que se toma a decisión, a persoa en cuestión pode comezar inmediatamente a traballar na nova área.
