Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Credit where credit is due: this section wasn't in the first published edition of the book, but Brian Aker's blog entry <ulink url="http://krow.livejournal.com/564980.html">"Release Criteria, Open Source, Thoughts On..."</ulink> reminded me of the usefulness of RSS feeds for open source projects.
es: Si decide ofrecer un wiki, hay que poner un gran esfuerzo en tener una organización clara de las paginas y un diseño visual atractivo, de manera que los visitantes (p.e. editores potenciales) instintivamente sepan como incluir sus contribuciones. Igual de importante, hay que publicar estos estándares en el mismo wiki, de manera que la gente tenga un lugar a donde ir en busca de orientación. Muy a menudo, los administradores de los wikis caen en la trampa de creer que porque hordas de visitantes añaden individualmente contenido de alta calidad al sitio, el resultado de todo esto debe ser también de la más alta calidad y esto no es como funcionan los sitios web. Cada página individual o párrafo puede que sea bueno al ser considerado individualmente, pero no será tan bueno si está encuadrado dentro de un todo desorganizado o confuso. Demasiadas veces, los wikis sufren de:
gl: Ao César o que é do César <footnote><para>Nota do tradutor: tradución libre do orixinal inglés: "Credit where credit is due"</para></footnote>: esta sección non estaba na primeira edición do libro, mais a entrada <ulink url="http://krow.livejournal.com/564980.html">"Release Criteria, Open Source, Thoughts On..."</ulink> no blog de Brian Aker fíxome decatarme da utilidade dos feed RSS para os proxectos de software de fontes abertas.

source: A <firstterm>wiki</firstterm> is a web site that allows any visitor to edit or extend its content; the term "wiki" (from a Hawaiian word meaning "quick" or "super-fast") is also used to refer to the software that enables such editing. Wikis were invented in 1995, but their popularity has really started to take off since 2000 or 2001, boosted partly by the success of Wikipedia (<ulink url="http://www.wikipedia.org/"></ulink>), a wiki-based free-content encyclopedia. Think of a wiki as falling somewhere between IRC and web pages: wikis don't happen in realtime, so people get a chance to ponder and polish their contributions, but they are also very easy to add to, involving less interface overhead than editing a regular web page.
es: <emphasis role="bold">Información duplicada.</emphasis> Frecuentemente los wikis acaban con diferentes páginas con información similar, porque los contribuyentes individuales no se han dado cuenta de la duplicidad. Esto puede ser una consecuencia de la falta de principios de navegación mencionados antes, en que la gente puede que no encuentre contenido duplicado si este no se encuentra donde esperaban encontrarlo.
gl: Unha <firstterm>wiki</firstterm> é un sitio web que permite que cada visitante poida editar e estender os seus contidos; o termo "wiki" (que significa "áxil" ou "super-rápido" en hawaiano) úsase tamén para denominar o software que permite facer esa edición. As wikis foron inventadas en 1995, mais a súa popularidade comezou a aumentar a partir de 2000 ou 2001, acelerada en parte polo éxito da Wikipedia (<ulink url="http://www.wikipedia.org/"></ulink> ou a súa versión en galego: <ulink url="http://gl.wikipedia.org/"></ulink>), unha enciclopedia con contidos libres baseada en wiki. Podes pensar nunha wiki como algo intermedio entre o IRC e as páxinas web: as wikis non se editan en tempo real, de feito que a xente ten tempo de pulir e ponderar as súas contribucións, mais engadirlle contidos é tamén moi doado, implicando menor complexidade que a edición dunha páxina web.

source: Wikis are not yet standard equipment for open source projects, but they probably will be soon. As they are relatively new technology, and people are still experimenting with different ways of using them, I will just offer a few words of caution here&mdash;at this stage, it's easier to analyze misuses of wikis than to analyze their successes.
es: <emphasis role="bold">Audiencia objetivo inconsistente.</emphasis> Hasta cierto punto este problema es inevitable cuando existen tantos autores, pero puede ser ralentizado si existen guías escritas acerca de como crear nuevo contenido. También ayuda editar nuevas contribuciones al principio dando un ejemplo a seguir de manera que los estándares se vayan asentando.
gl: As wikis non son aínda equipamentos estándar para os proxectos de software de fontes abertas, mais probablemente o sexan logo. <footnote><para>Nota do tradutor: de feito, xa no momento de facerse esta tradución (decembro de 2009), practicamente todos os proxectos que se desenvolven de xeito colaborativo contan con cadansúa wiki. Sexa para publicar a documentación e a información de soporte ao usuario, ou como "centro de mando" da totalidade do proxecto</para></footnote>. Como son unha tecnoloxía relativamente nova, e a xente está a experimentar con formas diversas de usalas, vou simplemente aconsellarvos unhas poucas precaucións&mdash;neste punto, é máis doado analizar os usos incorrectos das wikis que os seus éxitos.

source: If you decide to run a wiki, put a lot of effort into having a clear page organization and pleasing visual layout, so that visitors (i.e., potential editors) will instinctively know how to fit in their contributions. Equally important, post those standards on the wiki itself, so people have somewhere to go for guidance. Too often, wiki administrators fall victim to the fantasy that because hordes of visitors are individually adding high quality content to the site, the sum of all these contributions must therefore also be of high quality. That's not how web sites work. Each individual page or paragraph may be good when considered by itself, but it will not be good if embedded in a disorganized or confusing whole. Too often, wikis suffer from:
es: La solución más común para todos estos problemas es el mismo: tener estándares editoriales y mostrarlos no sólo publicándolos sino que editando paginas y adheriendose a estos. En general, los wikis amplificaran cualquier fallo en el material original, ya que los contribuyentes imitaran cualquier patrón que vean. No sólo hay que configurar el wiki y esperar que todo funcione a la perfección. Se debe preparar con contenido bien escrito, de manera que la gente tenga una plantilla que seguir.
gl: Se decidires montar unha wiki, dedica bastante esforzo a conseguir unha organización clara da páxina e unha distribución visual agradable, para que os visitantes (p.e.: editores potenciais) saiban de xeito instintivo como encaixar as súas contribucións. Igualmente importante, publica as instrucións na propia wiki, así a xente terá un sitio ao que acudiren en busca de axuda. Con demasiada frecuencia, os administradores de wikis caen vítimas da fantasía de que, xa que hordas de visitantes van engadir á wiki contidos de alta calidade, a suma de todas as contribucións individuais vai ser en consecuencia de alta calidade. Non é así como traballan os sitios web. Cada páxina individual ou parágrafo pode ser bo se se considera isoladamente, mais pode non selo se está integrado nun conxunto confuso ou desorganizado. Moi frecuentemente, as wikis sofren de:

source: <emphasis role="bold">Lack of navigational principles.</emphasis> A well-organized web site makes visitors feel like they know where they are at any time. For example, if the pages are well-designed, people can intuitively tell the difference between a "table of contents" region and a "content" region. Contributors to a wiki will respect such differences too, but only if the differences are present to begin with.
es: El ejemplo más brillantes de un wiki bien llevado es la Wikipedia, aunque esto sea parcialmente a que el contenido (artículos enciclopédicos) sea idóneo para el formato del wiki. Pero si se examina la Wikipedia en profundidad verá que sus administradores han establecido unas fundaciones <emphasis>muy</emphasis> estrictas para las contribuciones. Existe una extensa documentación acerca de como añadir nuevo contenido o de como mantener un punto de vista apropiado, los tipos de ediciones que hacer (involucrando varios grados, incluyendo una eventual moderación) y así sucesivamente. También tienen controles de autorización, de manera que si una página es el objetivo de ediciones inapropiadas, pueden bloquearla hasta que el problema sea resuelto. En otras palabras, no pusieron unas cuantas plantillas en un sitio web y se sentaron a esperar. La Wikipedia funciona porque sus fundadores pensaron cuidadosamente acerca de como conseguir que cientos de contribuyentes pudieran adaptar sus escritos a una visión común. Aunque puede que no necesite de toda esta preparación al montar un wiki para un proyecto de software libre, está bien emular el espíritu.
gl: <emphasis role="bold">Ausencia de principios de navegación.</emphasis> Un sitio web ben organizado fai que os visitantes sintan que saben onde están en cada momento. Por exemplo, se as páxinas están ben deseñadas, a xente vai saber intuitivamente a diferenza entre unha rexión de "táboa de contidos" e unha rexión de "contidos". Os contribuidores a unha wiki van respectar esa diferenza, mais só se a diferenza está claramente establecida desde o principio.

source: <emphasis role="bold">Duplication of information.</emphasis> Wikis frequently end up with different pages saying similar things, because the individual contributors did not notice the duplications. This can be partly a consequence of the lack of navigational principles noted above, in that people may not find the duplicate content if it is not where they expect it to be.
es: Para más información acerca de los wikis visitad <ulink url="http://es.wikipedia.org/wiki/Wiki"></ulink>. El primer wiki sigue vivo y coleando y contiene mucha información sobre los wikis: <link url="http://www.c2.com/cgi/wiki?WelcomeVisitors"></link>, <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorks"></ulink>, y <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorksNot"></ulink> para varios puntos de vista.
gl: <emphasis role="bold">Duplicación da información.</emphasis> As wikis acaban frecuentemente con varias páxinas dicindo cousas similares, dado que os contribuidores individuais non van ser conscientes da duplicación. Isto pode ser consecuencia en parte da ausencia de principios de navegación comentados antes, debido a que a xente pode non atopar os contidos duplicados se non están onde esperan que estean.

source: <emphasis role="bold">Inconsistent target audience.</emphasis> To some degree this problem is inevitable when there are so many authors, but it can be lessened if there are written guidelines about how to create new content. It also helps to aggressively edit new contributions at the beginning, as an example, so that the standards start to sink in.
es: <title>Sitio Web</title>
gl: <emphasis role="bold">Audiencia obxectivo mal definida.</emphasis> Ata un certo punto, este problema é inevitable cando hai tantos autores diferentes, mais pode ser minimizado se previamente se escriben unha serie de consellos e guías acerca de como crear novos contidos. Editar unha chea de novos contidos a modo de exemplo ao principio tamén axuda, de xeito que os estándares fiquen xa afirmados.

source: The common solution to all these problems is the same: have editorial standards, and demonstrate them not only by posting them, but by editing pages to adhere to them. In general, wikis will amplify any failings in their original material, since contributors imitate whatever patterns they see in front of them. Don't just set up the wiki and hope everything falls into place. You must also prime it with well-written content, so people have a template to follow.
es: No hay mucho que decir acerca de los aspectos técnicos del sitio web del proyecto: montar un servidor web y crear las páginas web son tareas sencillas, y los aspectos más importantes acerca del diseño y contenido ya han sido tratados en capítulos anteriores. La principal función del sitio web es ofrecer una visión general clara y unir las otras herramientas (Sistema de control de versiones, gestión de fallos, etc.). Si no se tiene la experiencia suficiente para configurar un servidor web, no será difícil encontrar a alguien que pueda hacerlo y desee ayudar. Sin embargo, para ahorrar tiempo y esfuerzos, es preferible utilizar uno de los sitios web enlatados.
gl: A solución máis común a todos estes problemas é a mesma: fixar estándares editoriais, e demostralos non só publicándoos, se non publicando páxinas que os poñan en práctica. En xeral, as wikis van amplificar calquera erro nos seus materiais orixinais, xa que os colaboradores tenden a imitar os padróns que teñen á vista. Non poñas en marcha a wiki e fiques esperando a que todo axuste axeitadamente. Deberás tamén alimentala con materiais escritos, para que a xente teña un modelo que seguir.

source: The shining example of a well-run wiki is Wikipedia, though this may be partly because the content (encyclopedia entries) is naturally well-suited to the wiki format. But if you examine Wikipedia closely, you'll see that its administrators laid a <emphasis>very</emphasis> thorough foundation for cooperation. There is extensive documentation on how to write new entries, how to maintain an appropriate point of view, what sorts of edits to make, what edits to avoid, a dispute resolution process for contested edits (involving several stages, including eventual arbitration), and so forth. They also have authorization controls, so that if a page is the target of repeated inappropriate edits, they can lock it down until the problem is resolved. In other words, they didn't just throw some templates onto a web site and hope for the best. Wikipedia works because its founders thought carefully about how to get thousands of strangers to tailor their writing to a common vision. While you may not need the same level of preparedness to run a wiki for a free software project, the spirit is worth emulating.
es: Soluciones de hospedaje
gl: O exemplo máis brillante dunha wiki ben administrada é a Wikipedia, aínda que isto pode ser así en parte porque os seus contidos (entradas dunha enciclopedia) encaixan de forma natural co formato wiki. Mais se examinares atentamente a Wikipedia, verás que os seus administradores deseñaron unha <emphasis>moi</emphasis> ben pensada infraestrutura para a cooperación. Hai unha boa cantidade de documentación sobre como escribir novas entradas, como manter un axeitado punto de vista, que clase de edicións facer, que edicións evitar, un procedemento para a resolución de disputas a respecto de edicións controvertidas (a base de varios pasos, incluíndo eventualmente a arbitraxe), etc. Tamén teñen controis de autoría, de xeito que se unha páxina é obxecto de repetidas edicións inapropiadas, poden bloqueala ata que o problema se resolve. En outras verbas, os seus autores non se limitaron a pór unha serie de moldes nunha web e esperar o mellor. Wikipedia funciona porque os seus fundadores pensaron coidadosamente acerca de como conseguir que milleiros de estranos axustasen os seus escritos a unha visión común. Aínda que ti seguramente non vas precisar un nivel preciso de preparación para montar a wiki dun proxecto de software de fontes abertas, paga a pena emular o seu espírito.

source: For more information about wikis, see <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>. Also, the first wiki remains alive and well, and contains a lot of discussion about running wikis: see <ulink url="http://www.c2.com/cgi/wiki?WelcomeVisitors"></ulink>, <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorks"></ulink>, and <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorksNot"></ulink> for various points of view.
es: Existen dos ventajas importantes de utilizar sitios preparados. La primera es la capacidad y ancho de banda del servidor. Sin importar cuan exitoso pueda a llegar a ser el proyecto, el espacio en disco no se va a acabar y la conexión no se verá superada. La segunda ventaja es sencillez. Estos sitios ya han seleccionado un gestor de fallos, un sistema de control de versiones, un gestor de listas de correos, archivador y todo lo que sea necesario para llevar un sitio web. Ya han configurado las herramientas y se realizan los respaldos necesarios de los datos almacenados por estas. No es necesario tomar decisiones. Sólo es necesario rellenar un formulario, presionar un botón y se tiene un sitio web así de fácil.
gl: Para máis información acerca das wikis, podes consultar <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>. Tamén a primeira wiki está viva e goza de boa saúde, e contén unha chea de discusións acerca de como administrar wikis: podes ver <ulink url="http://www.c2.com/cgi/wiki?WelcomeVisitors"></ulink>, <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorks"></ulink>, e <ulink url="http://www.c2.com/cgi/wiki?WhyWikiWorksNot"></ulink> para analizares varios puntos de vista sobre o tema.

source: Web Site
es: Estos son beneficios muy significativos. La desventaja, por supuesto, es que se debe aceptar <emphasis>sus</emphasis> opciones y configuraciones, incluso si algo diferente sería mejor para el proyecto. Por lo general, estos sitios se pueden ajustar bajo ciertos parámetros pero nunca se obtendrá el control total que se tendría si se hubiera hecho en casa teniendo acceso de administrador al servidor.
gl: Páxina web

source: There is not much to say about setting up the project web site from a technical point of view: setting up a web server and writing web pages are fairly simple tasks, and most of the important things to say about layout and arrangement were covered in the previous chapter. The web site's main function is to present a clear and welcoming overview of the project, and to bind together the other tools (the version control system, bug tracker, etc.). If you don't have the expertise to set up a web server yourself, it's usually not hard to find someone who does and is willing to help out. Nonetheless, to save time and effort, people often prefer to use one of the canned hosting sites.
es: Un ejemplo perfecto de esto es la gestión de los ficheros generados. Ciertas paginas web del proyecto puede que sean ficheros creados&mdash;por ejemplo, existen sistemas para mantener los datos del FAQ en un formato fácil de modificar, desde el cual se pueden generar ficheros HTML, PDF y otros formatos. Al igual como se explica en <xref linkend="version-everything"/><phrase output="printed"> anteriormente en este capítulo</phrase>, no se desean diferentes versiones de los formatos generados, sólo del fichero maestro. Pero cuando el sitio web está hospedado en el servidor de otra persona, puede que sea imposible crear un hook personalizado que permita regenerar la versión HTML pública cada vez que el fichero maestro del FAQ sea modificado. La única solución es tener diferentes versiones de los ficheros generados de manera que aparezcan en el sitio web.
gl: Non hai moito que dicir acerca da posta en marcha da web dun proxecto desde un punto de vista técnico: montar un sitio web e escribir páxinas son tarefas realmente simples, e as máis das cousas importantes que se poden dicir acerca do seu deseño e distribución de contidos foron xa comentadas no capítulo anterior. A principal función do sitio web é a de presentar unha clara e amena visión xeral do proxecto, e enmarcar as restantes ferramentas (o sistema de control de versións, o xestor de incidencias, etc.) Se non es experto na construción de webs, xeralmente non che vai ser difícil atopares alguén que si o é e que estea desexando axudar na materia. Porén, para aforrar tempo e esforzos, a xente xeralmente prefire facer uso de webs pre-enlatadas.

source: Canned Hosting
es: Pueden haber consecuencias más importantes también. Puede que no se tenga el control sobre la presentación deseado. Algunos sitios de hospedaje permiten editar las páginas web, pero el diseño original del sitio termina apareciendo en diversas formas. Por ejemplo, algunos proyectos hospedados en Sourceforge tienen páginas web totalmente personalizadas pero apuntan los enlaces a la página web de Sourceforge para más información. La página en Sourceforge sería la página principal del proyecto si no se hubiera utilizado una personalizada. La página de Sourceforge tiene enlaces al gestor de fallos, repositorio CVS, descargas, etc. Desafortunadamente, una página en Sourceforge también contiene una gran cantidad de ruido de fondo. La parte superior es un anuncio en banner, por lo general, una animación. El lado izquierdo es un arreglo vertical de enlaces con poca relevancia para alguien interesado en el proyecto. El lado derecho es por le general más publicidad. Sólo el centro de la página es dedicado a material específico del proyecto e incluso esto esta organizado de forma confusa lo cual hace que los visitantes no estén seguros de donde pulsar a continuación.
gl: Aloxamento preenlatado

source: There are two main advantages to using a canned site. The first is server capacity and bandwidth: their servers are beefy boxes sitting on really fat pipes. No matter how successful your project gets, you're not going to run out of disk space or swamp the network connection. The second advantage is simplicity. They have already chosen a bug tracker, a version control system, a mailing list manager, an archiver, and everything else you need to run a site. They've configured the tools, and are taking care of backups for all the data stored in the tools. You don't need to make many decisions. All you have to do is fill in a form, press a button, and suddenly you've got a project web site.
es: Detrás de cada aspecto individual del diseño de Sourceforge existe sin lugar a dudas una buena razón&mdash;buena desde el punto de vista de Sourceforge, como la publicidad. Pero desde el punto de vista individual del proyecto el resultado puede que sea una página web alejada de la ideal. No es mi deseo criticar a Sourceforge; estas mismas preocupaciones se aplican a muchos de estos sitios de hospedaje. El punto es que hay que hacer un sacrificio. Se obtiene el alivio de los aspectos técnicos de llevar el sitio del proyecto, pero con la condición de aceptar la forma de llevarlo de otra persona.
gl: Usar un sitio preconfigurado ou preenlatado ten moitas vantaxes. A primeira é a capacidade do servidor e o largo de banda: os seus servidores son caixas enormes conectadas a cabos moi grosos. Por moito éxito que teña o teu proxecto, nunca vas esgotar o espazo en disco ou colapsar a conexión de rede. A segunda vantaxe é a simplicidade. Xa che van dar escollidos un xestor de incidencias, un sistema de control de versións, un xestor de listas de correo, un arquivo, e calquera outra utilidade que poidas precisar para controlar o teu proxecto. As ferramentas estarán xa configuradas, e serán eles quen se ocupen de facer as copias de seguridade de todos os datos almacenados nas ferramentas. Terás poucas decisións que tomar. Todo o que terás que facer e preencher un formulario, premer un botón, e terás de súpeto un sitio web para o teu proxecto.
