Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Version control systems that require locking to make commits are said to use the <firstterm>lock-modify-unlock</firstterm> model. Those that do not are said to use the <firstterm>copy-modify-merge</firstterm> model. An excellent in-depth explanation and comparison of the two models may be found at <ulink url="http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html"></ulink>. In general, the copy-modify-merge model is better for open source development, and all the version control systems discussed in this book support that model.
es: El modelo del sistema de control de versiones que requiere el bloqueo de ficheros suele ser llamado <firstterm>bloqueo-modificación-desbloqueo</firstterm> y el modelo que no requiere del bloqueo es llamado <firstterm>copia-modificación-unión</firstterm>. Una excelente explicación en profundidad y comparaciones puede ser encontrada en <ulink url="http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html"></ulink>. En general, el modelo de copia-modificación-unión es el mejor para el desarrollo open source y todos los sistemas de control de versiones discutidos en este libro soportan este modelo.
gl: Os sistemas de control de versións que requiren do uso do bloqueo para poder subir cambios son coñecidos como modelos do tipo <firstterm>bloqueo-modificación-desbloqueo</firstterm>. Os que non, son denominados modelos <firstterm>copia-modificación-refundido</firstterm>. Unha comparación excelente entre os dous modelos pode ser consultada en <ulink url="http://svnbook.red-bean.com/svnbook-1.0/ch02s02.html"></ulink>. En xeral, o modelo copia-modificación-refundido se considera mellor para o desenvolvemento de software libre, e todos os sistemas de control de versións que se comentan neste libro soportan o dito modelo.

source: Choosing a Version Control System
es: Escoger un sistema de control de versiones
gl: Seleccionando un sistema de control de versións

source: As of this writing, the two most popular version control systems in the free software world are <firstterm>Concurrent Versions System</firstterm> (<firstterm>CVS</firstterm>, <ulink url="http://www.cvshome.org/"></ulink>) and <firstterm>Subversion</firstterm> (<firstterm>SVN</firstterm>, <ulink url="http://subversion.tigris.org/"></ulink>).
es: Hasta ahora, los dos sistemas de control de versiones más populares en el mundo del software libre son <firstterm>Concurrent Versions System</firstterm> (<firstterm>CVS</firstterm>), <ulink url="http://www.cvshome.org/"></ulink>) y <firstterm>Subversion</firstterm> (<firstterm>SVN</firstterm>, <ulink url="http://subversion.tigris.org/"></ulink>).
gl: Cando este libro foi escrito, os dous sistemas de control de versións máis populares no mundo do software libre eran <firstterm>Concurrent Versions System</firstterm> (<firstterm>CVS</firstterm>, <ulink url="http://www.cvshome.org/"></ulink>) e <firstterm>Subversion</firstterm> (<firstterm>SVN</firstterm>, <ulink url="http://subversion.tigris.org/"></ulink>).

source: CVS has been around for a long time. Most experienced developers are already familiar with it, it does more or less what you need, and since it's been popular for a long time, you probably won't end up in any long debates about whether or not it was the right choice. CVS has some disadvantages, however. It doesn't provide an easy way to refer to multi-file changes; it doesn't allow you to rename or copy files under version control (so if you need to reorganize your code tree after starting the project, it can be a real pain); it has poor merging support; it doesn't handle large files or binary files very well; and some operations are slow when large numbers of files are involved.
es: CVS lleva largo tiempo y los desarrolladores más experimentados ya están familiarizados con el. Hace más o menos lo necesario y ya que ha sido popular durante mucho tiempo es probable que no se termine discutiendo su utilización. A pesar de todo, CVS tiene algunas desventajas. No ofrece facilidad para hacer referencia a cambios en múltiples ficheros, no permite renombrar o copiar ficheros dentro del sistema de control (así que puede ser muy doloroso reorganizar el código después de iniciar el proyecto), el soporte para las uniones es algo pobre, no trabaja muy bien con ficheros muy grandes o con ficheros binarios y algunas operaciones son lentas cuando muchos ficheros están involucrados.
gl: CVS está dispoñible desde hai moito tempo. Os desenvolvedores máis experimentados están familiarizados dabondo con el, fai máis ou menos o que precisas, e como é popular dende hai tempo, probablemente non teñas que enredarte en longas discusións sobre se é ou non a opción máis axeitada. Porén, CVS tamén ten algunhas desvantaxes. Non subministra unha maneira doada de tratar cen mudanzas multi-ficheiro; non te deixa renomear ou copiar os ficheiros dentro do sistema de control (así que tentar reorganizar a árbore do código do teu proxecto, unha vez xa iniciado, pode tornarse nun auténtico pesadelo); o seu soporte para as fusións é moi pobre; non manexa nada ben os ficheiros moi grandes ou os binarios; e algunhas operacións son moi lentas cando se fan sobre un número grande de ficheiros.

source: None of CVS's flaws is fatal, and it is still quite popular. However, in the last few years the more recent Subversion has been gaining ground, especially in newer projects.<footnote><para>See <ulink url="http://cia.vc/stats/vcs"></ulink> and <ulink url="http://subversion.tigris.org/svn-dav-securityspace-survey.html"></ulink> for evidence of this growth.</para></footnote>. If you're starting a new project, I recommend Subversion.
es: Ninguno de estos fallos de CVS son fatales y sigue siendo muy popular. Sin embargo, durante los últimos años Subversion ha venido ganando terreno, especialmente con nuevos proyectos. <footnote><para>Más información en <ulink url="http://cia.vc/stats/vcs"></ulink> y para evidencia sobre su crecimiento en <ulink url="http://subversion.tigris.org/svn-dav-securityspace-survey.html"></ulink> .</para></footnote>. Si esta iniciando un nuevo proyecto, recomiendo Subversion.
gl: Ningún dos fallos de CVS é fatal, e aínda é moi popular. Porén, nos últimos anos o máis recente Subversion está a gañar terreo, especialmente nos proxectos máis novos. <footnote><para>Véxase <ulink url="http://cia.vc/stats/vcs"></ulink> e <ulink url="http://subversion.tigris.org/svn-dav-securityspace-survey.html"></ulink> onde se comentan probas deste crecemento.</para></footnote>. Se estás iniciando un proxecto novo, eu recoméndoche Subversion

source: On the other hand, since I'm involved in the Subversion project, my objectivity might reasonably be questioned. And in the last few years a number of new open-source version control systems have appeared. <xref linkend="vc-systems"/> lists all the ones I know of, in rough order of popularity. As the list makes clear, deciding on a version control system could easily become a lifelong research project. Possibly you will be spared the decision because it will be made for you by your hosting site. But if you must choose, consult with your other developers, ask around to see what people have experience with, then pick one and run with it. Any stable, production-ready version control system will do; you don't have to worry too much about making a drastically wrong decision. If you simply can't make up your mind, then go with Subversion. It's fairly easy to learn, and is likely to remain a standard for at least a few years.
es: Por otra parte, dado que estoy involucrado en el proyecto Subversion, mi objetividad puede ser razonablemente cuestionable y durante los últimos años han ido surgiendo un número de nuevos sistemas de control de versiones open source. Podemos encontrar una lista de todos los sistemas que conozco en <xref linkend="vc-systems"/> según su popularidad. Como muestra esta lista, escoger un sistema de control de versiones puede convertirse en una interminable tarea de investigación. Posiblemente esta decisión ya haya sido tomada por el sitio donde hospedamos el proyecto, liberándonos de esta carga, pero si es necesario tomar una decisión, lo mejor es consultar con otros desarrolladores, indagar un poco para tener una idea de las distintas experiencias que haya tenido la gente y luego escoger uno y mantenerse con este. Cualquier sistema de control de versiones estable y listo para entornos de producción será suficiente, no hay que preocuparse demasiado sobre tomar una decisión equivocada. Si simplemente no se puede decidir, entonces la opción es Subversion. Es relativamente fácil de aprender y es probable que se mantenga como el estándar por unos años más.
gl: Pola contra, dado que eu estou participando no proxecto Subversion, a miña obxectividade pode ser razoablemente discutida. E nos últimos anos teñen xurdido un certo número de novos sistemas de control de versións en software libre. En <xref linkend="vc-systems"/>,presento unha listaxe , ordenadas máis ou menos por orde de popularidade. Como a listaxe deixa claro, decidirse por un sistema de control de versións podería tornarse nun proxecto vitalicio en si mesmo. Posiblemente vaste ver liberado desta decisión porque o fará por ti o sitio no que teñas hospedado o teu proxecto. Mais se es ti quen ten que tomar a decisión, consúltao co resto dos desenvolvedores, investiga que experiencia teñen ao respecto, e despois escolle un sistema e traballa con el. Calquera sistema de control de versións estable e listo para a produción vai satisfacer as túas necesidades; non deberías preocuparte moito sobre se tomaches unha decisión radicalmente errónea. Se simplemente non dás tomado unha decisión, entón elixe Subversion. É moi doado de aprender, e seguramente vai seguir sendo un estándar por moitos anos.

source: Using the Version Control System
es: Utilizando el sistema de control de versiones
gl: Usando o sistema de control de versións

source: The recommendations in this section are not targeted toward a particular version control system, and should be simple to implement in any of them. Consult your specific system's documentation for details.
es: Las recomendaciones realizadas en esta sección no están enfocadas hacia un sistema de control de versiones en particular y debería ser sencillo implementarlas en cualquiera. La documentación específica del sistema debe ofrecer los detalles necesarios.
gl: As recomendacións desta sección non se dirixen a un sistema de control de versións en particular, e deberían ser doadas de poñer en práctica en calquera deles. Consulta a documentación do teu sistema específico se precisares máis detalles.

source: Version everything
es: Versiones de todo
gl: Versiona todo.

source: Keep not only your project's source code under version control, but also its web pages, documentation, FAQ, design notes, and anything else that people might want to edit. Keep them right next to the source code, in the same repository tree. Any piece of information worth writing down is worth versioning&mdash;that is, any piece of information that could change. Things that don't change should be archived, not versioned. For example, an email, once posted, does not change; therefore, versioning it wouldn't make sense (unless it becomes part of some larger, evolving document).
es: No solo hay que mantener el código del proyecto bajo el control de versiones también las paginas web, documentación, FAQ, notas de diseño y cualquier cosa que pueda ser necesario editar. Todo esto hay que mantenerlo cerca del código, en el mismo árbol que el repositorio. Se deben mantener versiones de cualquier pieza de información que pueda cambiar y archivar la que no cambie. Por ejemplo, un correo electrónico, una vez enviado, no cambia, por lo tanto, mantener versiones de este no tiene sentido (a menos que se convierta en una parte importante de la documentación).
gl: Debes manter no teu sistema de control de versións non só o código fonte do teu proxecto, senón tamén as súas páxinas web, documentación, FAQ, notas de deseño, e calquera outra cousa que a xente poida querer editar. Mantenas xusto a carón do código, na mesma árbore do repositorio. Calquera peza de información que pague a pena escribir, paga igualmente a pena versionar&mdash;isto é, calquera peza de información que poida ser modificada. As cousas que non están sometidas a mudanzas deberían ser arquivadas, non versionadas. Por exemplo, un email, unha vez enviado, non vai mudar; polo tanto, non tería sentido pensar en que pode ser versionado (a non ser que forme parte dun documento máis longo e que si evolúa no tempo).

source: The reason versioning everything together in one place is important is so people only have to learn one mechanism for submitting changes. Often a contributor will start out making edits to the web pages or documentation, and move to small code contributions later, for example. When the project uses the same system for all kinds of submissions, people only have to learn the ropes once. Versioning everything together also means that new features can be committed together with their documentation updates, that branching the code will branch the documentation too, etc.
es: La razón de mantener versiones de todo en un mismo sitio, es para que la gente sólo tenga que aprender un sistema para realizar cambios. A menudo, un voluntario se iniciara modificando algunas paginas web o partes de la documentación, para luego pasar a realizar pequeñas contribuciones al código, por ejemplo. Cuando el proyecto utiliza el mismo sistema para todo tipo de cambios, las personas sólo tendrán que aprender THE ROPES una vez. Mantener las versiones juntas significa que nuevas características pueden ser añadidas junto a la actualización de la documentación, y que al crear ramas del código, se crearan ramas de la documentación, etc.
gl: A razón pola que é importante versionar todo nun único sitio é que deste xeito a xente soamente terá que aprender un mecanismo para incorporar mudanzas. Frecuentemente, un colaborador vai comezar por enviar mudanzas ás páxinas web ou á documentación, e comezará máis tarde a facer pequenas contribucións ao código, por exemplo. Cando o proxecto emprega o mesmo sistema para todos os tipos de contribucións, a xente só terá que afacerse a el unha vez. Manter todas as versións xuntas significa tamén que as novas características poden ser incorporadas xunto coa súa documentación, e que distribuír o código por varias ramas vai supor que a documentación tamén se distribúe, etc.

source: Don't keep <firstterm>generated files</firstterm> under version control. They are not truly editable data, since they are produced programmatically from other files. For example, some build systems create <filename>configure</filename> based on the template <filename>configure.in</filename>. To make a change to the <filename>configure</filename>, one would edit <filename>configure.in</filename> and then regenerate; thus, only the template <filename>configure.in</filename> is an "editable file." Just version the templates&mdash;if you version the result files as well, people will inevitably forget to regenerate when they commit a change to a template, and the resulting inconsistencies will cause no end of confusion.
es: No hace falta mantener los <firstterm>ficheros generados</firstterm> bajo el sistema de control de versiones ya que no son datos editables generados por otros programas. Por ejemplo, algunos sistemas de compilado generan los ficheros <filename>configure</filename> basandose en una plantilla <filename>configure.in</filename>. Para realizar cambios al fichero <filename>configure</filename> bastaría con modificar <filename>configure.in</filename> y volver a generarlo. Entonces, sólo el fichero <filename>configure.in</filename> es un fichero editable. Sólo es necesario mantener versiones de las plantillas&mdash;si se hace con los ficheros generados, la gente se olvidará de volver a generarlos cuando realicen algún cambio en las plantillas y las resultantes inconsistencias crearan una mayor confusión.
gl: Non manteñas <firstterm>os ficheiros xerados</firstterm> no sistema de control de versións. Non son propiamente datos editables, xa que son xerados automaticamente a partir de outros ficheiros. Por exemplo, algúns sistemas de montaxe (build) crean o ficheiro <filename>configure</filename> a partir do molde <filename>configure.in</filename>. Para facer unha mudanza a <filename>configure</filename>, terías que editar <filename>configure.in</filename> e posteriormente rexenerar o primeiro; así, tan só o molde <filename>configure.in</filename> é un ficheiro "editable". Polo tanto, mantén no control de versións tan só os moldes&mdash;se inclúes os ficheiros resultantes, a xente vai inevitablemente esquecer rexeneralos cando incorporaren unha mudanza a un molde, e a correspondente falta de cohesión non vai causar máis que confusión.

source: For a different opinion on the question of versioning <filename>configure</filename> files, see Alexey Makhotkin's post "<citetitle>configure.in and version control</citetitle>" at <ulink url="http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/"></ulink>.
es: Alexey Mathotkin tiene una opinión diferente sobre el tema de controlar las versiones de los ficheros <filename>configure</filename> en un artículo llamado "<citetitle>configure.in and version control</citetitle>" en <ulink url="http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/"></ulink>.
gl: Mais se quixeres ler unha segunda opinión acerca da cuestión dos ficheiros <filename>configure</filename>,podes revisar o comentario de Alexey Makhotkin "<citetitle>configure.in and version control</citetitle>" en <ulink url="http://versioncontrolblog.com/2007/01/08/configurein-and-version-control/"></ulink>.

source: The rule that all editable data should be kept under version control has one unfortunate exception: the bug tracker. Bug databases hold plenty of editable data, but for technical reasons generally cannot store that data in the main version control system. (Some trackers have primitive versioning features of their own, however, independent of the project's main repository.)
es: La regla de que todos los datos editables deben ser mantenidos bajo el control de versiones tiene una excepción desafortunada: el gestor de fallos. La base de datos de fallos almacena una gran cantidad de datos editables pero generalmente, por razones técnicas, no se puede mantener bajo el control de versiones principal. (Algunos gestores tienen características primitivas de control de versiones, pero independiente de repositorio principal del proyecto.)
gl: A regra de que todo dato editable debe ser mantido nun sistema de control de versións ten infelizmente unha excepción: o xestor de erros (bug tracker). As bases de datos de erros conteñen multitude de datos editables, mais por cuestións técnicas non se pode, xeralmente, ter eses datos almacenados nun sistema de control de versións. (Algúns xestores de erros incorporan de seu algunhas funcionalidades moi primitivas de control de versións, mais en calquera caso independentes do repositorio principal do proxecto).

source: Browsability
es: Navegabilidad
gl: Navegabilidade

source: The project's repository should be browsable on the Web. This means not only the ability to see the latest revisions of the project's files, but to go back in time and look at earlier revisions, view the differences between revisions, read log messages for selected changes, etc.
es: El repositorio del proyecto debe ser accesible desde Internet. Esto no solo significa la habilidad de visualizar la ultima revisión de los ficheros del proyecto, pero permitir volver atrás en el tiempo y ver en revisiones anteriores, mirar las diferencias entre revisiones, leer los mensajes de registro para cambios específicos, etc.
gl: O repositorio do proxecto debe ser navegable desde a web. Isto inclúe non só a habilidade para ver a última revisión dos ficheiros do proxecto, senón tamén poder ir atrás no tempo e visitar revisións anteriores, ver as diferencias entre elas, ler as mensaxes de seguimento (log) de mudanzas concretas, etc.

source: Browsability is important because it is a lightweight portal to project data. If the repository cannot be viewed through a web browser, then someone wanting to inspect a particular file (say, to see if a certain bugfix had made it into the code) would first have to install version control client software locally, which could turn their simple query from a two-minute task into a half-hour or longer task.
es: La navegabilidad es importante porque es un ligero portal a los datos del proyecto. Si el repositorio no es accesible desde un navegador web entonces alguien que desea inspeccionar un fichero en particular (por ejemplo, para mirar si una mejora ha sido incluida en el código) tendrá que instalar el mismo programa utilizado por el sistema de control de versiones, lo cual convierte una simple consulta de dos minutos en una tarea de medio hora o más.
gl: A navegabilidade é importante porque supón o uso dun portal lixeiro de acceso aos datos do proxecto. Se o repositorio non pode ser visitado desde un navegador web, entón alguén que pretenda ver un ficheiro en particular (nomeadamente: comprobar se unha corrección dun erro foi xa incorporada ao código), primeiro tería que instalar localmente un cliente do sistema de control de versións, o que podería tornar a súa tarefa inicial de un par de minutos nun traballo de polo menos media hora.

source: Browsability also implies canonical URLs for viewing specific revisions of files, and for viewing the latest revision at any given time. This can be very useful in technical discussions or when pointing people to documentation. For example, instead of saying "For tips on debugging the server, see the www/hacking.html file in your working copy," one can say "For tips on debugging the server, see <emphasis>http://svn.collab.net/repos/svn/trunk/www/hacking.html</emphasis>," giving a URL that always points to the latest revision of the <filename>hacking.html</filename> file. The URL is better because it is completely unambiguous, and avoids the question of whether the addressee has an up-to-date working copy.
es: También implica URLs CANONICAL para visualizar revisiones específicas de un fichero y para la ultima revisión en cualquier momento. Esto puede ser muy útil durante discusiones técnicas o para indicar alguna documentación a la gente. Por ejemplo, en lugar de decir "Para ayudas sobre como encontrar fallos en el servidor, mirad el fichero www/hacking.html en vuestra copia funcional" se puede decir "Para ayudas sobre como encontrar fallos en el servidor, mirad <emphasis>http://svn.collab.net/repos/svn/trunk/www/hacking.html</emphasis>," dando una URL que siempre lleva a la ultima revisión del fichero <filename>hacking.html</filename>. La URL es mejor porque no es nada ambigua y evita la cuestión de si existe una copia funcional actualizada.
gl: Implica tamén a existencia de URL normalizadas para acceder a revisións específicas dos ficheiros, e para visitar a última revisión nun momento dado. Isto pode ser moi útil cara a discusións técnicas ou cando se trata de dirixir a xente cara á documentación. Por exemplo, en troca de dicir "Para informarse sobre instrucións para reparar o servidor, diríxase ao ficheiro www/hacking.html na súa copia local", podería dicirse"Para informarse sobre instrucións para reparar o servidor, visite <emphasis>http://svn.collab.net/repos/svn/trunk/www/hacking.html</emphasis>," proporcionando unha URL que vai dirixir sempre á última revisión do ficheiro <filename>hacking.html</filename>. A URL é mellor xa que carece totalmente de ambigüidade, e evita o problema de se o destinatario ten unha copia de traballo completamente actualizada.
