Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: List subscribers often want to put mails from the list into a project-specific folder, separate from their other mail. Their mail reading software can do this automatically by examining the mail's <firstterm>headers</firstterm>. The headers are the fields at the top of the mail that indicate the sender, recipient, subject, date, and various other things about the message. Certain headers are well known and effectively mandatory:
es: Por lo general, los suscriptores de las listas mueven estos correos a una carpeta específica para el proyecto, separados de su otro correo personal. Sus clientes de correo hacen esto automáticamente al examinar las <firstterm>cabeceras</firstterm> de los mensajes. La cabecera son los campos que se encuentran en la parte superior de los correos, los cuales indican el remitente, destinatario, asunto, fecha e información variada sobre el mensaje. Cabeceras certeras son bien conocidas y obligatorias:
gl: Frecuentemente, os subscritores das listas quererán arquivar as mensaxes nunha pasta específica para o proxecto, distinta das de outras mensaxes de correo. O seu software de lectura de correo pode facer isto automaticamente sen máis que examinar os <firstterm>cabezallos</firstterm> das mensaxes. Os cabezallos son os campos situados no inicio das mensaxes que indican quen é o remitente, o destinatario, cal é o asunto, a data e outra información variada acerca da mensaxe. Algúns cabezallos son ben coñecidos e certamente imprescindibles:

source: From: ... To: ... Subject: ... Date: ...
gl: De: ... Para: ... Asunto: ... Data: ...

source: Others are optional, though still quite standard. For example, emails are not strictly required to have the
es: Otras son opcionales, aunque de cierta manera estándar. Por ejemplo, no es estrictamente requerido que un correo electrónico tenga la cabecera
gl: Outras son opcionais, aínda que bastante habituais. Por exemplo, os emails non teñen por que levar o cabezallo

source: Reply-to: sender@email.address.here
gl: Responder a: remitente@enderezo de correo,

source: header, but most do, because it gives recipients a foolproof way to reach the author (it is especially useful when the author had to send from an address other than the one to which replies should be directed).
es: pero muchas lo tienen, porque da al destinatario una manera a prueba de errores de responder al remitente (es especialmente útil cuando el remitente ha tenido que enviar un correo desde una dirección diferente a la cual las respuestas deben ser dirigídas).
gl: mais as máis delas o levan, xa que lle ofrece ao destinatario un camiño seguro para acceder ao autor da mensaxe (o que é especialmente útil cando o autor tivo que enviar a mensaxe desde un enderezo distinto a aquel ao que desexa que se lle remitan as respostas).

source: Some mail reading software offers an easy-to-use interface for filing mails based on patterns in the Subject header. This leads people to request that the mailing list add an automatic prefix to all Subjects, so they can set their readers to look for that prefix and automatically file the mails in the right folder. The idea is that the original author would write:
es: Algunos clientes de correo ofrecen una interfaz fácil de usar para rellenar correos basados en patrones en la cabecera Asunto. Esto lleva a que la gente pida que la lista de correo añada automáticamente un prefijo a todos los Asuntos, de forma que puedan configurar sus clientes para que busquen esos prefijos y archivar los correos en el directorio correcto. La idea es que el autor original escribiría:
gl: Algún software de lectura de correo ofrece unha interface de uso sinxelo para filtrar mensaxes baseándose en padróns do cabezallo "asunto". Isto fai que a xente pida que a lista engada un prefixo automático a todos os asuntos, de xeito que se poida configurar o programa para que recoñeza ese prefixo e arquive automaticamente na pasta correcta as mensaxes que o levan. A idea é que o autor da mensaxe escribiría:

source: Subject: Making the 2.5 release.
es: Asunto: Trabajando en la versión 2.5
gl: Asunto: preparando a liberación 2.5.

source: but the mail would show up on the list looking like this:
es: pero el correo aparecería en la lista así:
gl: mais a mensaxe se vería na lista deste xeito:

source: Subject: [discuss@lists.example.org] Making the 2.5 release.
es: Asunto: [discuss@lists.example.org] Trabajando en la versión 2.5
gl: Asunto: [discusions@listas.exemplo.org] preparando a liberación 2.5.

source: Although most list management software offers the option to do this, I strongly recommend against turning the option on. The problem it solves can easily be solved in much less obtrusive ways, and the cost of eating space in the Subject field is far too high. Experienced mailing list users typically scan the Subjects of the day's incoming list mail to decide what to read and/or respond to. Prepending the list's name to the Subject can push the right side of the Subject off the screen, rendering it invisible. This obscures information that people depend on to decide what mails to open, thus reducing the overall functionality of the mailing list for everyone.
es: Aunque la mayoría de las aplicaciones de administración de listas ofrecen la opción de hacer esto, yo recomiendo no utilizarla. El problema que resuelve puede ser resuelto de otras formas menos intrusas y los costes de utilizar espacio en el campo del Asunto son demasiado grandes. Los usuarios experimentados de las listas de correos revisan el asunto de los correos entrantes del día para decidir acerca de qué van a leer y qué van a responder. Fijar el nombre de la lista al Asunto puede mover hacia la derecha el verdadero Asunto y fuera de la pantalla, haciéndolo invisible. Esto oculta información necesaria para aquellos quienes dependen en la decisión de cuales correos van a abrir, reduciendo la funcionalidad conjunta de la lista para todos.
gl: Aínda que a maioría dos programas de xestión de listas ofrecen esta opción, persoalmente recomendo non activala. O problema que resolve pode ser solucionado de maneira máis sinxela por métodos menos intrusivos, e o custo de reducir o espazo do cabezallo "asunto" é considerablemente superior. Os usuarios experimentados de listas de correo acostuman a ver os asuntos da lista de mensaxes entrantes do día para decidiren cal ler ou a cal responder. Se o nome da lista antecede o asunto, o contido deste pode ser desprazado cara ao lado dereito da pantalla, fóra do campo de visión. Isto oculta información que a xente necesita para decidiren que mensaxes abrir, reducindo así a utilidade xeral da lista para todo o mundo.

source: Instead of munging the Subject header, teach your users to take advantage of the other standard headers, starting with the To header, which should say the mailing list's name:
es: En lugar de sobrecargar el Asunto, hay que enseñar a los usuarios para que saquen ventajas de otras cabeceras estándar, empezando con el campo "Para", el cual debería contener el nombre de la lista de correos:
gl: En troca de mudar excesivamente o cabezallo "asunto", aprende aos teus usuarios a tiraren partido de outros cabezallos estándar, comezando polo cabezallo "para", que debería conter o nome da lista:

source: To: &lt;discuss@lists.example.org&gt;
gl: Para: &lt;discusión@listas.exemplo.org&gt;

source: Any mail reader that can filter on Subject should be able to filter on To just as easily.
es: Cualquier cliente de correo capaz de filtrar los mensajes basándose en el Asunto debe ser capaz de filtrar utilizando el campo Para facilmente.
gl: Calquera lector de correo que poida filtrar o "asunto" debería tamén poder filtrar o "para" coa mesma facilidade.

source: There are a few other optional-but-standard headers expected for mailing lists. Filtering on these is even more reliable than using the "To" or "Cc" headers; since these headers are added to each post by the mailing list management software itself, some users may be counting on their presence:
es: Existen otras cabeceras opcionales pero estándar para las listas de correo. Filtrar utilizándolos es incluso más fiable que utilizar las cabeceras "Para" o "Cc" dado que estas cabeceras son añadidas a todos los mensajes por el programa de administración de la lista, así que algunos usuarios están contando con su presencia:
gl: Hai uns poucos cabezallos máis de listas de correo que son opcionais mais estándar. Filtralos é mesmo máis preciso que facelo sobre os "para" ou "CC"; dado que estes cabezallos son engadidos ás mensaxes polo propio software de xestión de listas, algúns usuarios poden contar coa súa presenza:

source: list-help: &lt;mailto:discuss-help@lists.example.org&gt; list-unsubscribe: &lt;mailto:discuss-unsubscribe@lists.example.org&gt; list-post: &lt;mailto:discuss@lists.example.org&gt; Delivered-To: mailing list discuss@lists.example.org Mailing-List: contact discuss-help@lists.example.org; run by ezmlm
gl: axuda-lista: &lt;mailto:discuss-help@lists.example.org&gt; baixa-lista: &lt;mailto:discuss-unsubscribe@lists.example.org&gt; envio-a-lista: &lt;mailto:discuss@lists.example.org&gt; Distribuído-a:: mailing list discuss@lists.example.org Lista: contactar discuss-help@lists.example.org; run by ezmlm

source: For the most part, they are self-explanatory. See <ulink url="http://www.nisto.com/listspec/list-manager-intro.html"></ulink> for more explanation, or if you need the really detailed, formal specification, see <ulink url="http://www.faqs.org/rfcs/rfc2369.html"></ulink>.
es: La mayoría se explican en si mismos. En <ulink url="http://www.nisto.com/listspec/list-manager-intro.html"></ulink> se explican mejor o en <ulink url="http://www.faqs.org/rfcs/rfc2369.html"></ulink> para una especificación formal más detallada.
gl: Os máis deles son obvios. Consulta <ulink url="http://www.nisto.com/listspec/list-manager-intro.html"></ulink> para máis explicacións, ou se precisares especificacións realmente detalladas e formais, podes ver <ulink url="http://www.faqs.org/rfcs/rfc2369.html"></ulink>.

source: Notice how these headers imply that if you have a mailing list named "list", then you also have administrative addresses "list-help" and "list-unsubscribe" available. In addition to these, it is normal to have "list-subscribe", for joining, and "list-owner", for reaching the list administrators. Depending on the list management software you use, these and/or various other administrative addresses may be set up; the documentation will have details. Usually a complete explanation of all these special addresses is mailed to each new user as part of an automated "welcome mail" on subscribing. You yourself will probably get a copy of this welcome mail. If you don't, then ask someone else for a copy, so you know what your users are seeing when they join the list. Keep the copy handy so you can answer questions about the mailing list functions, or better yet, put it on a web page somewhere. That way when people lose their own copy of the instructions and post to ask "How do I unsubscribe from this list?", you can just hand them the URL.
es: Hay que señalar como estas cabeceras implican que si se tiene una lista de correos llamada "list" entonces se tienen también unas direcciones administrativas "list-help" y "list-unsubscribe". Además de estas, es normal tener "list-subscribe" para unirse y "list-owner" para contactar con el administrador de la lista. Dependiendo en la aplicación administrativa que se use, estas y/o otras direcciones administrativas varias pueden ser configuradas; la documentación debería detallar esto. A menudo una explicación completa de todas estas direcciones especiales es enviada a cada nuevo suscriptor como parte de un mensaje de bienvenida automático. Probablemente usted mismo reciba una copia de esto correo de bienvenida. Si no lo ha recibido, pida una copia a alguien, de manera que pueda saber qué están recibiendo los nuevos suscriptores. Mantenga la copia a mano de manera que pueda responder preguntas acerca del funcionamiento de la lista, o mejor aun, ponerlo en una página web en alguna parte. Así, cuando alguien pierda su copia de las instrucciones y pregunte cómo pueden eliminarse de la lista, se les facilita la URL.
gl: Ten en conta que estes cabezallos implican que, se tiveres unha lista denominada "lista", tamén vas dispor de enderezos administrativos "axuda-lista" e "baixa-lista". Ademais, é habitual ter "subscrición-lista" para cadastrarse, e "propietario-lista" para contactar cos seus administradores. Xeralmente se envía automaticamente a explicación sobre a utilidade e todos estes enderezos aos novos subscritores como parte dunha mensaxe de benvida. Probablemente ti mesmo teñas copia desta mensaxes de benvida. Se non for así, pídelle a alguén que cha pase, para que poidas coñecer o que é que os teus usuarios reciben cando se dan de alta na lista. Ten a copia a man de xeito que poidas responder preguntas sobre o funcionamento da lista ou, mesmo mellor, publícaa nalgunha páxina web. Deste xeito, cando alguén perda a súa copia e che mande unha mensaxe preguntando "Como podo darme de baixa nesta lista?, ti só terás que enviarlle a correspondente URL.

source: Some mailing list software offers an option to append unsubscription instructions to the bottom of every post. If that option is available, turn it on. It causes only a couple of extra lines per message, in a harmless location, and it can save you a lot of time, by cutting down on the number of people who mail you&mdash;or worse, mail the list!&mdash;asking how to unsubscribe.
es: Algunas aplicaciones para listas de correos ofrecen la opción de agregar al final de cada mensaje las instrucciones para eliminar la suscripción. Si ésta opción está disponible, usela. Solo causa algunas lineas extra por mensaje en un sitio inofensivo y puede ahorrar mucho tiempo al reducir el número de gente que escriba &mdash;o peor aún, que escriban a la lista&mdash;preguntando cómo eliminar la suscripción.
gl: Algúns programas de listas de correo ofrecen unha opción para engadir ao pé das mensaxes as instrucións para darse de baixa. Se for así, actívaa. Só produce un par de liñas de máis por mensaxe, nunha localización onde non estorban, e pode aforrarche unha boa cantidade de tempo diminuíndo a cantidade de xente que che envía consultas &mdash;ou peor, que manda unha mensaxe á lista!&mdash;preguntando como darse de baixa.

source: The Great Reply-to Debate
es: El gran debate del Reply-To
gl: O Gran debate sobre "responder-a" (Reply-To)

source: Earlier, in <xref linkend="avoid-private-discussions"/>, I stressed the importance of making sure discussions stay in public forums, and talked about how active measures are sometimes needed to prevent conversations from trailing off into private email threads; furthermore, this chapter is all about setting up project communications software to do as much of the work for you as possible. Therefore, if the mailing list management software offers a way to automatically cause discussions to stay on the list, you would think turning that feature on would be the obvious choice.
es: Antes en <xref linkend="avoid-private-discussions"/> hice incapie en la importancia de asegurar que las discusiones se mantengan en foros públicos y hable acerca de porque a veces tomar medidas activas es necesario para prevenir que algunas conversaciones deriven a hilos privados. Este capítulo es acerca de todo lo relacionado con preparar el software de comunicación del proyecto para que realice la mayor cantidad de trabajo posible. Así que, si la aplicación para la administración de las listas de correo ofrece una manera automática de encausar las discusiones a la lista, habría que pensar que habilitarla es la opción correcta.
gl: Antes, en <xref linkend="evita discusións privadas"/>, salientei a importancia de manter discusións seguras nos foros públicos, e falei sobre como é as veces necesario adoptar medidas activas para evitares a conversión de discusións en fíos privados; máis adiante, este capítulo trata completamente sobre a configuración do software de comunicacións para que faga por ti tanto traballo como for posible. Polo tanto, se o software de administración ofrece unha maneira automatizada para evitar que se establezan discusións na lista, deberías pensar que activar esa opción é a decisión obvia.

source: Well, not quite. There is such a feature, but it has some pretty severe disadvantages. The question of whether or not to use it is one of the hottest debates in mailing list management&mdash;admittedly, not a controversy that's likely to make the evening news in your city, but it can flare up from time to time in free software projects. Below, I will describe the feature, give the major arguments on both sides, and make the best recommendation I can.
es: Bueno, quizás no. Existe tal característica, pero tiene algunas desventajas muy importantes. Usarla o no es uno de los debates más calientes en la administración de las listas de correo&mdash;admitamoslo, no es una controversia que vaya a aparecer en las noticias, pero se puede iniciar de vez en cuando en los proyectos de software libre. A continuación, voy a describir esta característica, proponer los argumentos de cada posición y hacer la mejor recomendación que puedo.
gl: Ou talvez non tanto. Existe esa utilidade, mais presenta algunhas desvantaxes realmente importantes. A cuestión de se usala ou non constitúe un dos debates máis quentes no mundo da xestión de listas&mdash;admitámolo, non unha controversia como para saír nas noticias da noite na túa cidade, mais si que pode xurdir de tempo en tempo en todo proxecto de software libre. Máis adiante describirei esta utilidade, darei os principais argumentos a favor e en contra, e darei a mellor recomendación que poida.

source: The feature itself is very simple: the mailing list software can, if you wish, automatically set the Reply-to header on every post to redirect replies to the mailing list. That is, no matter what the original sender puts in the Reply-to header (or even if they don't include one at all), by the time the list subscribers see the post, the header will contain the list address:
es: Esta característica en si misma es muy sencilla: la aplicación para las listas puede, si lo deseamos, automáticamente establecer la cabecera Reply-To en todos los mensajes para dirigir todas las respuestas a la lista. Así que, sin importar lo que escriba el remitente en este campo (o si ni siquiera lo establecen) para cuando los suscriptores a la lista vean el mensaje, éste contendrá la dirección de la lista en la cabecera:
gl: A utilidade en si mesma é moi simple: o software de listas de correo pode, se ti queres, configurar automaticamente o cabezallo "responder-a" (Reply-to) en todas as mensaxes, de xeito que as respostas se encamiñen á propia lista. Isto é, independentemente do que o remitente poña no cabezallo "contestar a "(e mesmo se non poñen nada en absoluto), cando os subscritores vexan a mensaxe, o cabezallo conterá o enderezo da lista:

source: Reply-to: discuss@lists.example.org
gl: Responder a: discusións@listas.exemplo.org

source: On its face, this seems like a good thing. Because virtually all mail reading software pays attention to the Reply-to header, now when anyone responds to a post, their response will be automatically addressed to the entire list, not just to the sender of the message being responded to. Of course, the responder can still manually change where the message goes, but the important thing is that <emphasis>by default</emphasis> replies are directed to the list. It's a perfect example of using technology to encourage collaboration.
es: Esto puede parecer algo bueno, porque virtualmente todos los clientes de correo prestan atención a esta cabecera y ahora cada vez que alguien responda a algún mensaje, su respuesta será automáticamente dirigida a la lista, no sólo a quien ha enviado el mensaje que se responde. Por supuesto que el remitente puede manualmente modificar esto, pero lo importante es que <emphasis>por defecto</emphasis> las respuestas son enviadas a la lista. Este es un ejemplo perfecto de como utilizar la tecnología para animar la colaboración.
gl: De primeiras, parece unha boa idea. Xa que practicamente todo o software de lectura de correo ten en conta o cabezallo "responder a", cando alguén responder a unha mensaxe, a súa resposta vai ser automaticamente dirixida a toda a lista, non só ao remitente da mensaxe orixinal. Por suposto, quen contesta pode mudar manualmente o destinatario da súa mensaxe, mais o importante é que <emphasis>por defecto</emphasis> as respostas son dirixidas á lista. É un exemplo perfecto do uso da tecnoloxía para fomentar a colaboración.

source: Unfortunately, there are some disadvantages. The first is known as the <firstterm>Can't Find My Way Back Home</firstterm> problem: sometimes the original sender will put their "real" email address in the Reply-to field, because for one reason or another they send email from a different address than where they receive it. People who always read and send from the same location don't have this problem, and may be surprised that it even exists. But for those who have unusual email configurations, or who cannot control how the From address on their mails looks (perhaps because they send from work and do not have any influence over the IT department), using Reply-to may be the only way they have to ensure that responses reach them. When such a person posts to a mailing list that he's not subscribed to, his setting of Reply-to becomes essential information. If the list software overwrites it, he may never see the responses to his post.
es: Desafortunadamente, existen algunas desventajas. La primera es conocida como el problema <firstterm>No puedo llegar a casa</firstterm>: a veces, el remitente original establece su dirección de correo real en el campo Reply-To porque por alguna razón u otra envían correos utilizando una dirección diferente a la que utilizan para recibirlos. Las personas que envían y reciben correos desde el mismo sitio no tienen éste problema y quizás se sorprendan de que siquiera existe. Pero para quienes utilizan configuraciones de correo inusuales o quienes no pueden controlar como se forma el campo From de su dirección de correo electrónico (quizás porque envían correos desde sus trabajos y no tienen ninguna influencia sobre el departamento de sistemas) el utilizar el campo Reply-To quizás sea la única manera que tienen para asegurarse de que las respuestas a sus mensajes les llegan (encuentran el camino a casa). Así que si la aplicación de las listas sobre escribe esto, esta persona puede que nunca vea las respuestas a sus mensajes.
gl: Infelizmente, hai algunhas desvantaxes. A primeira é coñecida como o problema de <firstterm>Non podo dar co camiño de volta</firstterm>: ás veces o remitente pon o seu enderezo "real" de correo electrónico no cabezallo "responder a", porque por unha razón ou outra envía o seu correo desde un enderezo distinto de onde o recibe. A xente que sempre envía a recibe o seu correo desde o mesmo enderezo non ten este problema, e pode que se sorprenda mesmo de que exista. Mais para aqueles que teñen configuracións de coreo inusitadas, ou que non poden controlar que enderezo ocupa o campo "de" das súas mensaxes (talvez porque envían os correos desde o seu traballo e non teñen influencia ningunha sobre o seu departamento de TI), usar o "responder a" pode ser a única maneira de asegurar que lles chegan as respostas. Cando alguén así publica algunha mensaxe nunha lista á que non está subscrito, a súa configuración do "responder a" tórnase unha información esencial. Se o software da lista sobrescribe esa información, é posible que nunca chegue a ver as respostas á súa mensaxe.
