Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Ideally, mailing list software would include a message's archive URL, or at least the message-specific portion of the URL, in a header when it distributes the message to recipients. That way people who have a copy of the message would be able to know its archive location without having to actually visit the archives, which would be helpful because any operation that involves one's web browser is automatically time-consuming. Whether any mailing list software actually offers this feature, I don't know; unfortunately, the ones I have used do not. However, it's something to look for (or, if you write mailing list software, it's a feature to consider implementing, please).
es: Lo ideal sería que la aplicación de la lista de correos incluya la URL del mensaje archivado o al menos la porción de la URL específica del mensaje en una cabecera cuando este es distribuido. De esta manera la gente que haya recibido el mensaje podrá conocer su lugar en el archivo sin la necesidad de visitar el archivo, lo cual es de gran ayuda, ya que cualquier actividad que implique el uso del navegador web es automáticamente un consumo de tiempo. Que alguna aplicación de listas de correos ofrece esta posibilidad no lo sé. Desafortunadamente, los que he utilizado no la tienen. Pero esto es algo que hay que buscar (o si desarrolla una aplicación de listas, esta es una característica que debe considerar implementar, por favor).
gl: Idealmente, o software de listas de correo debería incluir a URL do arquivo de mensaxes, ou polo menos a parte específica da URL que se refire á mensaxe, nun cabezallo, cando distribúa as mensaxes aos seus destinatarios. Deste xeito, a xente que ten unha copia da mensaxe coñecerá a localización do seu arquivo sen ter que ver realmente os arquivos, o que é moi útil porque calquera operación que implica o uso do navegador de Internet supón necesariamente un certo consumo de tempo. Non sei se todo o software de listas de correo ofrece esta característica; infelizmente, os que eu teño usado non o fan. Porén, é algo sobre o que pesquisar (ou, se escribires software para listas de correo, é unha característica que deberías considerar implementar, por favor)

source: Backups
es: Respaldos (Backups)
gl: Copias de seguridade (Backups)

source: It should be reasonably obvious how to back up the archives, and the restoration recipe should not be too difficult. In other words, don't treat your archiver as a black box. You (or someone in your project) should know where it's storing the messages, and how to regenerate the actual archive pages from the message store if it should ever become necessary. Those archives are precious data&mdash;a project that loses them loses a good part of its collective memory.
es: Debe ser obvio como respaldar el archivo y la receta para restaurarlo no deben ser muy complicada. En otras palabras, no hay que tratar el archivo como una caja negra. Debe conocer donde se almacenan los mensajes y como restaurar las páginas del archivo del almacén si alguna vez es necesario. Estos archivos contienen datos muy preciados&mdash;un proyecto que los pierde, pierde buena parte de su memoria colectiva.
gl: Como facer copias de seguridade dos arquivos debería ser razoablemente obvio, e a receita de restauración non debería ser moi difícil. Noutras palabras, non trates o teu arquivador como unha caixa negra. Ti (ou alguén do teu proxecto) deberías saber onde se almacenan as mensaxes, e como rexenerar as páxinas de arquivamento desde o almacén de mensaxes no caso de que nalgún momento fose necesario. Eses arquivos conteñen datos preciosos&mdash;un proxecto que os perde, perde tamén unha parte considerable da súa memoria colectiva.

source: Thread support
es: Soporte de los hilos
gl: Soporte aos fíos (Threads)

source: It should be possible to go from any individual message to the <firstterm>thread</firstterm> (group of related messages) that that original message is part of. Each thread should have its own URL too, separate from the URLs of the individual messages in the thread.
es: Desde cualquier mensaje debe ser posible ir al <firstterm>hilo</firstterm> (grupo de mensajes relacionados) al que pertenece el mensaje. Cada hilo debe tener su propia URL también, separado del URL de los mensajes del hilo.
gl: Debería ser posible ir dunha mensaxe dada ao correspondente <firstterm>fío</firstterm> (grupo de mensaxes relacionadas entre si) ao que pertence esa mensaxe en particular. Cada fío debería tamén ter a súa propia URL, distinta das correspondentes ás mensaxes que compoñen o fío.

source: Searchability
es: Búsquedas
gl: Pesquisas

source: An archiver that doesn't support searching&mdash;on the bodies of messages, as well as on authors and subjects&mdash;is close to useless. Note that some archivers support searching by simply farming the work out to an external search engine such as <ulink url="http://www.google.com/">Google</ulink>. This is acceptable, but direct search support is usually more fine-tuned, because it allows the searcher to specify that the match must appear in a subject line versus the body, for example.
es: Un archivo que no permita búsquedas&mdash;tanto en el cuerpo de los mensajes como por autor o según el asunto&mdash;es casi inútil. Hay que señalar que algunos archivadores permiten búsquedas al remitir la labor a un buscador externo como <ulink url="http://www.google.com/">Google</ulink>. Esto es aceptable, pero por lo general, las búsquedas directas son más finas, porque permiten a quien busca, especificar que los resultados sean mostrados, por ejemplo, según el asunto y no según el cuerpo del mensaje.
gl: Un arquivador que non soporte pesquisas&mdash;sobre os corpos das mensaxes, e sobre os seus autores ou asuntos&mdash;é cáseque inútil. Ten en conta que algúns arquivadores soportan pesquisas simplemente derivándoas a un motor externo tal como <ulink url="http://www.google.com/">Google</ulink>. Isto é aceptable, mais o soporte a pesquisas directas normalmente permite un mellor afinado, xa que deixa que a ferramenta de procura especifique que o resultado debe procurarse na liña de asunto e non no corpo, por exemplo.

source: The above is just a technical checklist to help you evaluate and set up an archiver. Getting people to actually <emphasis>use</emphasis> the archiver to the project's advantage is discussed in later chapters, in particular <xref linkend="using-archives"/>.
es: Lo anterior es sólo una lista técnica para ayudar a evaluar y configurar un archivador. Hacer que la gente de hecho <emphasis>utilice</emphasis> el archivo como ventaja para el proyecto es discutido en capítulos posteriores en particular en <xref linkend="using-archives"/>.
gl: O que antecede é simplemente unha lista de control para axudarte a avaliar e configurar un arquivador. Conseguir que a xente faga un <emphasis>uso</emphasis> real do arquivador en beneficio do proxecto se discute en capítulos posteriores, nomeadamente en <xref linkend="usando-arquivos"/>.

source: Here are some open source tools for doing list management and archiving. If the site where you're hosting your project already has a default setup, then you may not ever have to decide on a tool at all. But if you must install one yourself, these are some possibilities. The ones I have actually used are Mailman, Ezmlm, MHonArc, and Hypermail, but that doesn't mean the others aren't good too (and of course, there are probably other tools out there that I just didn't happen to find, so don't take this as a complete list).
es: Aquí hay algunas herramientas open source para la gestión de las listas de correo y su archivo. Si el hosting del proyecto ya tiene una configuración por defecto, quizás no sea necesario siquiera decidir cual herramienta utilizar. Pero si se tiene que instalar una, existen algunas posibilidades. Las que he utilizado son Mailman, Ezmlm, MHonArc e Hypermail, lo cual no significa que no haya otras que sean igual de buenas (y por supuesto, probablemente existan otras que no he logrado encontrar, así que no considere esto como una lista completa).
gl: De seguido se comentan algunhas ferramentas de software libre para a xestión e o arquivamento de listas de correo. Se o sitio no que tes o teu proxecto aloxado ten xa unha configuración por defecto, non vas ter que escoller ningunha ferramenta en particular. Mais si vas ter que instalar unha por ti mesmo, estas son algunhas das posibles. As que eu teño usado son Mailman, Ezmlm, MHonArc, e Hypermail, mais iso non quere decir que non haxa outras igual de boas ( e seguro que existen por aí adiante outras ferramentas que eu nin sequera dei atopado, así que non penses que esta é unha lista completa).

source: Mailing list management software:
es: Aplicaciones de gestión de listas de correo:
gl: Software de xestión de listas de correo:

source: (Has built-in archiver, and hooks for plugging in external archivers.)
es: (Tiene un archivador incorporado y la posibilidad de conectarse a archivadores externos.)
gl: (Ten un arquivador incorporado, así como conexións para arquivadores externos)

source: (Meant to be used with the Procmail mail processing system.)
es: (Para ser utilizado con el sistema de procesamiento de correos Procmail.)
gl: (Deseñado para ser usado co sistema de procesamento de correo electrónico Procmail)

source: (Designed to work with the <ulink url="http://cr.yp.to/qmail.html">Qmail</ulink> mail delivery system.)
es: (Diseñado para funcionar con<ulink url="http://cr.yp.to/qmail.html">Qmail</ulink> .)
gl: (Deseñado para traballar co sistema de distribución de correo <ulink url="http://cr.yp.to/qmail.html">Qmail</ulink>)

source: (Despite the web site's bizarre attempts to hide the fact, this is free software, released under the GNU General Public License. It also has a built-in archiver.)
es: (A pesar del bizarro intento de su sitio web, es un software libre, liberado bajo la licencia GNU GPL. También tiene un archivador incluido.)
gl: (Embora os insistentes esforzos da súa web para ocultalo, é software libre, liberado baixo a licencia GNU. Tamén inclúe un arquivador)

source: Mailing list archiving software:
es: Software para el archivo de las listas de correo:
gl: Software de arquivamento de listas de correo:

source: (Companion software to SmartList, this is a general mail processing system that can, apparently, be configured as an archiver.)
es: (Software que acompaña a SmartList, un sistema de procesado general de correos que puede, aparentemente, ser configurado como un archivo.)
gl: (Software de acompañamento de Smartlistk, é un sistema procesador de correo que pode, aparentemente, ser configurado como arquivador)

source: Version Control
es: <title>Control de Versiones</title>
gl: Control de versións

source: A <firstterm>version control system</firstterm> (or <firstterm>revision control system</firstterm>) is a combination of technologies and practices for tracking and controlling changes to a project's files, in particular to source code, documentation, and web pages. If you have never used version control before, the first thing you should do is go find someone who has, and get them to join your project. These days, everyone will expect at least your project's source code to be under version control, and probably will not take the project seriously if it doesn't use version control with at least minimal competence.
es: Un <firstterm>sistema de control de versiones</firstterm> (o <firstterm>sistema de control de revisiones</firstterm>) es una combinación de tecnologías y practicas para seguir y controlar los cambios realizados en los ficheros del proyecto, en particular en el código fuente, en la documentación y en las páginas web. Si nunca antes se ha utilizado un control de versiones, lo primero que hay que hacer es conseguir a alguien que sí lo haya hecho y hacer que se una al proyecto. Hoy en día todo el mundo espera que al menos el código fuente del proyecto este bajo un control de versiones y probablemente no se tomen el proyecto seriamente si no se utiliza este sistema con un mínimo de competencia.
gl: Un <firstterm>sistema de control de versións</firstterm> (ou <firstterm>sistema de control de revisións</firstterm>) é unha combinación de tecnoloxías e prácticas para facer seguimento e control das mudanzas que se van producindo nos ficheiros dun proxecto, nomeadamente nos de código fonte, documentación e páxinas web. Se nunca antes usaches control de versións, o primeiro que deberías facer é buscar alguén que si o teña usado e fichalo para o teu proxecto. Hoxe en día, todo o mundo espera que cando menos o código fonte do teu proxecto estea subido a un sistema de control de versións, e seguramente non se tomará o proxecto en serio se non se utiliza este sistema cun mínimo de solvencia.

source: The reason version control is so universal is that it helps with virtually every aspect of running a project: inter-developer communications, release management, bug management, code stability and experimental development efforts, and attribution and authorization of changes by particular developers. The version control system provides a central coordinating force among all of these areas. The core of version control is <firstterm>change management</firstterm>: identifying each discrete change made to the project's files, annotating each change with metadata like the change's date and author, and then replaying these facts to whoever asks, in whatever way they ask. It is a communications mechanism where a change is the basic unit of information.
es: La razón por la cual el control de versiones es universal es porque ayuda virtualmente en todos los aspectos al dirigir un proyecto: comunicación entre los desarrolladores, manejo de los lanzamientos, administración de fallos, estabilidad entre el código y los esfuerzos de desarrollo experimental y atribución y autorización en los cambios de los desarrolladores. El sistema de control de versiones permite a una fuerza coordinadora central abarcar todas estas áreas. El núcleo del sistema es la<firstterm> gestión de cambios</firstterm>: identificar cada cambio a los ficheros del proyecto, anotar cada cambio con meta-data como la fecha y el autor de la modificación y disponer esta información para quien sea y como sea. Es un mecanismo de comunicación donde el cambio es la unidad básica de información.
gl: A razón pola que o control de versións é tan universal é que axuda a practicamente todos e cada un dos aspectos relacionados coa xestión dun proxecto: comunicacións entre desenvolvedores, xestión de liberacións, seguimento de erros (bug tracking), estabilidade do código e esforzos de desenvolvemento experimental, e atribución e autorización de mudanzas por certos desenvolvedores. O sistema de control de versións ofrece un centro de mando para todas estas tarefas. O núcleo do control de versións reside na <firstterm>xestión de mudanzas</firstterm>: identificando cada mudanza concreta realizada aos ficheiros do proxecto, anotando cada mudanza con metadatos tales como a súa data e o seu autor, e repetindo estes procesos para quen o solicitar, sen importar como. É un mecanismo de comunicación no que a mudanza é a unidade básica de información.

source: This section does not discuss all aspects of using a version control system. It's so all-encompassing that it must be addressed topically throughout the book. Here, we will concentrate on choosing and setting up a version control system in a way that will foster cooperative development down the road.
es: Aun no hemos discutido todos los aspectos de utilizar un sistema de control de versiones ya que es un tema tan extenso que será introducido según el tópico a lo largo de este libro. Ahora, vamos a concentrarnos en seleccionar y configurar un sistema de control de versiones de forma que fomentemos un desarrollo cooperativo.
gl: Esta sección non vai revisar a totalidade dos aspectos derivados do uso dun sistema de control de versións. É tan transversal que vai ser comentado ao longo do libro. Aquí concentrarémonos na escolla e a configuración dun sistema de control de versións de xeito que facilite o desenvolvemento cooperativo durante a existencia do proxecto.

source: Version Control Vocabulary
es: Vocabulario
gl: Vocabulario do control de versións

source: This book cannot teach you how to use version control if you've never used it before, but it would be impossible to discuss the subject without a few key terms. These terms are useful independently of any particular version control system: they are the basic nouns and verbs of networked collaboration, and will be used generically throughout the rest of this book. Even if there were no version control systems in the world, the problem of change management would remain, and these words give us a language for talking about that problem concisely.
es: En este libro no podemos enseñar como utilizar el control de versiones si nunca antes lo ha utilizado, pero sería imposible continuar sin conocer algunos términos clave. Estos son útiles independientemente del sistema particular utilizado: son definiciones básicas y verbos sobre la colaboración en red y serán utilizados a lo largo del libro. Incluso si no existiera ningún sistema de control de versiones, el problema del control de los cambios aun existiría y estas palabras nos dan un lenguaje para hablar acerca de este problema consistentemente.
gl: Este libro non pode aprenderte a usares o control de versións se nunca antes o usaches, mais sería imposible falar sobre a materia sen definirmos primeiro algúns conceptos chave. Estes termos son útiles independentemente do sistema de control de versións seleccionado: son os verbos e substantivos básicos da colaboración en rede, e serán usados de xeito xenérico ao longo da obra. Aínda que non existisen sistemas de control de versións, o problema da xestión de mudanzas persistiría, e estes termos vannos fornecer unha linguaxe para falar concisamente deste problema.

source: To make a change to the project; more formally, to store a change in the version control database in such a way that it can be incorporated into future releases of the project. "Commit" can be used as a verb or a noun. As a noun, it is essentially synonymous with "change". For example: "I just committed a fix for the server crash bug people have been reporting on Mac OS X. Jay, could you please review the commit and check that I'm not misusing the allocator there?"
es: Realizar un cambio en el proyecto. Formalmente, almacenar un cambio en la base de datos del control de versiones de forma que pueda ser incorporado en lanzamientos futuros del proyecto. "Commit" puede ser utilizado como un verbo o como un sustantivo. Como un sustantivo, es esencialmente un sinónimo de "cambio". Por ejemplo: "He commited una reparación para un fallo reportado en Mac OS X que hacia que el servidor se colgara. Jóse ¿podrías por favor revisarlo y verificar que no estoy haciendo mal la asignación?"
gl: Facer unha mudanza no proxecto; máis formalmente, almacenar unha mudanza na base de datos de control de versións de tal xeito que poida ser incorporada en futuras versións do proxecto. En inglés, "commit" pode ser usado como substantivo ou como verbo. Como substantivo, pode ser considerado como sinónimo de "mudanza". En galego a forma verbal pode ser substituída por "facer un commit". Por exemplo: "fixen o commit dun remendo para o fallo de servidores en Mac OS X que os de xestión de erros estaban a comentar. Jay, poderías revisar a mudanza e comprobar que non estou a facer mal uso do localizador (allocator)?"

source: log&nbsp;message
es: Mensaje de&nbsp;registro
gl: mensaxe de log&nbsp;

source: A bit of commentary attached to each commit, describing the nature and purpose of the commit. Log messages are among the most important documents in any project: they are the bridge between the highly technical language of individual code changes and the more user-oriented language of features, bugfixes, and project progress. Later in this section, we'll look at ways to distribute log messages to the appropriate audiences; also, <xref linkend="codifying-tradition"/><phrase output="printed"> in <xref linkend="communications"/></phrase> discusses ways to encourage contributors to write concise and useful log messages.
es: Un pequeño comentario añadido a cada commit que describe el tipo y el propósito del commit. Los mensajes de registro forman parte de los documentos más importantes de cualquier proyecto ya que son un puente entre el lenguaje altamente técnico de los cambios individuales en el código y el lenguaje más orientado al usuario de características, resolución de fallos y progreso del proyecto. Más adelante vamos a ver la forma de distribuir estos mensajes a la audiencia apropiada y también <xref linkend="codifying-tradition"/><phrase output="printed"> en <xref linkend="communications"/></phrase> discutimos como ENCOURAGE a los voluntarios para que escriban mensajes de registro útiles y concisos.
gl: Un pequeno comentario engadido a cada commit, describindo a natureza e o propósito da mudanza. As mensaxes de log cóntanse entre os documentos máis importantes dun proxecto: constitúen a ponte entre a linguaxe altamente técnica das mudanzas no código e a máis orientada aos usuarios de características, remendo de erros e progreso do proxecto. Máis adiante nesta sección, falaremos de como distribuír as mensaxes de log ás audiencias apropiadas; tamén, <xref linkend="codifying-tradition"/><phrase output="printed"> en <xref linkend="communications"/></phrase> se discute acerca dos modos en que os contribuíntes deben escribir mensaxes de log sinxelas e útiles.

source: update
gl: actualizar (update)

source: To ask that others' changes (commits) be incorporated into your local copy of the project; that is, to bring your copy "up-to-date". This is a very common operation; most developers update their code several times a day, so that they know they're running roughly the same thing the other developers are running, and so that if they see a bug, they can be pretty sure it hasn't been fixed already. For example: "Hey, I noticed the indexing code is always dropping the last byte. Is this a new bug?" "Yes, but it was fixed last week&mdash;try updating, it should go away."
es: Solicitar los cambios (commits) que han realizado otros en la copia local del proyecto, esto actualiza esta copia a la ultima versión. Es una operación muy común ya que la mayoría de los desarrolladores actualizan su código varias veces al día y así saben que están ejecutando casi lo mismo que los otros desarrolladores, así que si se descubre un fallo es muy posible que este aun no haya sido resuelto. Por ejemplo: "Hey, he notado que el código del índice está fallando en el último byte. ¿Es esto un nuevo fallo?" "Sí, pero fue resuelto la semana pasada&mdash;prueba actualizar para resolverlo."
gl: Solicitar que as mudanzas (commits) feitas por outros se incorporen á túa copia local do proxecto; isto é, actualizar a túa copia. É unha operación moi frecuente; os máis dos desenvolvedores actualizan o seu código varias veces ao longo do día, de xeito que están seguros de estar traballando sobre cáseque o mesmo código sobre o que están a traballar os outros colaboradores, e se eles atopan un erro, poden estar bastante seguros de que aínda non foi reparado. Por exemplo: "Ei!, decateime de que o código de indexación perde o último byte constantemente. Trátase dun novo erro?" "Si, mais foi corrixido hai unha semana&mdash;tenta facer unha actualización, debería solucionarse."

source: repository
es: repositorio
gl: repositorio
