Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: The second disadvantage has to do with expectations, and in my opinion is the most powerful argument against Reply-to munging. Most experienced mail users are accustomed to two basic methods of replying: <firstterm>reply-to-all</firstterm> and <firstterm>reply-to-author</firstterm>. All modern mail reading software has separate keys for these two actions. Users know that to reply to everyone (that is, including the list), they should choose reply-to-all, and to reply privately to the author, they should choose reply-to-author. Although you want to encourage people to reply to the list whenever possible, there are certainly circumstances where a private reply is the responder's prerogative&mdash;for example, they may want to say something confidential to the author of the original message, something that would be inappropriate on the public list.
es: La segunda desventaja se refiere a las expectativas y en mi opinión, el argumento más fuerte en contra del cambio del Reply-To. La mayoría de los usuarios experimentados de correo electrónico están acostumbrados a dos métodos básicos de responder: <firstterm>Responder a todos</firstterm> y <firstterm>Responder al remitente</firstterm>. Todos los clientes de correo tienen botones separados para estas dos acciones. Sus usuarios saben que para responder a todos los incluidos en la lista, deben escoger, responder a todos y que para responder sólo al remitente en privado, deben seleccionar Responder al remitente. Aunque se desee animar a que la gente responda a la lista siempre que sea posible, existen ciertas circunstancias cuando un mensaje privado al remitente es prerrogativo&mdash;por ejemplo, desean compartir información confidencial, algo que sería inapropiado para una lista pública.
gl: A segunda desvantaxe ten a ver coas expectativas, e na miña opinión é o argumento máis poderoso contra o uso de forzar o "responder a". Os usuarios de correo electrónico máis experimentados están afeitos a dous métodos básicos de resposta:<firstterm>"responder a todos"</firstterm> e <firstterm>"responder ao remitente"</firstterm>. Todos os programas de lectura de correo electrónico modernos teñen botóns diferentes para estas dúas accións. Os usuarios saben que para responder a todo o mundo (incluíndo a lista) deben escoller "responder a todos", e para responder en privado ao autor orixinal, deben escoller "responder ao remitente". Aínda que desexes fomentar que a xente responda á lista sempre que for posible, hai certas circunstancias nas que a resposta privada é unha decisión de quen responde&mdash;por exemplo, poden querer dicirlle algo confidencial ao autor da mensaxe inicial, algo que resultaría inapropiado publicar na lista.

source: Now consider what happens when the list has overridden the original sender's Reply-to. The responder hits the reply-to-author key, expecting to send a private message back to the original author. Because that's the expected behavior, he may not bother to look carefully at the recipient address in the new message. He composes his private, confidential message, one which perhaps says embarrassing things about someone on the list, and hits the send key. Unexpectedly, a few minutes later his message appears <emphasis>on the mailing list!</emphasis> True, in theory he should have looked carefully at the recipient field, and should not have assumed anything about the Reply-to header. But authors almost always set Reply-to to their own personal address (or rather, their mail software sets it for them), and many longtime email users have come to expect that. In fact, when a person deliberately sets Reply-to to some other address, such as the list, he usually makes a point of mentioning this in the body of the message, so people won't be surprised at what happens when they reply.
es: Ahora consideremos lo que sucede cuando la lista sobre escribe la cabecera Reply-To original del remitente. Quien responde pulsa la opción de Responder al remitente, con la esperanza de enviar un mensaje privado al autor original. Porque esta es la conducta esperada y quizás esta persona no se moleste en examinar cuidadosamente la dirección del destinatario en el nuevo mensaje. Redacta su correo privado, un mensaje confidencial, uno que puede diga algo embarazoso acerca de alguien de la lista y pulsa el botón de enviar. Inesperadamente el mensaje <emphasis>llega a la lista</emphasis> unos minutos después. Cierto, en teoría debería haber revisado cuidadosamente el destinatario y no debería haber asumido nada acerca del campo Reply-To. Pero por lo general este campo se compone con su dirección de correo personal (o en su lugar, los clientes de correo lo hacen) y muchos usuarios asiduos del correo electrónico dan esto por seguro. De hecho, cuando alguien determina deliberadamente el campo Reply-To a alguna otra dirección, como la de la lista, usualmente señalan esto en el contenido del mensaje, de forma que quienes respondan no se sorprendan de lo que sucede cuando lo hacen.
gl: E agora considera o que pasa cando a lista sobrescribe o "responder a" do remitente orixinal. Quen responde pulsa a tecla de "responder ao remitente", esperando que a mensaxe lle sexa enviada directamente ao autor orixinal. Xa que ese é o comportamento esperado, pode que non se preocupe de comprobar o enderezo do destinatario na nova mensaxe. Compón a súa mensaxe privada e confidencial, que quizais conteña cousas embarazosas sobre alguén da lista, e preme a tecla de enviar. De súpeto, poucos minutos máis tarde, a mensaxe aparece <emphasis>na lista!</emphasis>. Certo, en teoría el tiña que ter comprobado convenientemente o que puña no campo "destinatario", e moitos usuarios expertos esperan que se faga así. De feito, cando alguén configura o "responder a" con calquera outro enderezo, como a da lista, xeralmente ten o coidado de mencionar este feito no corpo da mensaxe, de xeito que a xente non se sorprenda do que pasa cando responden.

source: Because of the possibly severe consequences of this unexpected behavior, my own preference is to configure list management software to never touch the Reply-to header. This is one instance where using technology to encourage collaboration has, it seems to me, potentially dangerous side-effects. However, there are also some powerful arguments on the other side of this debate. Whichever way you choose, you will occasionally get people posting to your list asking why you didn't choose the other way. Since this is not something you ever want as the main topic of discussion on your list, it might be good to have a canned response ready, of the sort that's more likely to stop discussion than encourage it. Make sure you do <emphasis>not</emphasis> insist that your decision, whichever it is, is obviously the only right and sensible one (even if you think that's the case). Instead, point out that this is a very old debate, there are good arguments on both sides, no choice is going to satisfy all users, and therefore you just made the best decision you could. Politely ask that the subject not be revisited unless someone has something genuinely new to say, then stay out of the thread and hope it dies a natural death.
es: Dada la posibilidad de consecuencias muy severas de esta conducta inesperada, mi preferencia es la de configurar la aplicación de la lista para que nunca toque la cabecera Reply-To. Este caso de cuando se utiliza la tecnología para animar la colaboración tiene, a mi parecer, efectos colaterales potencialmente peligrosos. Por otro lado, existen argumentos concretos del otro lado de este debate. Sea lo que sea que se escoja, puede que en ocasiones algunas personas pregunten por qué no se ha escogido el otro camino. Dado que esto no es algo que se quiere sea el principal tema de discusión en la lista, puede ser conveniente tener una respuesta preparada del tipo que sea más propensa a poner fin a la discusión en lugar de animarla. Hay que asegurarse de <emphasis>no</emphasis> insistir en que esta decisión, sea cual sea, es obviamente la única correcta (incluso cuando se crea que esto es así). En cambio, hay que señalar que este es un viejo debate, que existen buenos argumentos de cada lado, que ninguna decisión iba a satisfacer a todos los usuarios y que por esto se ha tomado la mejor decisión que se podía. Amablemente se pide que el tema no vuelva a surgir a menos que alguien tenga algo realmente nuevo que decir, entonces hay que mantenerse alejado y esperar a que muera por causas naturales.
gl: Como resultado das consecuencias deste comportamento inesperado, a miña preferencia pasa por configurar o software de xestión da lista de xeito que nunca toque o cabezallo "responder a". Esta é unha das ocasións nas que usar a tecnoloxía para fomentar a colaboración ten, paréceme, efectos colaterais potencialmente perniciosos. En calquera caso, hai tamén algúns argumentos poderosos a favor do outro bando deste debate. Independentemente do que decidas, recibirás de cando en vez mensaxes de xente preguntando por que non o escolles a outra maneira. Como seguramente non queres que esta cuestión se converta no principal fío da lista, sería bo que tiveses preparada unha resposta por anticipado, das do tipo que conducen ao abandono da discusión, en lugar de fomentala. Debes estar seguro de que <emphasis>non</emphasis> insistes en que a túa decisión, sexa esta a que for, é a única correcta (aínda que o penses). Pola contra, explica que este é un debate moi vello, que hai boas razóns nos dous bandos, que ningunha escolla vai satisfacer a todos os usuarios, e que por tanto tomaches a mellor decisión posible. Moi amablemente indica que non se debe reiniciar a discusión sobre a materia salvo que alguén tiver algo realmente novo que dicir, despois mantente á marxe do fío e espera a que morra de morte natural.

source: Someone may suggest a vote to choose one way or the other. You can do that if you want, but I personally do not feel that counting heads is a satisfactory solution in this case. The penalty for someone who is surprised by the behavior is so huge (accidentally sending a private mail to a public list), and the inconvenience for everyone else is fairly slight (occasionally having to remind someone to respond to the whole list instead of just to you), that it's not clear that the majority, even though they are the majority, should be able to put the minority at such risk.
es: Alguien podría sugerir una votación. Se puede permitir esto si se quiere, pero personalmente no creo que contar manos sea una solución satisfactoria en este caso. El castigo para alguien que se vea sorprendido por este comportamiento es demasiado (accidentalmente enviar un correo privado a la lista publica) y las molestias para todos los demás es pequeña (ocasionalmente recordarle a alguien que deben responder a la lista) por esto no está claro de que la mayoría, aunque sean la mayoría, deban poner a una minoría bajo ese riesgo.
gl: Alguén pode suxerir que se faga unha votación para decidir unha solución ou a outra. Podes facelo se quixeres, mais persoalmente non me parece que contar cabezas sexa unha boa maneira de resolver a cuestión. O castigo para quen é sorprendido polo comportamento do software da lista (enviando por accidente unha mensaxe privada á lista) é tan grande, e os inconvenientes para os demais son tan leves (tendo que recordarlle de tanto en tanto a alguén que responda á lista en troca de ao teu enderezo privado), que non está claro que a maioría, aínda que sexa precisamente maioría, poida poñer a minoría en tal risco.

source: I have not addressed all aspects of this issue here, just the ones that seemed of overriding importance. For a full discussion, see these two canonical documents, which are the ones people always cite when they're having this debate:
es: No he llegado a tocar todos los aspectos acerca de este tema, sólo los que me han parecido de especial importancia. Para una discusión completa, se pueden leer los siguientes documentos, los cuales son siempre citados cuando se entra en el debate:
gl: Non estou a tratar aquí todos os aspectos do asunto, tan só aqueles que semellan ser da maior importancia. Para un tratamento máis completo, le estes dous documentos canónicos, que son os que sempre se citan cando xorde este debate:

source: Despite the mild preference indicated above, I do not feel there is a "right" answer to this question, and happily participate in many lists that <emphasis>do</emphasis> set Reply-to. The most important thing you can do is settle on one way or the other early, and try not to get entangled in debates about it after that.
es: A pesar de las benignas preferencias indicadas anteriormente, no creo que exista una única respuestas correcta y he participado felizmente de muchas listas que <emphasis>cambiaban</emphasis>el Reply-To. Lo mejor que se puede hacer, es centrarse en alguna de las dos vías desde el principio e intentar no verse enredado en debates sobre esto despues.
gl: Apesar da miña lixeira preferencia indicada antes, non creo que haxa unha única resposta "correcta" para esta cuestión, e de feito participo en moitas listas que escolleron <emphasis>empregar</emphasis> o "responder a". O mellor que podes facer é decidirte por unha ou outra solución o antes posible, e tratar de non enredarte en debates sobre o tema máis adiante.

source: Two fantasies
es: Dos fantasías
gl: Dúas fantasías

source: Someday, someone will get the bright idea to implement a <firstterm>reply-to-list</firstterm> key in a mail reader. It would use some of the custom list headers mentioned earlier to figure out the address of the mailing list, and then address the reply directly to the list only, leaving off any other recipient addresses, since most are probably subscribed to the list anyway. Eventually, other mail readers will pick up the feature, and this whole debate will go away. (Actually, the <ulink url="http://www.mutt.org/">Mutt</ulink> mail reader does offer this feature.<footnote><para>Shortly after this book appeared, <ulink url="http://www.michaelbernstein.com/">Michael Bernstein</ulink> wrote me to say: "There are other email clients that implement a reply-to-list function besides Mutt. For example, Evolution has this function as a keyboard shortcut, but not a button (Ctrl+L)."</para></footnote>)
es: Algún día, alguien tendrá la brillante idea de implementar una opción <firstterm>Responder a la lista</firstterm> en su cliente de correo. Podría utilizar alguna de las cabeceras para listas mencionadas antes para descubrir la dirección de la lista de correos y luego direccionar las respuestas directamente a la lista, ignorando cualquier otro destinatario, ya que probablemente muchos estén suscritos a la lista de todas formas. Eventualmente, otros clientes implementarán esta característica y todo el debate desaparecerá. (De hecho, el cliente de correos <ulink url="http://www.mutt.org/">Mutt</ulink> ofrece esta opción.<footnote><para> Poco después de que este libro apareciera, <ulink url="http://www.michaelbernstein.com/">Michael Bernstein</ulink> me escribió para comentarme lo siguiente: "Existen otros clientes de correos que implementan una función de responder a la lista a parte de Mutt. Por ejemplo, Evolution tiene una combinación de teclas, pero no un botón (Ctrl+L)."</para></footnote>)
gl: Algún día, alguén vai ter a feliz idea de implementar unha tecla <firstterm>"responder á lista"</firstterm> no seu software de correo electrónico. Empregará algún dos cabezallos estándar mencionados anteriormente para deducir o enderezo da lista, e entón dirixir as respostas tan só á lista, deixando de lado todas os demais enderezos dos destinatarios, xa que os máis deles estarán, de todos modos, subscritos. É posible que outros programas de correo copien a idea, e todo este debate desapareza finalmente. (De feito, o programa <ulink url="http://www.mutt.org/">Mutt</ulink> ofrece xa esta característica.<footnote><para>Pouco despois de que este libro fora publicado, <ulink url="http://www.michaelbernstein.com/">Michael Bernstein</ulink> escribiume para dicirme: "Hai outros programas de correo que incorporan una función de "responder á lista" ademais de Mutt. Por exemplo, Evolution ten esta función en forma de atallo de teclas, aínda que non cun botón (Ctrl+L)."</para></footnote>)

source: An even better solution would be for Reply-to munging to be a per-subscriber preference. Those who want the list to set Reply-to munged (either on others' posts or on their own posts) could ask for that, and those who don't would ask for Reply-to to be left alone. However, I don't know of any list management software that offers this on a per-subscriber basis. For now, we seem to be stuck with a global setting.
es: Una mejor solución sería que el tratamiento del campo Reply-To fuese una opción por suscriptor. Quienes deseen que la lista modifique sus cabeceras Reply-To (ya sea en sus mensajes o en los de otros) podría solicitarlo, y quienes no lo desean, se les deja tranquilos. Aunque no conozco ninguna aplicación para listas de correo que permita esto para cada suscriptor. Así que por ahora, parece que estamos atados a una configuración global.
gl: Unha solución aínda mellor sería que a opción de "responder a" estivese da parte de quen resposta. Aqueles que desexan que a lista teña o "responder a" preconfigurado (ben nas mensaxes dos outros ou nas propias) poderían escoller esta opción, e os demais escollerían que o "responder a" fose escollido por casa usuario. Porén, non coñezo ningún programa que o faga. De momento, parece que estamos estancados na opción da solución global.

source: Since I wrote that, I've learned that there is at least one list management system that offers this feature: <ulink url="http://siesta.unixbeard.net/">Siesta</ulink>. See also this article about it: <ulink url="http://www.perl.com/pub/a/2004/02/05/siesta.html"></ulink>
es: Desde que escribí esto, he aprendido que existe al menos un sistema de gestión de listas que ofrece esta característica: <ulink url="http://siesta.unixbeard.net/">Siesta</ulink>. Hay un artículo sobre este en <ulink url="http://www.perl.com/pub/a/2004/02/05/siesta.html"></ulink>
gl: Desde que escribín o anterior, descubrín que hai polo menos un sistema de xestión de listas que ofrece esta posibilidade: <ulink url="http://siesta.unixbeard.net/">Siesta</ulink>. Tamén podes ler este artigo: <ulink url="http://www.perl.com/pub/a/2004/02/05/siesta.html"></ulink>

source: <title>Archiving</title>
es: <title>Archivo</title>
gl: <title>Arquivamento</title>

source: The technical details of setting up mailing list archiving are specific to the software that's running the list, and are beyond the scope of this book. When choosing or configuring an archiver, consider these qualities:
es: Los detalles técnicos para configurar un archivo para la lista de correos son específicos de la aplicación utilizada y están fuera del alcance de este libro. Al escoger o configurar un archivador, es conveniente considerar lo siguiente:
gl: Os detalles técnicos acerca da configuración do arquivamento de listas de correo son específicos do software que xestiona a lista, e ultrapasan o ámbito deste libro. Cando escollas ou configures un arquivador, ten en conta as seguintes características:

source: Prompt updating
es: Actualización rápida
gl: Actualización áxil

source: People will often want to refer to an archived post made within the last hour or two. If possible, the archiver should archive each post instantaneously, so that by the time a post appears on the mailing list, it's already present in the archives. If that option isn't available, then at least try to set the archiver to update itself every hour or so. (By default, some archivers run their update processes once per night, but in practice that's far too much lag time for an active mailing list.)
es: A menudo la gente querrá ser referida a un mensaje enviado durante la ultima hora o dos. Si es posible, el archivador deberá archivar cada mensaje instantáneamente, de tal manera de que cuando el mensaje aparezca en la lista de correos, ya esté en el archivo. Si esa opción no esta disponible entonces al menos hay que intentar configurar el archivado para que se realice cada hora o así. (Por defecto, algunos archivadores ejecutan el proceso de actualización cada noche, pero en la práctica esta demora es demasiado larga para una lista de correos.
gl: Frecuentemente a xente vai querer referirse a unha mensaxe enviada durante as últimas dúas horas. Se for posible, o arquivador debería almacenar cada mensaxe instantaneamente, de xeito que en canto aparece na lista de correo estea xa dispoñible nos arquivos da mesma. Se esa opción non estiver dispoñible, entón tenta cando menos configurar o arquivador para que se actualice cada hora. Por defecto, algúns arquivadores lanzan os seus procesos de actualización unha vez cada noite, mais iso supón unha demora claramente inasumible para unha lista de correo medianamente activa.

source: Referential stability
es: Estabilidad referencial
gl: Estabilidade referencial

source: Once a message is archived at a particular URL, it should remain accessible at that exact same URL forever, or as close to forever as possible. Even if the archives are rebuilt, restored from backup, or otherwise fixed, any URLs that have already been made publicly available should remain the same. Stable references make it possible for Internet search engines to index the archives, which is a major boon to users looking for answers. Stable references are also important because mailing list posts and threads are often linked to from the bug tracker (see <xref linkend="bug-tracker"/><phrase output="printed"> later in this chapter</phrase>) or from other project documents.
es: Una vez que un mensaje es archivado bajo una URL en particular, debe ser accesible desde esa URL para siempre. Incluso si el archivo es reconstruido o restaurado de un respaldo, cualquier URL que haya sido hecha publica debe permanecer igual. Las referencias estables hacen posible que los buscadores de Internet sean capaces de indexar el archivo, lo cual es una gran ventaja para los usuarios que buscan respuestas. Las referencias estables son también importantes porque los mensajes de la lista y los hilos son enlazados desde el gestor de fallos ( <xref linkend="bug-tracker"/>)<phrase output="printed"> más adelante en este capítulo</phrase> o en la documentación de otros proyectos.
gl: Cando unha mensaxe é arquivada nunha URL dada, debería permanecer accesible para sempre nese mesmo enderezo, ou durante tanto tempo como for posible. Mesmo se os arquivos son reconstruídos, restaurados desde un ficheiro de respaldo (backup), ou reparados de calquera outra maneira, as URL que foran publicamente accesibles nun momento dado deben permanecer accesibles. As referencias estables fan posible que os motores de procura en Internet indexen correctamente os arquivos, o que supón unha vantaxe considerable para usuarios que buscan respostas a preguntas concretas. As estabilidade das referencias é tamén importante porque as mensaxes e fíos das listas de correo acostuman estar enlazadas ao xestor de erros (bug tracker) (véxase <xref linkend="bug-tracker"/><phrase output="printed"> máis adiante neste capítulo</phrase>) ou a outros documentos do proxecto.
