Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Technical Infrastructure
es: Infraestructura Técnica
gl: Infraestrutura Técnica

source: Free software projects rely on technologies that support the selective capture and integration of information. The more skilled you are at using these technologies, and at persuading others to use them, the more successful your project will be. This only becomes more true as the project grows. Good information management is what prevents open source projects from collapsing under the weight of Brooks' Law<footnote><para>From his book <citetitle>The Mythical Man Month</citetitle>, 1975. See <ulink url="http://en.wikipedia.org/wiki/The_Mythical_Man-Month"></ulink> and <ulink url="http://en.wikipedia.org/wiki/Brooks_Law"></ulink>.</para></footnote>, which states that adding manpower to a late software project makes it later. Fred Brooks observed that the complexity of a project increases as the <emphasis>square</emphasis> of the number of participants. When only a few people are involved, everyone can easily talk to everyone else, but when hundreds of people are involved, it is no longer possible for each person to remain constantly aware of what everyone else is doing. If good free software project management is about making everyone feel like they're all working together in the same room, the obvious question is: what happens when everyone in a crowded room tries to talk at once?
es: Los proyectos de software libre dependen en la tecnología que aportan la captura selectiva e integral de información. Mientras mejor se sea usando estas tecnologías y persuadiendo a otros para utilizarlas, mayor será el éxito del proyecto. Esto se vuelve más cierto mientras el proyecto crece. Un buen manejo de la información es lo que previene a un proyecto open source de colapsar bajo el peso de la Ley de Brook,<footnote><para>De su libro<citetitle>El mes mítico del hombre</citetitle>, 1975. Más en <ulink url="http://en.wikipedia.org/wiki/The_Mythical_Man-Month"></ulink> y en <ulink url="http://en.wikipedia.org/wiki/Brooks_Law"></ulink>.</para></footnote> la cual afirma que asignar fuerza de trabajo adicional a un proyecto retrasado lo demorará aún más. Fred Brooks observó que la complejidad de un proyecto se incrementa al<emphasis>cuadrado</emphasis>del número de participantes. Cuando solo unas pocas personas están involucradas, todos pueden hablar entre todos fácilmente, pero cuando cientos de personas están involucradas, ya no es posible que cada uno de los individuos se mantengan constantemente al tanto de lo que todos los demás están haciendo. Si dirigir bien un proyecto de software libre se trata de hacer que todos se sientan como si estuviesen trabajando juntos en la misma habitación, es obvio preguntar: ¿Qué sucedería si todas las personas en una habitación atestada de gente hablase a la vez?
gl: Os proxectos de software libre apóianse en tecnoloxías que facilitan a captura selectiva e a integración da información. Canto máis habilidoso sexas usando estas tecnoloxías, e persuadindo a outros a empregalas, maior éxito terá o teu proxecto. Esta afirmación só empezará a ser certa segundo vaia medrando o proxecto.Unha boa xestión da información é o que evita que os proxectos de software libre sexan esmagados polo peso da Lei de Brooks<footnote><para>Do seu libro<citetitle>The Mythical Man Month</citetitle>, 1975. Ver <ulink url="http://en.wikipedia.org/wiki/The_Mythical_Man-Month"></ulink> e <ulink url="http://en.wikipedia.org/wiki/Brooks_Law"></ulink>.</para></footnote>, que establece que engadir man de obra a un proxecto que vai con atraso fará que se atrase aínda máis. Fred Brooks observou que a complexidade dun proxecto aumenta a razón do <emphasis>cadrado</emphasis> do número de participantes. Mentres só estiver implicado un número reducido de persoas, cada un pode facilmente comunicarse cos demais; mais cando están implicadas centos de persoas, non é xa.posible que cada persoa permaneza constantemente informada do que están a facer todos os demais. Se o segredo dunha boa xestión dun proxecto de software libre reside en conseguir que todo o mundo sinta que está a traballar cos demais na mesma habitación, a pregunta obvia é: que pasa cando todos os que están nunha habitación abarrotada tratan de falar ao mesmo tempo?

source: This problem is not new. In non-metaphorical crowded rooms, the solution is <firstterm>parliamentary procedure</firstterm>: formal guidelines for how to have real-time discussions in large groups, how to make sure important dissents are not lost in floods of "me-too" comments, how to form subcommittees, how to recognize when decisions are made, etc. An important part of parliamentary procedure is specifying how the group interacts with its information management system. Some remarks are made "for the record", others are not. The record itself is subject to direct manipulation, and is understood to be not a literal transcript of what occurred, but a representation of what the group is willing to <emphasis>agree</emphasis> occurred. The record is not monolithic, but takes different forms for different purposes. It comprises the minutes of individual meetings, the complete collection of all minutes of all meetings, summaries, agendas and their annotations, committee reports, reports from correspondents not present, lists of action items, etc.
es: Este problema no es nuevo. En una habitación no metafórica atestada, la solución es <firstterm>un procedimiento parlamentario </firstterm>: guías formales acerca de como tener discusiones en tiempo real en grupos grandes, como asegurarse de que las disensiones más importantes no se pierdan entre comentarios irrelevantes, como formar subcomites, como reconocer cuando se toman decisiones, etc. Las partes más importantes en un procedimiento parlamentario especifican como deben interactuar los grupos con su sistema de manejo de información. Algunos comentarios se hacen para el registro, otros no. El registro mismo es sujeto a manipulación directa y se entiende que no es una transcripción literal de lo que ha ocurrido, sino que es una representación a lo que el grupo está dispuesto a <emphasis>acordar </emphasis> sobre lo sucedido. El registro no es monolítico, sino que toma diferentes formas para diferentes propósitos. Comprende los minutos de encuentros individuales, una colección completa de todos los minutos de todos los encuentros, sumarios, agendas y sus anotaciones, reportes de comités, reportes de corresponsales no presentes, listas de acción, etc.
gl: Este problema non é novo. En habitacións abarrotadas, reais, a solución consiste en adoptar o denominado<firstterm>procedemento parlamentario</firstterm>: un conxunto de normas formais sobre como manter discusións en tempo real no seo de grandes grupos, como estar seguros de que ningunha.manifestación relevante se perde entre moreas de comentarios tipo "eu tamén", como formar subcomités, cómo estar seguros sobre cando foi tomada unha decisión, etc. Unha parte importante do procedemento parlamentario consiste en determinar como interaxe o grupo co seu sistema de xestión da información. Algúns comentarios son feitos coa vontade de que fiquen rexistrados nos arquivos, outros non. O propio arquivo está suxeito a manipulación directa, e é entendido non coma unha transcrición literal do que ocorreu, se non como a transcrición do que o grupo pretende <emphasis>decidir</emphasis> que ocorreu. Os arquivos non son monolíticos, adoptan diferentes formas para diferentes usos. Comprenden tanto as actas de cada reunión como as coleccións completas de todas as actas de todas as reunións, resumos, axendas e as súas anotacións, informes de comités, informes de colaboradores non presentes nas reunións, listas de temas a tratar, etc.

source: Because the Internet is not really a room, we don't have to worry about replicating those parts of parliamentary procedure that keep some people quiet while others are speaking. But when it comes to information management techniques, well-run open source projects are parliamentary procedure on steroids. Since almost all communication in open source projects happens in writing, elaborate systems have evolved for routing and labeling data appropriately; for minimizing repetitions so as to avoid spurious divergences; for storing and retrieving data; for correcting bad or obsolete information; and for associating disparate bits of information with each other as new connections are observed. Active participants in open source projects internalize many of these techniques, and will often perform complex manual tasks to ensure that information is routed correctly. But the whole endeavor ultimately depends on sophisticated software support. As much as possible, the communications media themselves should do the routing, labeling, and recording, and should make the information available to humans in the most convenient way possible. In practice, of course, humans will still need to intervene at many points in the process, and it's important that the software make such interventions convenient too. But in general, if the humans take care to label and route information accurately on its first entry into the system, then the software should be configured to make as much use of that metadata as possible.
es: Dado que Internet no es realmente una habitación, no debemos preocuparnos acerca de replicar aquellas partes de los procesos parlamentarios que mantiene a algunas personas calladas mientras las demás hablan. Pero cuando nos referimos a técnicas de manejo de la información, proyectos open source bien dirigidos son como procesos parlamentarios en esteroides. Ya que todas las comunicaciones en los proyectos open source suceden por escrito, sistemas muy elaborados han evolucionado para enrutar y etiquetar apropiadamente los datos, para minimizar las repeticiones de forma que se eviten divergencias espuriosas, para almacenar y buscar los datos, para corregir información incorrecta u obsoleta y para asociar bits dispares de información con cada uno mientras que nuevas conexiones son observadas. Los participantes activos en los proyectos open source integran muchas de estas técnicas y a menudo realizaran complejas labores manuales para asegurar que la información sea dirigida correctamente. Pero todo el esfuerzo depende al final de un sofisticado soporte informático. Tanto que sea posible, los mismos medios de comunicación deben realizar éste enrutamiento, etiquetado y registro y debería mantener la información al alcance de los humanos de la manera más conveniente posible. En la práctica, por supuesto, los humanos siguen necesitando intervenir en muchos puntos durante el proceso y también es importante que estos programas hagan ésta intervención lo más conveniente. Pero por lo general, si los humanos se encargan de etiquetar y enrutar información acertadamente desde su primera entrada en el sistema, entonces el software debería estar configurado para dar el máximo uso posible a esa metadata.
gl: Como Internet non é realmente unha habitación, non temos que preocuparnos de replicar as partes do procedemento parlamentario que teñen a ver con manter unhas persoas caladas mentres outros falan. Mais cando se trata de técnicas de xestión da información, os proxectos de software libre ben xestionados poden compararse a procedementos parlamentarios dopados con esteroides. Dado que nos proxectos de software libre practicamente toda a comunicación se fai por escrito, os sistemas elaborados evoluíron para faceren axeitadamente o seguimento e a etiquetaxe dos datos; cara á minimización das repeticións para evitaren diverxencias espúreas; para o correcto almacenamento e recuperación dos datos; cara a corrixir a información errónea ou obsoleta; e cara a asociación entre si de bits de datos desaparellados en canto se observan novas conexións. Quen participa activamente en proxectos de software libre adopta moitas destas técnicas, e frecuentemente é quen de executar complexas operacións manuais para garantir que a información está a ser xestionada axeitadamente. Mais o traballo completo depende en grande medida da axuda de software sofisticado. Na medida do posible son precisamente as ferramentas de comunicación as que deberían asumir as máis das tarefas de direccionamiento, etiquetaxe, e gravación, e deberían achegarlle a información aos seres humanos da maneira máis axeitada. É obvio que na vida real os seres humanos van ter que intervir en moitas etapas do proceso, e é importante que o software facilite esas intervencións. Mais en xeral, se os seres humanos toman a precaución de etiquetar e encamiñar a información correctamente ao inserila pola primeira vez no sistema, o software debería estar configurado para tirar o máximo partido dos metadatos.

source: The advice in this chapter is intensely practical, based on experiences with specific software and usage patterns. But the point is not just to teach a particular collection of techniques. It is also to demonstrate, by means of many small examples, the overall attitude that will best encourage good information management in your project. This attitude will involve a combination of technical skills and people skills. The technical skills are essential because information management software always requires configuration, plus a certain amount of ongoing maintenance and tweaking as new needs arise (for example, see the discussion of how to handle project growth in <xref linkend="bug-filtering"/><phrase output="printed"> later in this chapter</phrase>). The people skills are necessary because the human community also requires maintenance: it's not always immediately obvious how to use these tools to full advantage, and in some cases projects have conflicting conventions (for example, see the discussion of setting <systemitem>Reply-to</systemitem> headers on outgoing mailing list posts, in <xref linkend="mailing-lists"/>). Everyone involved with the project will need to be encouraged, at the right times and in the right ways, to do their part to keep the project's information well organized. The more involved the contributor, the more complex and specialized the techniques she can be expected to learn.
es: El consejo de éste capítulo es intensamente práctico, basado en las experiencias con aplicaciones y patrones específicos. Pero el objetivo no es sólo enseñar una colección particular de técnicas. Es también demostrar, utilizando pequeños ejemplos, la actitud general que mejor fomentará el correcto uso de los sistemas de manejo de información en el proyecto. Esta actitud incluye una combinación de habilidades técnicas y don de gentes. Las habilidades técnicas son esenciales porque las aplicaciones de manejo de información siempre requieren cierta configuración y además una cierta cantidad de mantenimiento y puesta apunto mientras nuevas necesidades vayan surgiendo (por ejemplo, mirad la discusión de como manejar el crecimiento del proyecto en <xref linkend="bug-filtering"/><phrase output="printed"> más adelante en éste capítulo</phrase>). El don de gentes es necesario porque la comunidad humana también requiere de cierto mantenimiento: no siempre es inmediatamente obvio como utilizar estas herramientas para obtener una ventaja completa y en algunos casos los proyectos tienen convenciones conflictivas (por ejemplo, la discusión de como crear cabeceras <systemitem>Reply-to</systemitem> en los mensajes salientes de las lista de correos, en <xref linkend="mailing-lists"/>). Todos los involucrados en el proyecto van a necesitar ser animados, en el momento correcto de la forma correcta, para que sigan manteniendo la información del proyecto bien organizada. Mientras más involucrado esté el contribuyente, más complejas y especializadas serán las técnicas que se esperará que aprendan.
gl: As recomendacións recollidas neste capítulo son principalmente prácticas, baseadas en experiencias con patróns de software específico e de uso. Mais a cuestión non é aprendervos unha colección particular de técnicas. É tamén a de demostrar, a través do uso de moitos pequenos exemplos, a actitude xeral que mellor se vai adecuar á correcta xestión da información nos vosos proxectos. Esta actitude envolve un conxunto de habilidades técnicas e habilidades persoais. As habilidades técnicas son esenciais dado que o software de xestión da información sempre ten que ser correctamente configurado, ademais de precisar de unha certa cantidade de mantemento permanente e de modificación en canto xurdir unha nova necesidade (como exemplo, botádelle unha ollada á discusión sobre como manexar o crecemento do proxecto en <xref linkend="filtraxe de erros"/><phrase output="printed"> máis adiante neste mesmo capítulo</phrase>). As habilidades persoais son necesarias xa que a comunidade humana tamén require de mantemento: non sempre é inmediatamente obvio o modo de empregar estas ferramentas para obter o mellor rendemento, e nalgúns casos os proxectos adoptan convencións conflitivas (como exemplo, podes ver a discusión sobre a configuración dos cabezallos <systemitem>Reply-to</systemitem> das mensaxes saíntes nas listas de correo ). Todos os que estiveren implicados no proxecto van precisar que, nalgún momento ou noutro e da maneira correcta, se lles force a facer a súa parte do traballo para manter ben organizada a información relativa ao mesmo. Canto máis implicado estiver o colaborador, máis complexas e especializadas serán as técnicas que se espera que aprenda.

source: Information management has no cut-and-dried solution. There are too many variables. You may finally get everything configured just the way you want it, and have most of the community participating, but then project growth will make some of those practices unscalable. Or project growth may stabilize, and the developer and user communities settle into a comfortable relationship with the technical infrastructure, but then someone will come along and invent a whole new information management service, and pretty soon newcomers will be asking why your project doesn't use it&mdash;for example, this is happening now to a lot of free software projects that predate the invention of the wiki (see <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>). Many questions are matters of judgement, involving tradeoffs between the convenience of those producing information and the convenience of those consuming it, or between the time required to configure information management software and the benefit it brings to the project.
es: El manejo de información no tiene soluciones rápidas ya que existen demasiadas variables. Pueden que finalmente se tenga todo configurado justo como se desea y tener a la mayoría de la comunidad participando pero luego el crecimiento del proyecto hace de estas practicas no escalables. El puede que el crecimiento del proyecto se estabilice y que la comunidad de usuarios y desarrolladores acuerden una relación confortable con la infraestructura técnica pero llega alguien e inventa un nuevo servicio de manejo de información completo y pronto muchos de los recién llegados empezarán a preguntar que por qué no es utilizado en el proyecto&mdash; por ejemplo, esto está sucediendo mucho últimamente en proyectos de software libre que son anteriores a la invención del Wiki (más en <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>). Muchas cuestiones son materia de juicio, incluyendo las desventajas entre la conveniencia de aquellos generando información y la conveniencia de aquellos quienes la consumen o entre el tiempo requerido para configurar el software de manejo de la información y los beneficios que le brinda al proyecto.
gl: Non existen solucións á medida para a xestión da información. Hai demasiadas variables. Podedes ter absolutamente todo configurado da maneira que queredes telo, e coa maioría da comunidade participando xa, mais entón o crecemento do proxecto fará que non sexa posible incrementar una desas prácticas. Ou o crecemento do proxecto pode terse estabilizado, e as comunidades de desenvolvedores e de usuarios manter unha confortable relación coa infraestrutura técnica, mais entón alguén se presentará cunha solución de xestión da información completamente nova, e os recentemente incorporados ao proxecto logo van comezar a preguntar por que non está a ser empregada&mdash; por exemplo, isto está a ocorrer actualmente cunha chea de proxectos de software libre anteriores á invención das wikis (véxase <ulink url="http://en.wikipedia.org/wiki/Wiki"></ulink>). Moitas decisións dependerán de matices, xa que van ser resoltas mediante compromisos entre os intereses de quen produce a información e os de quen a consume, ou do tempo requirido para configurar o software de xestión da información fronte aos beneficios que este poida achegar ao proxecto.

source: Beware of the temptation to over-automate, that is, to automate things that really require human attention. Technical infrastructure is important, but what makes a free software project work is care&mdash;and intelligent expression of that care&mdash;by the humans involved. The technical infrastructure is mainly about giving humans convenient ways to do that.
es: Cuidado con la tentación de automatizar demasiado, esto es, automatizar cosas que realmente requieren de atención por parte de los humanos. La infraestructura técnica es importante, pero lo que hace que los proyectos de software libre funcionar es el cuidado&mdash;y la expresión inteligente de éste cuidado&mdash;de los humanos involucrados. Principalmente, la infraestructura técnica está para ofrecer medios convenientes para hacer esto.
gl: Loitade contra a tentación de hiper-automatizar, e dicir, de automatizar procesos que en realidade requiren da atención humana. A infraestrutura técnica é importante, mais o que fai que un proxecto de software libre funcione é o coidado&mdash;e a manifestación intelixente dese coidado&mdash; por parte dos individuos involucrados. A infraestrutura técnica ten a ver principalmente con fornecerlles aos humanos formas convenientes de facelo.

source: What a Project Needs
es: Lo que necesita un proyecto
gl: Que é o que un proxecto precisa

source: Most open source projects offer at least a minimum, standard set of tools for managing information:
es: La mayoría de los proyectos open source ofrecen al menos un mínimo y estándar conjunto de herramientas para manejar información:
gl: Os máis dos proxectos de software de código aberto ofrecen cando menos un conxunto mínimo e estándar de ferramentas para a xestión da información:

source: Web site
es: <term>Sitio Web</term>
gl: Sitio Web

source: Primarily a centralized, one-way conduit of information from the project out to the public. The web site may also serve as an administrative interface for other project tools.
es: Principalmente, conducto de información centralizado en un sentido del proyecto para el público. El sitio web puede también servir como una interfaz para otras herramientas del proyecto.
gl: É ante todo un conduto centralizado e unidireccional de transmisión de información desde o proxecto cara ao público. O sitio web pode tamén funcionar como interface administrativa para outras ferramentas do proxecto.

source: Mailing lists
es: Listas de Correo
gl: Listas de correo

source: Usually the most active communications forum in the project, and the "medium of record."
es: Usualmente es el foro de comunicación más activo del proyecto y el "medio de registro."
gl: Xeralmente constitúen os foros de comunicación máis activos do proxecto, ademais do "medio de arquivamento"

source: Version control
es: <term>Control de Versiones</term>
gl: Control de versións
