Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: In this stage, or sometimes the previous one, a developer may "take ownership" of the issue and <firstterm>assign</firstterm> it to herself (<xref linkend="delegation-assignment"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase> examines the assignment process in more detail). The issue's <firstterm>priority</firstterm> may also be set at this stage. For example, if it is so severe that it should delay the next release, that fact needs to be identified early, and the tracker should have some way of noting it.
es: Llegados a este punto, o a veces en uno de los anteriores, puede que algún programador ya se haya "adueñado" de la entrada y se lo <firstterm>asigne</firstterm> a si mismo (el proceso es examinado en mayor detalle en <xref linkend="delegation-assignment"/><phrase output="printed"> en <xref linkend="managing-volunteers"/></phrase>). La <firstterm>prioridad</firstterm> de la entrada puede que también sea fijada en esta etapa. Por ejemplo, si el fallo es tan severo que debería retrasar el próximo lanzamiento, debe ser identificado desde el principio y el gestor debe proporcionar un mecanismo para hacer esto.
gl: Neste paso, ou ás veces no anterior, un desenvolvedor vaise "apropiar" do asunto e <firstterm>auto asignarseo</firstterm> (<xref linkend="asignación-de-delegacións"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase> examina o proceso con máis detalle). A <firstterm>prioridade</firstterm> pode tamén ser establecida neste paso. Por exemplo, se for tan severo que podería retrasar a seguinte liberación, ese asunto precisa ser identificado logo, e o xestor debería proporcionar algunha maneira de notificalo.

source: The issue gets scheduled for resolution. Scheduling doesn't necessarily mean naming a date by which it will be fixed. Sometimes it just means deciding which future release (not necessarily the next one) the bug should be fixed by, or deciding that it need not block any particular release. Scheduling may also be dispensed with, if the bug is quick to fix.
es: La entrada es programada para su resolución. Esto no implica necesariamente fijar una fecha para cuando debe ser resuelta. A veces sólo significa decidir para cual próximo lanzamiento (no necesariamente la siguiente) el fallo debe estar corregido o decidir si debe o no bloquear un lanzamiento en particular. Incluso nos podemos olvidar de planificar la reparación del fallo si es algo que se puede hacer rapidamente.
gl: O asunto é entón programado para ser resolto. A programación non ten por que incluír a determinación dunha data límite para a súa corrección. Ás veces implica simplemente determinar en que liberación futura (non necesariamente a seguinte) o erro debería estar solucionado, ou decidir que non é preciso bloquear ningunha liberación en particular. A programación pode tamén ser ignorada, se o erro é doado de resolver.

source: The bug gets fixed (or the task completed, or the patch applied, or whatever). The change or set of changes that fixed it should be recorded in a comment in the issue, after which the issue is <firstterm>closed</firstterm> and/or marked as <firstterm>resolved</firstterm>.
es: El fallo es reparado (o la tarea es completada, o el parche es aplicado o lo que sea). El cambio o conjunto de cambios que arreglan el fallo deben ser registrados en un comentario en la entrada, después de lo cual ésta es <firstterm>cerrada</firstterm> o marcada como <firstterm>resuelta</firstterm>.
gl: O erro é resolto (ou a tarefa completada, ou o remendo aplicado, ou o que for). A mudanza ou conxunto de mudanzas resultantes da súa resolución deberán ser gravadas nun comentario, e posteriormente o asunto é <firstterm>pechado</firstterm> e/ou marcado como <firstterm>resolto</firstterm>.

source: There are some common variations on this life cycle. Sometimes an issue is closed very soon after being filed, because it turns out not to be a bug at all, but rather a misunderstanding on the part of the user. As a project acquires more users, more and more such invalid issues will come in, and developers will close them with increasingly short-tempered responses. Try to guard against the latter tendency. It does no one any good, as the individual user in each case is not responsible for all the previous invalid issues; the statistical trend is visible only from the developers' point of view, not the user's. (In <xref linkend="bug-filtering"/><phrase output="printed"> later in this chapter,</phrase> we'll look at techniques for reducing the number of invalid issues.) Also, if different users are experiencing the same misunderstanding over and over, it might mean that that aspect of the software needs to be redesigned. This sort of pattern is easiest to notice when there is an issue manager monitoring the bug database; see <xref linkend="issue-manager"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>.
es: Existen variaciones en este ciclo. A veces el problema es cerrado seguidamente después de ser archivado, porque resulta que no es un fallo, sino que es un malentendido por parte del usuario. Mientras el proyecto vaya ganando usuarios, más y más de estas entradas invalidas aparecerán, y los desarrolladores las cerraran con respuestas cada vez menos respetuosas. Hay que intentar protegerse de ésta tendencia, pues no le hace ningún bien a nadie, porque el usuario en cada caso no es responsable de las entradas invalidas previas. Esta tendencia estadísticas sólo es divisada por los desarrolladores, no por los usuarios. (En <xref linkend="bug-filtering"/><phrase output="printed"> más adelante en este capítulo,</phrase> examinaremos algunas técnicas para reducir el número de entradas invalidas.) También puede suceder que varios usuarios estén experimentando el mismo malentendido una y otra vez, lo cual significa que algún aspecto de la aplicación necesita volver a ser diseñada. Este tipo de patrones son los más sencillos de ver cuando se utiliza un gestor de entradas que monitorice la base de datos de fallos. Más en <xref linkend="issue-manager"/><phrase output="printed"> en <xref linkend="managing-volunteers"/></phrase>.
gl: Hai algunhas variacións frecuentes sobre este ciclo de vida. Ás veces un asunto é pechado moi cedo tras ser comunicado, porque resulta non ser realmente un erro, senón un fallo de utilización por parte do usuario. Segundo o proxecto vai tendo máis usuarios, máis de estes falsos erros van ser comunicados, e os desenvolvedores van proceder a pechalos con comentarios cada vez máis intempestivos. Tenta evitar esta última tendencia. Non lle fai ningún ben a ninguén, xa que o usuario que comunica o erro en cada caso non é responsable do todas as comunicacións previas; a tendencia estatística é visible só desde o punto de vista dos desenvolvedores, non dos usuarios.(Máis adiante neste capítulo, en <xref linkend="filtrado-de-erros"/><phrase output="printed"> </phrase>, veremos algunhas técnicas destinadas a reducir o número de falsos erros). Igualmente, se diferentes usuarios están a cometer o mesmo fallo de operación unha e outra vez, poderíase pensar que esa parte do software precisa ser redeseñada. Este tipo de padróns son máis doados de detectar cando hai un xestor de asuntos monitorizando a base de datos de erros; véxase <xref linkend="xestor-de-asuntos"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase>.

source: Another common life cycle variation is for the issue to be closed as a <firstterm>duplicate</firstterm> soon after Step 1. A duplicate is when someone files an issue that's already known to the project. Duplicates are not confined to open issues: it's possible for a bug to come back after having been fixed (this is known as a <firstterm>regression</firstterm>), in which case the preferred course is usually to reopen the original issue and close any new reports as duplicates of the original one. The bug tracking system should keep track of this relationship bidirectionally, so that reproduction information in the duplicates is available to the original issue, and vice versa.
es: Otra variación muy común de este ciclo de vida es cuando la entrada es cerrada al ser un <firstterm>duplicado</firstterm> poco después del paso 1. Un duplicado aparece cuando alguien crea una entrada para un problema ya conocido por el proyecto. Los duplicados no están limitados a entradas abiertas: es posible que un fallo haya reaparecido después de haberlo reparado (esto es conocido como <firstterm>regresión</firstterm>), por lo cual, la vía preferida es usualmente reabrir la entrada original y cerrar cualquier nuevo reporte como duplicado de este. El sistema de gestión de fallo debe mantener un seguimiento de esta relación bidimensional, de forma que la información en los duplicados este disponible en la entrada original y vice versa.
gl: Outra variación frecuente do ciclo de vida consiste en pechar o asunto como <firstterm>duplicado</firstterm> xusto despois do Paso 1. Un duplicado é un asunto que xa é coñecido polos responsables do proxecto. Os duplicados non afectan exclusivamente a asuntos abertos: é posible que un erro volva manifestarse mesmo despois de ter sido resolto (isto é coñecido como <firstterm>regresión</firstterm>), en cuxo caso o procedemento preferido consiste en reabrir o asunto orixinal e pechar calquera nova notificación do mesmo como duplicados do anterior. O sistema de xestión de erros debería facer seguimento bidireccional desta relación, de xeito que a información sobre reproducción contida nos duplicados estea dispoñible para o orixinal, e viceversa.

source: A third variation is for the developers to close the issue, thinking they have fixed it, only to have the original reporter reject the fix and reopen it. This is usually because the developers simply don't have access to the environment necessary to reproduce the bug, or because they didn't test the fix using the exact same reproduction recipe as the reporter.
es: Una tercera variación es cuando los desarrolladores cierran la entrada pensando que ya ha sido resuelta y el usuario que la ha reportado rechaza esa reparación y es reabierta. Por lo general esto es porque el desarrollador no tiene la capacidad de reproducir el fallo o porque no han probado su reparación siguiendo la misma receta para la reproducción descrita por el usuario.
gl: Unha terceira variación consiste en que os desenvolvedores pechen o asunto, pensando que o resolveron, e ver que o informante orixinal rexeita a solución e o reabre. Isto xeralmente ocorre porque os desenvolvedores simplemente non teñen acceso ao entorno necesario para reproduciren o fallo, ou porque non o reproduciron seguindo exactamente a mesma receita aportada polo informante para a súa reprodución.

source: Aside from these variations, there may be other small details of the life cycle that vary depending on the tracking software. But the basic shape is the same, and while the life cycle itself is not specific to open source software, it has implications for how open source projects use their bug trackers.
es: A parte de estas variaciones existen pequeños detalles de este ciclo de vida que pueden variar dependiendo de la aplicación de seguimiento. Pero la forma básica es la misma e incluso cuando el ciclo de vida no es sólo para el software open source, tiene implicaciones acerca de cómo los proyectos utilizan sus sistemas de control de fallos.
gl: Para alén destas varacións, poden darse outros aspectos do xestor de erros que poden variar dependendo do software empregado. Mais o aspecto básico é o mesmo, e mentres o ciclo de vida en sí mesmo non é especifico do software de fontes abertas, ten implicacións concretas en como os proxectos de software aberto usan os seus xestores de erros.

source: As Step 1 implies, the tracker is as much a public face of the project as the mailing lists or web pages. Anyone may file an issue, anyone may look at an issue, and anyone may browse the list of currently open issues. It follows that you never know how many people are waiting to see progress on a given issue. While the size and skill of the development community constrains the rate at which issues can be resolved, the project should at least try to acknowledge each issue the moment it appears. Even if the issue lingers for a while, a response encourages the reporter to stay involved, because she feels that a human has registered what she has done (remember that filing an issue usually involves more effort than, say, posting an email). Furthermore, once an issue is seen by a developer, it enters the project's consciousness, in the sense that that developer can be on the lookout for other instances of the issue, can talk about it with other developers, etc.
es: Implícito en el paso 1, el sistema es una cara tan publica del proyecto, como lo pueden ser las listas de correo o las paginas web. Cualquiera puede crear una entrada, cualquiera puede ver una entrada y cualquiera puede navegar la lista de entradas abiertas. De tal manera que nunca se sabe cuantas personas están interesadas en ver el progreso en una entrada en particular. Aunque el tamaño y la capacidad de la comunidad de desarrolladores constriñe la frecuencia con la que los problemas son atacados, el proyecto debe al menos intentar reconocer cada entrada mientras vayan llegando. Incluso si el problema persiste por un tiempo, una repuesta anima al usuario a mantenerse involucrado porque siente que un humano ha visto lo que ha hecho (recordad que rellenar una entrada requiere mucho más tiempo que un correo electrónico). Incluso mejor, una vez que una entrada es vista por un desarrollador, entra en la conciencia del proyecto, en el sentido en que este puede mantenerse al acecho de otras instancias del mismo problema, puede comentarlo con otros desarrolladores, etc.
gl: Tal como se deduce do Paso 1, o xestor é tan "fachada pública" do proxecto como poidan selo as listas de correo ou as páxinas web. Calquera pode rexistrar un asunto, calquera pode facer seguimento dun asunto, e calquera pode explorar a lista de asuntos actualmente abertos. Ocorre que non podes coñecer canta xente está pendente de como se resolve un asunto. Mentres que o tamaño e a habilidade da comunidade van reducir o prazo en que os asuntos son resoltos, o proxecto debería en todo caso ser quen de tomar coñecemento de cada asunto xusto no momento en que é detectado. Mesmo se un asunto permanece activo durante un tempo, unha resposta vai favorecer que o informante permaneza interesado, xa que vai notar que alguén tomou nota do que el reportou (lembra que preencher un formulario de notificación dun asunto leva máis tempo que, por exemplo, escribir un correo electrónico). Aínda máis, unha vez que un asunto é revisado por un desenvolvedor, pasa a formar parta da "consciencia" do proxecto, no senso de que ese desenvolvedor pode estar xa analizando outras instancias do asunto, pode falar sobre o tema con outros colegas, etc.

source: The need for timely reactions implies two things:
es: La necesidad de reacciones oportunas implica dos cosas:
gl: A necesidade de reaccionar a tempo implica dúas cousas:

source: The tracker must be connected to a mailing list, such that every change to an issue, including its initial filing, causes a mail to go out describing what happened. This mailing list is usually different from the regular development list, since not all developers may want to receive automated bug mails, but (just as with commit mails) the Reply-to header should be set to the development mailing list.
es: El sistema de seguimiento debe conectarse a la lista de correos de manera que cada cambio a una entrada, incluyendo su redacción inicial, genere un correo describiendo lo sucedido. Esta lista de correos es, a veces, diferente de la lista de desarrollo ya que quizás, no todos los desarrolladores quieran recibir correos automáticos con fallos, pero (al igual que con los correos con cambios) la cabecera Reply-to debe ser fijada a la lista de desarrollo.
gl: O xestor debe estar conectado a unha lista de correo, de xeito que cada mudanza sobre un asunto, incluíndo a súa notificación inicial, debe producir unha mensaxe de correo que describa o que aconteceu. Esta lista de correo é xeralmente distinta da de desenvolvemento, xa que non todos os desenvolvedores poden querer recibir mensaxes automatizadas referidas a erros, mais (igual que nas mensaxes de inserción de cambios) o cabezallo "Reply-to" debería ser dirixido á lista xeral de desenvolvemento.

source: The form for filing issues should capture the reporter's email address, so she can be contacted for more information. (However, it should not <emphasis>require</emphasis> the reporter's email address, as some people prefer to report issues anonymously. See <xref linkend="anonymity"/><phrase output="printed"> later in this chapter</phrase> for more on the importance of anonymity.)
es: El formulario donde se rellena la entrada debe almacenar la dirección de correo electrónico de quien la reporta, de forma que pueda ser contactada para solicitar más información. (No obstante, no debe <emphasis>requerir</emphasis> la dirección ya que algunas personas prefieren realizar el reporte anónimamente. Más información sobre el anonimato en <xref linkend="anonymity"/><phrase output="printed"> a continuación en este capítulo</phrase>.
gl: O formulario de notificación de asuntos debería capturar o enderezo de correo do remitente, de xeito que poida ser contactado para pedirlle máis información. (Porén, non debería <emphasis>requerir</emphasis> ese enderezo, dado que hai xente que prefire notificar erros de xeito anónimo. Véxase <xref linkend="confidencialidade"/><phrase output="printed"> máis adiante neste capítulo</phrase> para ler información adicional sobre a importancia de poder manter o anonimato.)

source: Interaction with Mailing Lists
es: Interacción con las Lista de Correo
gl: Interacción con listas de correo

source: Make sure the bug tracker doesn't turn into a discussion forum. Although it is important to maintain a human presence in the bug tracker, it is not fundamentally suited to real-time discussion. Think of it rather as an archiver, a way to organize facts and references to other discussions, primarily those that take place on mailing lists.
es: Hay que asegurarse de que el gestor de fallos no se convierte en un foro de discusiones. Aunque es importante mantener una presencia humana en el gestor, no está preparado para discusiones en tiempo real. Hay que pensar en éste como un archivador, una forma de organizar hechos y referencias a otras discusiones, principalmente aquellas que suceden en las listas de correo.
gl: Asegúrate de que o xestor de erros non se convirte nun foro de discusión. Aínda que é importante manter a presencia humana no sistema, non está preparado para soportar discusións en tempo real. Máis ben debes pensar nel como un arquivador, un xeito de organizar feitos e referencias cara a outras discusións, basicamente aquelas que teñen lugar nas listas de correo.

source: There are two reasons to make this distinction. First, the bug tracker is more cumbersome to use than the mailing lists (or than real-time chat forums, for that matter). This is not because bug trackers have bad user interface design, it's just that their interfaces were designed for capturing and presenting discrete states, not free-flowing discussions. Second, not everyone who should be involved in discussing a given issue is necessarily watching the bug tracker. Part of good issue management (see <xref linkend="share-management"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>) is to make sure each issue is brought to the right peoples' attention, rather than requiring every developer to monitor all issues. In <xref linkend="bug-tracker-usage"/><phrase output="printed"> in <xref linkend="communications"/>,</phrase> we'll look at ways to make sure people don't accidentally siphon discussions out of appropriate forums and into the bug tracker.
es: Hay dos razones por las cuales es importante hacer esta distinción. Primero, el gestor de fallos es un sistema más engorroso que las lista de correo (o que salas de chat). Esto no es porque estén mal diseñados, es sólo que sus interfaces han sido diseñadas para capturar y presentar estados discretos, no discusiones. Segundo, no todo el mundo que este involucrado en una discusión sobre una entrada en particular, esta revisando el gestor de fallos frecuentemente. Parte de una buena gestión de fallos (más en <xref linkend="share-management"/><phrase output="printed"> en <xref linkend="managing-volunteers"/></phrase>) está en asegurarse de que cada problema es llevado a la atención de las personas indicadas en lugar de requerir que todos los desarrolladores monitoricen todos los problemas. En <xref linkend="bug-tracker-usage"/><phrase output="printed"> en <xref linkend="communications"/>,</phrase> veremos como asegurarnos de que la gente no desvíe accidentalmente las discusiones de los foros apropiados hacia el sistema de gestión de fallos.
gl: Hai dúas razóns para facer esta distinción. Primeiro, o xestor de erros e máis complicado de usar que as listas de correo (ou que os chats en tempo real). Isto non é así debido a que o xestor teña unha interface de usuario mal deseñada, senón a que as súas interfaces foron deseñadas para capturar e presentar estados discretos, non discusións libres. En segundo lugar, non todo o mundo que está a seguir unha determinada discusión sobre un asunto ten por que estar conectado ao xestor de erros. En parte a boa xestión de asuntos (véxase <xref linkend="xestión-compartida"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase>) ten a ver con asegurar que a información correcta está sendo posta a disposición da xente axeitada, máis que con pretender que todos os desenvolvedores estean pendentes de todos os asuntos. En <xref linkend="uso-do-xestor-de-erros"/><phrase output="printed"> en <xref linkend="comunicacións"/>,</phrase> veremos algunhas maneiras de asegurar que a xente non lance discusións fora dos foros apropiados e no xestor de erros.
