Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Second, expansion can be done in a more fine-grained manner. Generally, a committer in area X who wants to expand to area Y will start posting patches against Y and asking for review. If someone who already has commit access to area Y sees such a patch and approves of it, they can just tell the submitter to commit the change directly (mentioning the reviewer/approver's name in the log message, of course). That way, the commit will come from the person who actually wrote the change, which is preferable from both an information management standpoint and from a crediting standpoint.
es: Segundo, la expansión se puede filtrar mejor, ya que generalmente, quienes realizan cambios en el área X y desean expandirse al área Y sólo tienen que empezar a enviar sus cambios contra Y y solicitar su revisión. Si alguien con acceso a cambios al área Y recibe alguno de estos parches y lo aprueba, puede pedir que el cambio sea enviado directamente (mencionando el nombre de quien ha revisado/aprobado el cambio en el mensaje de registro). De esta manera, el commit vendrá de quien ha hecho el cambio, lo cual es preferible desde un punto de vista administrativo y de credibilidad.
gl: Segundo, a expansión pode ser feita dun xeito máis granular. Xeralmente, un desenvolvedor da área X que queira expandir o seu interese á área Y, comezará a publicar aportamentos a Y e solicitar que sexan revisadas. Se alguén que xa tiña privilexios de acceso a Y ve unha das mencionados aportamentos e a aproba, simplemente poden indicarlle ao desenvolvedor que incorpore a mudanza directamente ao repositorio (mencionando o nome do revisor na mensaxe de rexistro ,por suposto). Así, a incorporación da mudanza vai ser feita por quen escribiu a mudanza, o que é máis axeitado tanto desde o punto de vista da xestión da información como desde o da acreditación de autorías.

source: Last, and perhaps most important, using the honor system encourages an atmosphere of trust and mutual respect. Giving someone commit access to a subdomain is a statement about their technical preparedness&mdash;it says: "We see you have expertise to make commits in a certain domain, so go for it." But imposing strict authorization controls says: "Not only are we asserting a limit on your expertise, we're also a bit suspicious about your <emphasis>intentions</emphasis>." That's not the sort of statement you want to make if you can avoid it. Bringing someone into the project as a committer is an opportunity to initiate them into a circle of mutual trust. A good way to do that is to give them more power than they're supposed to use, then inform them that it's up to them to stay within the stated limits.
es: Por último, y quizás la razón más importante, al utilizar un sistema basado en el honor, se crea una atmósfera de confianza y respeto mutuo. Al darle a alguien permiso para enviar cambio a un subdominio se hace una declaración acerca de su preparación técnica&mdash;la cual dice: "Hemos visto que tienes la capacidad para realizar cambios en cierto dominio, así que a por ello". Pero imponer controles estrictos en las autorizaciones dice: "No sólo estamos juzgando tus limitadas capacidades, sino que también sospechamos de tus <emphasis>intenciones</emphasis>." Este no es el tipo de declaraciones que se desean hacer si pueden ser evitadas. Incluir a alguien dentro del grupo de desarrolladores del proyecto es una oportunidad de iniciarlos en un circulo de confianza mutua. Una buena manera de hacer esto es dar más poder del que se supone deben tener e informarles que es su responsabilidad mantenerse dentro de los límites impuestos.
gl: Por último, e pode que sexa o máis importante, empregar un sistema meritocrático crea unha atmosfera de confianza e respecto mutuos. Darlle a alguén acceso a un subdominio é unha manifestación acerca da súa preparación técnica&mdash;é como dicir: "Ei!, xa vemos que tes experiencia como para incorporar mudanzas neste dominio, así que adiante". Pola contra, establecer un sistema moi estrito de control de accesos é como dicir: "Non só estamos poñendo en dúbida a túa experiencia, tamén temos sospeitas sobre as túas <emphasis>intencións</emphasis>." E ese é o tipo de frases que non che gustaría empregar , se é que podes evitalo. Incorporar alguén ao proxecto como desenvolvedor é unha oportunidade para inicialo no círculo de confianza mutua. Unha boa maneira de facelo é concederlle máis poder do que se lle supón que vai usar, e despois informarlles que está nas súas mans manterse dentro dos límites acordados.

source: The Subversion project has operated on the honor system way for more than four years, with 33 full and 43 partial committers as of this writing. The only distinction the system actually enforces is between committers and non-committers; further subdivisions are maintained solely by humans. Yet we've never had a problem with someone deliberately committing outside their domain. Once or twice there's been an innocent misunderstanding about the extent of someone's commit privileges, but it's always been resolved quickly and amiably.
es: El proyecto Subversion ha operado bajo este sistema por más de cuatro años, con 33 desarrolladores con privilegios completos y 43 con privilegios parciales. La única distinción que el sistema fuerza esta entre quienes envían cambios y quienes no, otras divisiones son mantenidas sólo por humanos. Incluso así, nunca hemos tenido ningún problema con que alguien realice un cambio deliberado fuera de su dominio. Una que otra vez han habido inocentes mal entendidos sobre la extensión de los privilegios de alguna persona, pero siempre es resuelto rápida y amigablemente.
gl: O proxecto Subversion vén traballando co sistema meirotcrático desde hai máis de catro anos, con 33 colaboradores sobre a totalidade do proxecto e 43 sobre partes do mesmo cando foi escrita a presente obra. A única distinción que o sistema mantén realmente por si mesmo é entre quen pode subir mudanzas e quen non; as restantes divisións son mantidas exclusivamente por humanos. A día de hoxe non tivemos ningún problema con alguén que pretendera incorporar mudanzas fóra do seu dominio deliberadamente. Unha vez ou dúas houbo algunha falta de entendemento acerca de ata onde chegan exactamente os privilexios de alguén, mais sempre foron resoltas rápida e amigablemente.

source: Obviously, in situations where self-policing is impractical, you must rely on hard authorization controls. But such situations are rare. Even when there are millions of lines of code and hundreds or thousands of developers, a commit to any given code module should still be reviewed by those who work on that module, and they can recognize if someone committed there who wasn't supposed to. If regular commit review <emphasis>isn't</emphasis> happening, then the project has bigger problems to deal with than the authorization system anyway.
es: Obviamente, en situaciones donde esto es poco práctico se debe depender en controles estrictos en las autorizaciones, pero dadas situaciones son raras. Incluso cuando hay millones de lineas de código y ciento o miles de desarrolladores, un commit hecho a cualquier módulo del código sigue siendo revisado por quienes trabajan en dicho módulo y son quienes pueden reconocer si quien lo ha intentado hacer puede hacerlo. Si una revisión regular no está sucediendo entonces el proyecto tiene problemas más importantes con los cuales lidiar que el sistema de autorizaciones.
gl: Obviamente, en situacións nas que o autocontrol non é práctico, deberás establecer controis de autenticación severos. Mais estas situacións son pouco frecuentes. Mesmo cando se está a falar de millóns de liñas de código e centos ou milleiros de desenvolvedores, a incorporación dunha mudanza a un módulo de código concreto debería ser revisada por quen traballa nese módulo preciso, e son eles quen poden recoñecer se alguén que non debería está a enviar mudanzas. Se a revisión regular de mudanzas a incorporar <emphasis>non</emphasis> está a funcionar axeitadamente, entón é que o proxecto ten problemas máis importantes que resolver que os relativos ao sistema de autenticacións.

source: In summary, don't spend too much time fiddling with the version control authorization system, unless you have a specific reason to. It usually won't bring much tangible benefit, and there are advantages to relying on human controls instead.
es: Para concluir, no hace falta pasar mucho tiempo con las autorizaciones del sistema de control de versiones a menos que se tenga una razón en específico. Usualmente esto no trae beneficios tangibles y confiar en el control humano tiene sus ventajas.
gl: En resumo, non pases moito tempo chafullando no sistema de autenticación do control de versións, non sendo que teñas unha razón específica para facelo. Xeralmente non vai producir ningún beneficio tanxible e, porén, atoparás moitas vantaxes en deixar o control en mans dos humanos.

source: None of this should be taken to mean that the restrictions themselves are unimportant, of course. It would be bad for a project to encourage people to commit in areas where they're not qualified. Furthermore, in many projects, full (unrestricted) commit access has a special status: it implies voting rights on project-wide questions. This political aspect of commit access is discussed more in <xref linkend="electorate"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase>.
es: Por supuesto que nada de esto significa que las restricciones mismas son poco importantes. Sería malo para un proyecto el animar a las personas a realizar cambios en áreas para las cuales no están cualificadas. Incluso en algunos proyectos, el acceso ilimitado tiene un status especial: implica derecho de voto en cuestiones que atañen al proyecto por completo. Este aspecto político del acceso es discutido en mayor profundidad en <xref linkend="electorate"/><phrase output="printed"> en <xref linkend="social-infrastructure"/></phrase>.
gl: Nada do que antecede debe ser tomado no sentido de que as restricións carecen de importancia en si mesmas, por suposto. Pode ser desastroso para un proxecto deixar que a xente incorpore mudanzas en áreas para as que non están cualificados. Aínda máis, en moitos proxectos, o acceso completo (sen restricións) responde a un status especial: implica gozar do dereito a votar en cuestións que afecten a calquera das partes do proxecto. Este aspecto político dos accesos á incorporación de mudanzas é discutido máis a fondo en <xref linkend="electorado"/><phrase output="printed"> e en <xref linkend="infrastrutura-social"/></phrase>.

source: Bug Tracker
es: Seguimiento de errores
gl: Xestor de erros (Bug Tracker)

source: Bug tracking is a broad topic; various aspects of it are discussed throughout this book. Here I'll try to concentrate mainly on setup and technical considerations, but to get to those, we have to start with a policy question: exactly what kind of information should be kept in a bug tracker?
es: El seguimiento de errores es un tema muy amplio y varios aspectos de este son discutidos a lo largo de este libro. Aquí intentare concentrarme principalmente en las consideraciones técnicas y en la instalación, pero para llegar a esto, debemos empezar con una política de preguntas: exactamente ¿qué tipo de información va a ser mantenida en el sistema de seguimiento?.
gl: A xestión de erros é unha cuestión moi ampla; varios dos aspectos que lle afectan son discutidos ao longo deste libro. Aquí eu vou tratar de concentrarme principalmente na súa configuración e máis en consideracións técnicas, mais antes de chegar a ese punto, temos que comezar cunha cuestión política: exactamente que información debe ser mantida nun xestor de erros?

source: The term <firstterm>bug tracker</firstterm> is misleading. Bug tracking systems are also frequently used to track new feature requests, one-time tasks, unsolicited patches&mdash;really anything that has distinct beginning and end states, with optional transition states in between, and that accrues information over its lifetime. For this reason, bug trackers are also called <firstterm>issue trackers</firstterm>, <firstterm>defect trackers</firstterm>, <firstterm>artifact trackers</firstterm>, <firstterm>request trackers</firstterm>, <firstterm>trouble ticket systems</firstterm>, etc. See <xref linkend="bug-trackers"/> for a list of software.
es: El término <firstterm>seguimiento de errores</firstterm> puede generar confusión ya que estos sistemas se utilizan frecuentemente para seguir solicitudes para nuevas características, tareas que se efectúan sólo una vez, parches no solicitados&mdash;en realidad se utilizan para cualquier cosa que pueda tener estados distinguibles de comienzo y final, con estados opcionales de transición entre estos y que acumulan información a lo largo de su existencia. Por esta razón, los sistemas de seguimiento de fallos también son llamados <firstterm>de seguimiento de temas</firstterm>, <firstterm>de defectos</firstterm>, <firstterm>de solicitudes</firstterm>, <firstterm>trouble ticket system</firstterm>, etc. Más información en <xref linkend="bug-trackers"/> donde hay una lista de programas.
gl: O termo <firstterm>bug tracker</firstterm> é confuso. Os sistemas de xestión de erros son usados frecuentemente para facer seguimento de requirimentos de novas características, tarefas unitarias, remendos non solicitados&mdash;en realidade calquera cousa que presenta distintos estados de inicio e de fin, con estados opcionais de transición no medio, o que fai incrementar a información asociada ao longo do tempo. Por esta razón os xestores de erros son tamén denominados <firstterm>xestores de asuntos (issue trackers)</firstterm>, <firstterm>xestores de defectos (defect trackers)</firstterm>, <firstterm>xestores de artefactos (artifact trackers)</firstterm>, <firstterm>xestores de requisitos (request trackers)</firstterm>, <firstterm>sitemas de tickets de errores (trouble ticket systems)</firstterm>, etc. Podes consultar unha lista de software en<xref linkend="bug-trackers"/>.

source: In this book, I'll continue to use "bug tracker" for the software that does the tracking, because that's what most people call it, but will use <firstterm>issue</firstterm> to refer to a single item in the bug tracker's database. This allows us to distinguish between the behavior or misbehavior that the user encountered (that is, the bug itself), and the tracker's <emphasis>record</emphasis> of the bug's discovery, diagnosis, and eventual resolution. Keep in mind that although most issues are about actual bugs, issues can be used to track other kinds of tasks too.
es: En este libro continuare utilizando "gestor de fallos" para la aplicación que hace el seguimiento, porque es así como la mayoría de la gente lo llama y utilizare <firstterm>issue</firstterm> al referirme a un punto en particular en la base de datos del gestor de fallos. Esto nos permitirá distinguir entre los buenos y malos comportamientos que el usuario se puede encontrar (el fallo en si mismo) y el <emphasis>registro</emphasis> en el gestor del descubrimiento, diagnostico y eventual resolución del fallo. Hay que recordar que aunque la mayoría de las entradas sean fallos, también pueden ser otras tareas.
gl: Neste libro, eu vou continuar a falar de "xestor de erros (bug tracker)" cando me refira ao software que fai o seguimento, xa que é así como a maioría da xente lle chama, mais vou empregar <firstterm>asunto (issue)</firstterm> para referirme a unha instancia individual na base de datos do xestor de erros. Isto vainos permitir distinguir entre o comportamento ou fallo que o usuario ten atopado (isto é, o error ou "bug" en sí mesmo), e os <emphasis>rexistros</emphasis> referidos ao descubrimento, diagnose e eventual resolución do erro. Ten en conta que aínda que moitos asuntos se refiren a erros reais, tamén poden referirse igualmente ao seguimento de outros tipos de tarefas.

source: The classic issue life cycle looks like this:
es: El clásico ciclo de vida se parece al siguiente:
gl: O clásico ciclo de vida dun asunto é semellante a:

source: Someone files the issue. They provide a summary, an initial description (including a reproduction recipe, if applicable; see <xref linkend="users-to-volunteers"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase> for how to encourage good bug reports), and whatever other information the tracker asks for. The person who files the issue may be totally unknown to the project&mdash;bug reports and feature requests are as likely to come from the user community as from the developers.
es: Alguien crea una entrada. Ofrecen un resumen, una descripción inicial (incluyendo como reproducir el fallo si es posible. En <xref linkend="users-to-volunteers"/><phrase output="printed"> en <xref linkend="managing-volunteers"/></phrase> hay ejemplos de como se puede animar la correcta creación de reportes de fallos) y cualquier otra información que el gestor solicite. Quien crea la entrada puede ser un desconocido al proyecto&mdash;los reportes de fallos y las solicitudes de características provienen tanto de los usuarios como de los desarrolladores.
gl: Alguén detecta o erro. Subministra un resumo, unha breve descrición do mesmo (incluíndo unha receita para reproducir o fallo, no seu caso; bótalle unha ollada a <xref linkend="de-usuarios-a-voluntarios"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase> para entenderes como se debe pedir á xente que faga bos informes de erros), así como calquera outra información que o xestor de erros pida. A persoa que detecta o asunto pode ser totalmente descoñecida para o proxecto&mdash;os informes sobre erros e o requirimento de novas funcionalidades terán as mesmas probabilidades de seren solicitados tanto por usuarios como polos desenvolvedores.

source: Once filed, the issue is in what's called an <firstterm>open</firstterm> state. Because no action has been taken yet, some trackers also label it as <firstterm>unverified</firstterm> and/or <firstterm>unstarted</firstterm>. It is not assigned to anyone; or, in some systems, it is assigned to a fake user to represent the lack of real assignation. At this point, it is in a holding area: the issue has been recorded, but not yet integrated into the project's consciousness.
es: Una vez enviada, la entrada entra en un estado llamado <firstterm>abierto</firstterm> porque ninguna acción ha sido tomada aun. Algunos gestores etiquetan las nuevas entradas como <firstterm>sin verificar</firstterm> o como <firstterm>sin iniciar</firstterm>. No está asignada a nadie, o en algunos sistemas, es asignada a un usuario fantasma que representa la falta de una asignación real. Llegado a este punto, la entrada se encuentra en el área de espera: ha sido registrada, pero aun no ha sido integrada en la conciencia del proyecto.
gl: Unha vez reportado, o asunto fica rexistrado no estado coñecido como <firstterm>aberto</firstterm>. Como de momento non se realizou ningunha operación sobre el, algúns xestores de erros o denominan <firstterm>non verificado</firstterm> e/ou <firstterm>sen iniciar</firstterm>. Non está aínda asignado a ninguén; ou, nalgúns xestores, se lle asigna a un usuario ficticio, o que vén a representar a ausencia de asignación. Neste punto, está nun espazo de espera: o asunto foi arquivado, mais aínda non está integrado na conciencia activa do proxecto.

source: Others read the issue, add comments to it, and perhaps ask the original filer for clarification on some points.
es: Otros leen la entrada, añaden comentarios y quizás soliciten el esclarecimiento de algunos puntos a quien realizo la entrada.
gl: Outra xente vai ler o asunto, engadirlle comentarios, e talvez preguntarlle ao remitente orixinal sobre detalles que clarifiquen algún punto escuro.

source: The bug gets <firstterm>reproduced</firstterm>. This may be the most important moment in its life cycle. Although the bug is not actually fixed yet, the fact that someone besides the original filer was able to make it happen proves that it is genuine, and, no less importantly, confirms to the original filer that they've contributed to the project by reporting a real bug.
es: El fallo es <firstterm>reproducido</firstterm>. Este puede que sea el momento más importante en su ciclo vital, ya que incluso que el fallo aun no ha sido resuelto, el hecho de que alguien haya podido reproducirlo además de quien creo la entrada prueba que es genuino y, no menos importante, confirma al creador de la entrada que ha contribuido al proyecto reportando un fallo real.
gl: O erro é entón <firstterm>reproducido</firstterm>. Este pode ser o momento máis importante no seu ciclo de vida. Aínda que o erro non está corrixido, o feito de que alguén ademais do remitente orixinal sexa quen de reproducilo vai demostrar que é auténtico, e , non menos importante, vai confirmar a quen o detectou por primeira vez que contribuíu ao proxecto cun erro real.

source: The bug gets <firstterm>diagnosed</firstterm>: its cause is identified, and if possible, the effort required to fix it is estimated. Make sure these things get recorded in the issue; if the person who diagnosed the bug suddenly has to step away from the project for a while (as can often happen with volunteer developers), someone else should be able to pick up where she left off.
es: El fallo es <firstterm>diagnosticado</firstterm>: su causa es identificada, y si es posible, es estimado el esfuerzo requerido para repararlo. Hay que asegurarse de que todo esto es registrado en la entrada, ya que en el case en que quien haya hecho el diagnostico abandona el proyecto (lo cual sucede a menudo con desarrolladores voluntarios), alguien más debe ser capaz de continuar con su trabajo.
gl: O erro é entón <firstterm>diagnosticado</firstterm>: identifícase a causa que o produce, e se for posible, estímase o esforzo requerido para corrixilo. Estes procesos deben ficar gravados no sistema; se a persoa que fai o diagnóstico desaparece repentinamente do proxecto por un tempo (o que vai suceder frecuentemente cos desenvolvedores voluntarios), calquera outro deberá ser quen de retomar a xestión do erro onde o outro o deixou.
