Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Some version control systems come with built-in repository-browsing mechanisms, while others rely on third-party tools to do it. Three such tools are <firstterm>ViewVC</firstterm> (<ulink url="http://viewvc.org/"></ulink>), <firstterm>CVSWeb</firstterm> (<ulink url="http://www.freebsd.org/projects/cvsweb.html"></ulink>), and <firstterm>WebSVN</firstterm> (<ulink url="http://websvn.tigris.org/"></ulink>). The first works with both CVS and Subversion, the second with CVS only, and the third with Subversion only.
es: Algunos sistemas de control de versiones incluyen un mecanismo que permite la navegación del repositorio, mientras que otros dependen de herramientas de terceros. Tres de estas herramientas son <firstterm>ViewCVS</firstterm> (<ulink url="http://viewcvs.sourceforge.net/"></ulink>), <firstterm>CVSWeb</firstterm> (<ulink url="http://www.freebsd.org/projects/cvsweb.html"></ulink>), and <firstterm>WebSVN</firstterm> (<ulink url="http://websvn.tigris.org/"></ulink>). La primera trabaja muy bien con CVS y con Subversion, la segunda sólo con CVS y la tercera sólo con Subversion.
gl: Algúns sistemas de control de versións incorporan mecanismos internos de navegación polo repositorio, mentres que outros empregan ferramentas de terceiros. Estas ferramentas son:<firstterm>ViewVC</firstterm> (<ulink url="http://viewvc.org/"></ulink>), <firstterm>CVSWeb</firstterm> (<ulink url="http://www.freebsd.org/projects/cvsweb.html"></ulink>), e <firstterm>WebSVN</firstterm> (<ulink url="http://websvn.tigris.org/"></ulink>). A primeira traballa sobre CVS e Subversion, a segunda só sobre CVS, e a terceira só sobre Subversion.

source: Commit emails
es: Correos de cambios
gl: Mensaxes de incorporación de mudanzas (Commit emails)

source: Every commit to the repository should generate an email showing who made the change, when they made it, what files and directories changed, and how they changed. The email should go to a special mailing list devoted to commit emails, separate from the mailing lists to which humans post. Developers and other interested parties should be encouraged to subscribe to the commits list, as it is the most effective way to keep up with what's happening in the project at the code level. Aside from the obvious technical benefits of peer review (see <xref linkend="code-review"/>), commit emails help create a sense of community, because they establish a shared environment in which people can react to events (commits) that they know are visible to others as well.
es: Cada commit al repositorio debería generar un correo electrónico mostrando quien ha hecho el cambio, cuando, cuales ficheros y directorios han cambiado y como. Este correo debe ser dirigido a una lista de correos separada de las listas a las que envían los humanos. Los desarrolladores y todos aquellos interesados deben ser animados para suscribirse a las lista de commits ya que es la manera más efectiva de mantenerse al día con lo que sucede en el proyecto al nivel del código. Aparte de los obvios beneficios técnicos de la revisión por la comunidad (<xref linkend="code-review"/>), los correos con los cambios ayudan a crear un sentido de comunidad porque establecen un ambiente compartido en el que la gente puede reaccionar ante diferentes eventos (commits) que saben son visibles a otros tambien.
gl: Toda incorporación de mudanzas ao repositorio (commit) debería xerar unha mensaxe na que conste quen fixo a mudanza, cando a fixo, que ficheiros e directorios mudou, e en que consistiron as mudanzas. A mensaxe debería ser enviada a unha lista de correo específica, distinta das empregadas para xestionar as mensaxes dos colaboradores. Deberíase recomendar aos desenvolvedores e outras persoas interesadas que se desen de alta na lista de mensaxes de mudanzas, xa que este é o modo máis efectivo de manter o coñecemento sobre que é o que se está a facer no proxecto a respecto do código. Para alén das evidentes vantaxes técnicas da revisión entre iguais (véxase <xref linkend="revisión-do-código"/>), as mensaxes de incorporación de mudanzas axudan a crear un espírito de comunidade, xa que dotan ao proxecto dun entorno común onde a xente pode reaccionar ante os eventos (incorporación de mudanzas) que saben que están visibles tamén para os demais.

source: The specifics of setting up commit emails will vary depending on your version control system, but usually there's a script or other packaged facility for doing it. If you're having trouble finding it, try looking for documentation on <firstterm>hooks</firstterm>, specifically a <firstterm>post-commit hook</firstterm>, also called the <firstterm>loginfo hook</firstterm> in CVS. Post-commit hooks are a general means of launching automated tasks in response to commits. The hook is triggered by an individual commit, is fed all the information about that commit, and is then free to use that information to do anything&mdash;for example, to send out an email.
es: La configuración específica para habilitar estos correos varia dependiendo de la versión del sistema de control de versiones pero a menudo existe un script o paquete que facilita esto. Si se tiene algún problema para encontrar estos, intente buscar en la documentación el tema relacionado con los <firstterm>hooks</firstterm>, específicamente el <firstterm>post-commit hook</firstterm>, también llamado <firstterm>loginfo hook</firstterm> en CVS. Los Post-commit hooks son tareas automatizadas que se ejecutan como respuesta a los cambios enviados (commits). El hook es ejecutado por un cambio individual, se rellena con la información acerca del cambio y luego es liberada esa información para ser utilizada como se desee&mdash;por ejemplo, para enviar un correo electrónico.
gl: As cuestións específicas sobre a configuración de mensaxes de incorporación de mudanzas varían dependendo de cal sexa o teu sistema de control de versións, mais xeralmente hai un script ou outra clase de utilidade para facelo. Se tiveres problemas para atopala, tenta buscar na documentación por <firstterm>hooks</firstterm>, e especialmente <firstterm>post-commit hook</firstterm>, tamén chamado <firstterm>loginfo hook</firstterm> en CVS. Os "post-commit hooks" constitúen un modo xeral de lanzar tarefas automatizadas en resposta á incorporación de mudanzas. O "hook" dispárase ante a incorporación dunha mudanza en concreto, aliméntase da información acerca desa mudanza e é logo libre de usar esa información para realizar calquera outra operación&mdash; por exemplo, enviar un correo electrónico.

source: With pre-packaged commit email systems, you may want to modify some of the default behaviors:
es: Con los sistemas de correos con cambios ya listos para usar, quizás sea necesario modificar alguna de las siguientes conductas:
gl: No caso dos sistemas de envío de mensaxes de actualización pre-empacotados, talvez queiras modificar algúns dos comportamentos por defecto:

source: Some commit mailers don't include the actual diffs in the email, but instead provide a URL to view the change on the web using the repository browsing system. While it's good to provide the URL, so the change can be referred to later, it is also <emphasis>very</emphasis> important that the commit email include the diffs themselves. Reading email is already part of people's routine, so if the content of the change is visible right there in the commit email, developers will review the commit on the spot, without leaving their mail reader. If they have to click on a URL to review the change, most won't do it, because that requires a new action instead of a continuation of what they were already doing. Furthermore, if the reviewer wants to ask something about the change, it's vastly easier to hit reply-with-text and simply annotate the quoted diff than it is to visit a web page and laboriously cut-and-paste parts of the diff from web browser to email client.
es: Algunos de estos sistemas no incluyen el diff en el correo que envían sino que enlazan con una URL para poder ver el cambio en la web utilizando el sistema de navegación del repositorio. Aunque esta bien dar una URL para que se pueda revisar el cambio luego, también es <emphasis>muy</emphasis> importante que el correo del commit incluya los diff. Leer el correo electrónico ya es parte de la rutina de la gente, así que si el contenido es visible allí mismo en el correo, los desarrolladores podrán revisar el commit en el mismo sitio sin la necesidad de abandonar sus clientes de correo. Si tienen que seguir un enlace a una página de revisiones, muchos no lo pulsarán, ya que esto requiere de una nueva acción en lugar de una continuación de lo que ya estaban haciendo. Por si fuera poco, si el lector desea preguntar algo acerca del cambio, es mucho más fácil responder al mensaje incluyendo el texto original y simplemente realizar anotaciones en el diff, en lugar de tener que visitar una página web y tomarse la molestia de copiar y pegar partes del diff en el navegador web al cliente de correo.
gl: Algúns destes sistemas non inclúen os "diff" no email, mais inclúen unha URL na que consultar as mudanzas no repositorio a través do navegador web. Aínda que achegar a URL está ben, de xeito que se pode facer referencia á mudanza máis tarde, é tamén <emphasis>moi</emphasis> importante que a mensaxe de envío da mudanza inclúa os propios diff. A lectura dos emails é parte da rutina da xente, así que se o contido das mudanzas é visible xusto no mesmo email de mudanzas, os desenvolvedores revisarán a mudanza sobre a marcha, sen abandonar o seu lector de emails. Se teñen que premer unha ligazón para poder revisalo, os máis non o farán, xa que isto require unha nova acción en troca da continuación do que xa estaban a facer. Aínda máis, se o revisor quere preguntar algo sobre a mudanza feita, é considerablemente máis sinxelo responder á mensaxe e incluír os comentarios sobre o rexistro de diferencias directamente sobre o propio texto do que é visitar a páxina web e cortar e colar partes do rexistro no cliente de email.

source: (Of course, if the diff is huge, such as when a large body of new code has been added to the repository, then it makes sense to omit the diff and offer only the URL. Most commit mailers can do this kind of limiting automatically. If yours can't, then it's still better to include diffs, and live with the occasional huge email, than to leave the diffs off entirely. Convenient reviewing and commenting is a cornerstone of cooperative development, much too important to do without.)
es: (Por supuesto que si el diff es gigantesco, como cuando una gran parte de código nuevo ha sido añadido al repositorio, entonces tiene sentido omitir la parte del diff y ofrecer sólo la URL. Muchos de los sistemas permiten hacen esto automáticamente. Si el utilizado en el proyecto no es capaz de hacer esto, entonces sigue siendo mejor incluir los diffs completos. La conveniencia de la revisión y los comentarios es una piedra angular del desarrollo cooperativo, algo demasiado importante para olvidar.)
gl: (Desde logo, se o reporte de diferencias é moi grande, como no caso de que se teña engadido ao repositorio un corpo de texto completamente novo, terá sentido omitir a información do "diff" e achegar tan só a URL. Os máis dos programas de envío de correos de actualización poden facer este tipo de discriminación automática. Se o teu non pode, o mellor será manter a inclusión dos "diff" e resignarse a sufrir mensaxes ocasionalmente enormes, que eliminalos por completo. A facilidade para facer revisións e comentarios é de vital importancia para o desenvolvemento colaborativo, demasiado para deixalos de lado)

source: The commit emails should set their Reply-to header to the regular development list, not the commit email list. That is, when someone reviews a commit and writes a response, their response should be automatically directed toward the human development list, where technical issues are normally discussed. There are a few reasons for this. First, you want to keep all technical discussion on one list, because that's where people expect it to happen, and because that way there's only one archive to search. Second, there might be interested parties not subscribed to the commit email list. Third, the commit email list advertises itself as a service for watching commits, not for watching commits <emphasis>and</emphasis> occasional technical discussions. Those who subscribed to the commit email list did not sign up for anything but commit emails; sending them other material via that list would violate an implicit contract. Fourth, people often write programs that read the commit email list and process the results (for display on a web page, for example). Those programs are prepared to handle consistently-formatted commit emails, but not inconsistent human-written mails.
es: Los correos con los cambios deben tener su cabecera Reply-To direccionada hacia la lista regular de desarrollo, no a la lista de los cambios, de esta manera cuando alguien revise un cambio y escriba una respuesta, esta debe ser dirigida automáticamente a la lista de desarrolladores, donde los temas técnicos son discutidos normalmente. Existen varias razones para esto, primero, se quiere mantener todas las discusiones técnicas en la lista, porque es allí donde la gente espera que sucedan y porque así ésta es la única lista que será necesario archivar. Segundo, puede que existan partes interesadas no suscritas a la lista de cambios. Tercero, la lista de cambios es publicitada como una lista para los commits y no como una lista para los commits y las discusiones técnicas ocasionadas. Quienes se han suscrito sólo a la lista de cambios, no se han suscrito a nada más que commits, al enviarles correos con material sin relación utilizando ésta vía, es una violación del contrato implícito. Cuarto, algunas personas escriben programas que procesan los correos con los cambios (para publicarlos en una página web, por ejemplo). Estos programas están preparados para manejar correos con un formato consistente y son incapaces de trabajar con correos escritos por humanos.
gl: Os correos de subida de mudanzas deberían ter o cabezallo "Reply-to" dirixido á lista normal de desenvolvemento, non á de mudanzas. É dicir, cando alguén revisa unha mudanza e remite un comentario á mesma, a súa resposta debería ser automaticamente encamiñada á lista dos desenvolvedores humanos, na que normalmente se discuten os asuntos técnicos. Hai unhas cantas razóns para facelo así. Primeiro, todas as discusións técnicas deben facerse nunha única lista xa que iso é o que a xente espera que ocorra, e porque dese xeito hai un só arquivo no que facer pesquisas. En segundo lugar, talvez haxa colaboradores que non estean subscritos á lista de mudanzas. Terceiro, a lista de correo de mudanzas se autopublicita como un servizo para facer seguimento das mudanzas, non para facer seguimento das mudanzas <emphasis>e</emphasis> de discusións técnicas ocasionais. Cando un se subscribe á lista de correo de mudanzas, non se está subscribindo ademais a ningunha outra lista; enviarlles outros materiais a través da lista violaría un contrato implícito. En cuarto lugar, a xente escribe frecuentemente pequenos programas que len a lista de mudanzas e procesan os resultados (de cara á súa publicación nunha páxina web, por exemplo). Eses programas están preparados para manipular mensaxes de correo-e formatadas de forma consistente, mais non mensaxes incoherentes escritas por humanos.

source: Note that this advice to set Reply-to does not contradict the recommendations in <xref linkend="reply-to"/><phrase output="printed"> earlier in this chapter</phrase>. It's always okay for the <emphasis>sender</emphasis> of a message to set Reply-to. In this case, the sender is the version control system itself, and it sets Reply-to in order to indicate that the appropriate place for replies is the development mailing list, not the commit list.
es: Hay que señalar que ésta recomendación no contradice las recomendaciones anteriores en <xref linkend="reply-to"/><phrase output="printed"></phrase>. Siempre esta bien que el remitente del mensaje configure la cabecera Reply-to. En este caso, el remitente es el sistema de control de versiones y su Reply-to lo configura de tal manera que indique que el lugar apropiado para responder es la lista de desarrollo y no la lista de cambios
gl: Ten en conta que esta recomendación acerca da configuración do cabezallo "Reply-to" non refuta o comentado anteriormente neste capítulo acerca do <xref linkend="reply-to"/><phrase output="printed"> </phrase>. Normalmente o <emphasis>remitente</emphasis> dunha mensaxe vai considerar correcto establecer o "Reply-to". Neste caso, o remitente é o propio sistema de control de versións, e configura o "Reply-to" para indicar que o lugar apropiado para responder ás súas mensaxes é a lista de desenvolvemento, non a de mudanzas.

source: CIA: Another Change Publication Mechanism
es: CIA: Otro mecanismo de publicación de cambios
gl: CIA: outro mecanismo de publicación de mudanzas (Another Change Publication Mechanism)

source: Commit emails are not the only way to propagate change news. Recently, another mechanism called CIA (<ulink url="http://cia.navi.cx/"></ulink>) has been developed. CIA is a real-time commit statistics aggregator and distributor. The most popular use of CIA is to send commit notifications to IRC channels, so that people logged into those channels see the commits happening in real time. Though of somewhat less technical utility than commit emails, since observers might or might not be around when a commit notice pops up in IRC, this technique is of immense <emphasis>social</emphasis> utility. People get the sense of being part of something alive and active, and feel that they can see progress being made right before their eyes.
es: Los correos con los cambios no son la única forma de propagar las noticias de los cambios. Recientemente, otro mecanismo llamado CIA (<ulink url="http://cia.navi.cx/"></ulink>) ha sido desarrollador. Este es un distribuidor y AGGREGATOR de estádisticas de cambios. El uso más popular de CIA es el de enviar notificaciones de los commits a un canal IRC de forma que las personas en el canal pueden ver los commits en tiempo real. Aunque es una utilidad menos técnica que los correos electrónicos, ya que los observadores puede que estén o no conectados cuando las alertas sobre nuevos cambios llegan al canal, esta técnica tiene una inmensa utilidad <emphasis>social</emphasis>. La gente tiene la sensación de pertenecer a algo vivo y activo, y siente que pueden ver el progreso que se está haciendo ante sus propios ojos.
gl: As mensaxes de mudanzas non son a única maneira de propagar as novas sobre as mudanzas feitas. Recentemente desenvolveuse un novo mecanismo denominado CIA (<ulink url="http://cia.navi.cx/"></ulink>). CIA é un agregador e distribuidor en tempo real de estatísticas sobre mudanzas. O uso máis popular de CIA é o de enviar notificacións de agregación de mudanzas a canais IRC, de xeito que a xente que está conectada a eses canais pode ver a incorporación das mudanzas en tempo real. Aínda que menos útil tecnicamente que as mensaxes de mudanzas, xa que os observadores poden estar conectados ao canal ou non cando aparece no IRC unha nova sobre unha mudanza, esta técnica ten unha inmensa utilidade <emphasis>social</emphasis>. A xente terá a sensación de formar parte de algo vivo e activo, e sentirá que se progresa xusto ante os seus ollos.

source: The way it works is that you invoke the CIA notifier program from your post-commit hook. The notifier formats the commit information into an XML message, and sends to a central server (typically <literal>cia.navi.cx</literal>). That server then distributes the commit information to other forums.
es: El programa de notificaciones del CIA es invocado por el post-commit hook, da formato al commit en un mensaje XML y lo envia al servidor central (por lo general <literal>cia.navi.cx</literal>). Este servidor luego distribuye la información a los otros foros.
gl: A maneira en que traballa consiste en que ti invocas o programa CIA de notificación desde o gancho (hook) do teu sistema de publicación de mudanzas. O notificador formata a XML a información da mudanza, e a envía como mensaxe a un servidor central (típicamente cia.navi.cx</literal>). A continuación, ese servidor distribúe a información sobre a mudanza a outros foros.

source: CIA can also be configured to send out <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html">RSS</ulink> feeds. See the documentation at <ulink url="http://cia.navi.cx/"></ulink> for details.
es: CIA también puede ser configurado para enviar <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html"> feeds RSS</ulink>. Más detalles en la documentación en <ulink url="http://cia.navi.cx/"></ulink>.
gl: CIA pode ser configurado tamén para enviar comunicacións <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html">RSS</ulink>. Podes consultar os detalles na documentación do proxecto en <ulink url="http://cia.navi.cx/"></ulink>.

source: To see an example of CIA in action, point your IRC client at <literal>irc.freenode.net</literal>, channel <literal>#commits</literal>.
es: Para ver un ejemplo de CIA en acción conectese a <literal>irc.freenode.net</literal>, y al canal <literal>#commits</literal>.
gl: Para ver un exemplo de CIA en acción, accede desde o teu cliente IRC a <literal>irc.freenode.net</literal>, channel <literal>#commits</literal>.

source: Use branches to avoid bottlenecks
es: Las ramas para evitar cuellos de botella
gl: Usa as ramas para evitar gargalos

source: Non-expert version control users are sometimes a bit afraid of branching and merging. This is probably a side effect of CVS's popularity: CVS's interface for branching and merging is somewhat counterintuitive, so many people have learned to avoid those operations entirely.
es: Los usuarios inexpertos del control de versiones pueden sentirse temerosos de crear ramas y uniones. Esto sea probablemente un efecto colateral de la popularidad de CVS: su interfaz de ramas y uniones puede ser poco intuitivo, así que muchas personas han aprendido a evitar estas operaciones por completo.
gl: Os usuarios non expertos dos sistemas de control de versións ás veces lle teñen un certo medo á creación de ramas (branching)e á posterior fusión (merging). Trátase probablemente dun efecto colateral da popularidade dos CVS: a súa interface de creación de ramas e fusión é pouco intuitiva, de xeito que moita xente aprendeu a evitar esas operacións por completo.

source: If you are among those people, resolve right now to conquer any fears you may have and take the time to learn how to do branching and merging. They are not difficult operations, once you get used to them, and they become increasingly important as a project acquires more developers.
es: Si se encuentra entre estas personas, decidase ahora mismo a conquistar cualquier miedo que pueda tener y tómese el tiempo de aprender cómo funcionan las ramas y las uniones. No son operaciones muy complicadas una vez que se acostumbra a ellas y se vuelven muy importantes mientras el proyecto adquiere más desarrolladores.
gl: Si ti es unha destas persoas, toma a decisión xa mesmo de superares eses medos e toma o tempo preciso para aprenderes como facer a creación de ramas e a fusión. Non son operacións difíciles, unha vez que estás afeito a elas, e convértense en máis e máis importantes segundo o proxecto vai incorporando máis desenvolvedores.
