Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: This is effective as far as it goes, and also involves very little administrative overhead, since it's usually just a matter of changing a setting in the mailing list software's configuration. But note that posts which aren't automatically approved must not be simply discarded. Instead, they should be passed along for moderation, for two reasons. First, you want to allow non-subscribers to post. A person with a question or suggestion should not need to subscribe to a mailing list just to make a single post there. Second, even subscribers may sometimes post from an address other than the one by which they're subscribed. Email addresses are not a reliable method of identifying people, and shouldn't be treated as such.
es: Esto es efectivo hasta cierto punto y necesita de poca administración ya que usualmente es sólo cuestión de cambiar algunos puntos en la configuración de la aplicación de listas. Hay que apuntar que aquellos mensajes que no son aprobados automáticamente no deben ser desechados. En su lugar, deben ser moderados por dos razones. Primero, se deben permitir mensajes de quienes no están suscritos. Alguna persona con una pregunta o sugerencia no debería tener que suscribirse a la lista para enviar un solo mensaje. Segundo, incluso quienes están suscritos envían mensajes desde cuentas diferentes de la que han utilizado para suscribirse. Las direcciones de correo electrónico no son un método eficaz para identificar a las personas y no debe ser utilizado para esto.
gl: Esta é unha medida efectiva cando está activa, e implica moi pouco traballo administrativo, xa que normalmente obriga a mudar tan só unha opción na configuración do software de xestión da lista. Mais tede en conta que as mensaxes que non son automaticamente aprobadas non deben ser simplemente descartadas. Pola contra, deben pasar a ser moderadas por dúas razóns. A primeira é que ides querer que os non subscritores poidan contribuír. Unha persoa que quere facer un comentario ou unha suxestión non debería ter que subscribirse tan só para enviar unha única mensaxe. En segundo lugar, mesmo os subscritores poden, en ocasións, enviar mensaxes desde enderezos distintos a aqueles cos que se cadastraron na lista. Os enderezos de correo electrónico no son un método fiable de identificación das persoas, e non deberían ser tratados como tales.

source: Filter posts through spam-filtering software.
es: Filtrar los mensajes utilizando un programa de filtro de spam.
gl: Filtraxe de mensaxes a través de software de control de spam.

source: If the mailing list software makes it possible (most do), you can have posts filtered by spam-filtering software. Automatic spam-filtering is not perfect, and never will be, since there is a never-ending arms race between spammers and filter writers. However, it can greatly reduce the amount of spam that gets through to the moderation queue, and since the longer that queue is the more time humans must spend examining it, any amount of automated filtering is beneficial.
es: Si la aplicación de listas de correo lo permite (la mayoría lo hace) se pueden filtrar los mensajes utilizando un filtro anti-spam. El filtrado automático de Spam no es perfecto, y nunca lo será, ya que existe un pulso sin fin entre los spammers y los escritores de filtros. A pesar de esto, se puede reducir enormemente la cantidad de Spam que llega a la cola de moderación y dado que mientras más larga sea ésta cola, se necesitaran más tiempo examinándola, así que cualquier filtrado automático es beneficioso.
gl: Se o software da lista de correo o permitir (os máis deles o fan), podedes facer que as mensaxes sexan controladas por unha aplicación de filtraxe de spam. A filtraxe automática de spam non é perfecta, e nunca o vai ser, xa que hai unha carreira inacabable entre os spammers e os escritores de filtros. Porén, pode reducir sensiblemente a cantidade de spam que atravesa a ringleira de moderación, e dado que canto máis longa é a ringleira máis tempo de dedicación require dos humanos, calquera cantidade de filtraxe automática resulta beneficiosa.

source: There is not space here for detailed instructions on setting up spam filters. You will have to consult your mailing list software's documentation for that (see <xref linkend="mailing-list-software"/><phrase output="printed"> later in this chapter</phrase>). List software often comes with some built-in spam prevention features, but you may want to add some third-party filters. I've had good experiences with these two: SpamAssassin (<ulink url="http://spamassassin.apache.org/"></ulink>) and SpamProbe (<ulink url="http://spamprobe.sourceforge.net/"></ulink>). This is not a comment on the many other open source spam filters out there, some of which are apparently also quite good. I just happen to have used those two myself and been satisfied with them.
es: No hay lugar suficiente para unas instrucciones detalladas sobre como configurar filtros de Spam. Habrá que consultar la documentación de la aplicación de listas de correo para esto (en <xref linkend="mailing-list-software"/><phrase output="printed"> más adelante en éste capítulo</phrase>). Las aplicaciones para listas vienen con características para la prevención de Spam, pero quizás sería una buena idea añadir una solución de un tercero. He tenido buenas experiencias con estas dos: SpamAssassin (<ulink url="http://spamassassin.apache.org/"></ulink>) y SpamProbe (<ulink url="http://spamprobe.sourceforge.net/"></ulink>). Esto no es una crítica contra otros filtros anti spam open source que al parecer son muy buenos también. Sucede que sólo he tenido la oportunidad de utilizar estos dos y estar satisfecho con ellos.
gl: Non temos espazo dabondo neste libro para transmitirvos instrucións detalladas sobre como configurar os filtros anti-spam. Teredes que consultar as instrucións do software da vosa lista (ver <xref linkend="software de listas de correo"/><phrase output="printed"> máis adiante neste capítulo</phrase>). O software de listas de correo inclúe frecuentemente algunha utilidade preconfigurada de prevención anti-spam, mais pode que vós queirades engadir algúns filtros de terceiros. Persoalmente teño boas experiencias con estes dous: SpamAssassin (<ulink url="http://spamassassin.apache.org/"></ulink>) e SpamProbe (<ulink url="http://spamprobe.sourceforge.net/"></ulink>). Isto non supón ningunha valoración de outros filtros anti-spam libres, algúns dos cales son aparentemente bastante bos. É só que eu usei os dous mencionados e quedei moi satisfeito con eles.

source: Moderation.
es: Moderación.
gl: Moderación.

source: For mails that aren't automatically allowed by virtue of being from a list subscriber, and which make it through the spam filtering software, if any, the last stage is <firstterm>moderation</firstterm>: the mail is routed to a special address, where a human examines it and confirms or rejects it.
es: Para aquellos correos que no son automáticamente aceptados por su virtud de ser enviados por un suscriptor a la lista y que pasan a través del filtro anti-spam, si es que lo hay, la ultima fase es la <firstterm>moderación</firstterm>: el correo es enrutado a una dirección especial, donde alguien lo examina y lo confirma o rechaza.
gl: Para aquelas mensaxes que non foren automaticamente autorizadas por procederen dun subscritor da lista, e que pasaren a través do software de filtraxe de spam, se for o caso, o último paso é o da <firstterm>moderación</firstterm>: a mensaxe é enviada a un enderezo especial, no que un individuo a examina e decide se é aprobada ou rexeitada.

source: Confirming a post takes one of two forms: you can accept the post just this once, or you can tell the list software to allow this and all future posts from the same sender. You almost always want to do the latter, in order to reduce the future moderation burden. Details on how to confirm vary from system to system, but it's usually a matter of replying to a special address with the command "accept" (meaning accept just this one post) or "allow" (allow this and future posts).
es: Confirmar un mensaje se puede hacer de dos formas: se puede aceptar el mensaje sólo una vez o se le puede indicar a la aplicación que acepte éste y todos los mensajes futuros de éste remitente. Casi siempre deseamos hacer lo último de manera que podamos reducir la carga futura en la moderación. Los detalles sobre como confirmar esto, varían entre sistemas pero usualmente es una cuestión de responder a una dirección en especial con el comando "aceptar" (lo que significa que sólo se aceptará éste mensaje) o "permitir" (permitir éste y todos los mensajes futuros).
gl: A aprobación dunha mensaxe pode facerse de dúas maneiras: pódese aceptar a mensaxe só por esta vez, ou podes dicirlle á lista que acepte esta e calquera outra mensaxe que no futuro proceda do mesmo remitente. As máis das veces é isto último o que se fai, xa que así se reduce a carga de traballo da moderación. Os detalles sobre como se fai varían de sistema a sistema, mais xeralmente consiste en responder a un determinado enderezo de correo coa mensaxe "aceptar" (o que quere dicir que se acepta tan só esta mensaxe) ou "permitir" (aprobando esta e outras mensaxes futuras).

source: Rejecting is usually done by simply ignoring the moderation mail. If the list software never receives confirmation that something is a valid post, then it won't pass that post on to the list, so simply dropping the moderation mail achieves the desired effect. Sometimes you also have the option of responding with a "reject" or "deny" command, to automatically disapprove future mails from the same sender without even running them through moderation. There is rarely any point doing this, since moderation is mostly about spam prevention, and spammers tend not to send from the same address twice anyway.
es: Rechazar un mensaje se hace simplemente ignorando el correo de moderación. Si la aplicación nunca recibe confirmación de que algo es un mensaje valido entonces no pasará a la lista, así que con solo ignorar el correo de moderación creará el efecto deseado. En algunos casos, existe la opción de responder con los comandos "rechazar" o "denegar" para que automáticamente se desaprueben los mensajes del remitente sin siquiera pasarlos por la moderación. Raramente existe una razón para hacer esto ya que la moderación es por lo general para prevenir el spam y los spammers no suelen utilizar una misma dirección dos veces.
gl: O rexeitamento faise xeralmente ignorando a mensaxe de moderación. Se o software da lista non dá recibido a confirmación de que algo é unha mensaxe válida, non a pasará á lista, así que o efecto desexado se produce se simplemente non se dá curso á mensaxe de moderación. Ás veces tamén tés a opción de responderes cos comandos "rexeitar" ou "denegar", para que ningunha mensaxe do mesmo remitente sexa aceptada no futuro, sen necesidade de sometelas a moderación. Xeralmente non ten moito sentido facer isto, xa que a moderación tenta controlar o spam, e os spammers moi raramente empregan dúas veces o mesmo enderezo.

source: Be sure to use moderation <emphasis>only</emphasis> for filtering out spams and clearly off-topic messages, such as when someone accidentally posts to the wrong mailing list. The moderation system will usually give you a way to respond directly to the sender, but don't use that method to answer questions that really belong on the mailing list itself, even if you know the answer off the top of your head. To do so would deprive the project's community of an accurate picture of what sorts of questions people are asking, and deprive them of a chance to answer questions themselves and/or see answers from others. Mailing list moderation is strictly about keeping the list free of junk and off-topic emails, nothing more.
es: Hay que asegurarse de que la moderación <emphasis>sólo</emphasis> se utiliza para filtrar el spam y mensajes fuera de contexto, como cuando alguien envía un correo a la lista equivocada. El sistema de moderación por lo general ofrece una manera de responder directamente al remitente pero es mejor no utilizarlo para responder a preguntas que realmente pertenecen a la lista, incluso si se sabe la respuesta inmediatamente. De hacer esto, se privaria a la comunidad del proyecto de una visión exacta de que tipo de preguntas la gente hace y privarlos de la oportunidad de responder ellos mismos a preguntas y/o ver las respuestas de otros. La moderación de las listas debe ser estrictamente para mantenerlas libres de basura y de correos fuera de contexto, nada más.
gl: Tede coidado de empregardes a moderación <emphasis>tan só</emphasis> para filtrardes o spam e as mensaxes claramente fóra de tópico, como cando alguén manda accidentalmente un correo á lista equivocada. O sistema de moderación adoita permitir a resposta directa ao remitente, mais non se debe usar este método para dar resposta a preguntas que en realidade entran no ámbito de actividade da propia lista, aínda que teñades absolutamente clara a resposta. Facer iso privaría á comunidade do coñecemento exacto acerca de que clase de preguntas fai a xente, e impediríalles responder por eles mesmos ou ver as respostas que outros poidan enviar. A moderación das listas de correo ten a ver exclusivamente con mantelas libres de correo lixo e mensaxes fóra de tópico, nada máis.

source: Address hiding in archives
es: Ocultar las direcciones en los archivos
gl: Ocultación de enderezos nos arquivos

source: To prevent your mailing lists from being a source of addresses for spammers, a common technique is for the archives to obscure people's email addresses, for example by replacing
es: Para prevenir que los spammers utilicen las listas de correo como una fuente de direcciones, una técnica muy común es la de ocultar las direcciones de correo de la gente en el registro, reemplazándolas como por ejemplo:
gl: Para evitares que as túas listas de correo se convertan nunha fonte de subministro de enderezos para os spammers, unha técnica habitual é a de que os arquivos oculten os enderezos da xente, por exemplo substituíndo

source: <blockquote> <para><literal>jrandom@somedomain.com</literal></para> </blockquote> <para>with</para> <blockquote> <para><literal>jrandom_AT_somedomain.com</literal></para> </blockquote> <para>or</para> <blockquote> <para><literal>jrandomNOSPAM@somedomain.com</literal></para> </blockquote>
es: <blockquote> <para><literal>jrandom@somedomain.com</literal></para> </blockquote> <para>por</para> <blockquote> <para><literal>jrandom_AT_somedomain.com</literal></para> </blockquote> <para>o</para> <blockquote> <para><literal>jrandomNOSPAM@somedomain.com</literal></para> </blockquote>
gl: <blockquote> <para><literal>jrandom@somedomain.com</literal></para> </blockquote> <para>por</para> <blockquote> <para><literal>jrandom_AT_somedomain.com</literal></para> </blockquote> <para>ou</para> <blockquote> <para><literal>jrandomNOSPAM@somedomain.com</literal></para> </blockquote>

source: or some similarly obvious (to a human) encoding. Since spam address harvesters often work by crawling through web pages&mdash;including your mailing list's online archives&mdash;and looking for sequences containing "@", encoding the addresses is a way of making people's email addresses invisible or useless to spammers. This does nothing to prevent spam from being sent to the mailing list itself, of course, but it does avoid increasing the amount of spam sent directly to list users' personal addresses.
es: o algo similar igual de obvio (para un humano). Ya que los recolectores de direcciones por lo general funcionan reptando por paginas web&mdash;incluyendo el archivo de nuestra lista de correo&mdash; y buscando secuencias conteniendo "@", modificar las direcciones es una forma para que sean invisibles o inútiles para los spammers. Esto no hace nada para prevenir que se envié spam desde la lista, por supuesto, pero si evita que se incremente la cantidad de spam enviado directamente a las cuentas personales de los usuarios de la lista.
gl: ou algunha maneira igualmente obvia (para os humanos) de codificalas. Dado que os colleitadores de enderezos para spam funcionan frecuentemente uliscando nas páxinas web&mdash;incluíndo os arquivos web da túa lista de correo&mdash;e buscando secuencias que conteñan "@", codificar os enderezos é a maneira de tornalos inútiles ou invisibles para os spammers. Por suposto que isto non evita que o spam sexa enviado directamente á propia lista, mais si que minimiza a cantidade de lixo que chega aos enderezos persoais dos membros da lista.

source: Address hiding can be controversial. Some people like it a lot, and will be surprised if your archives don't do it automatically. Other people think it's too much of an inconvenience (because humans also have to translate the addresses back before using them). Sometimes people assert that it's ineffective, because a harvester could in theory compensate for any consistent encoding pattern. However, note that there is empirical evidence that address hiding <emphasis>is</emphasis> effective, see <ulink url="http://www.cdt.org/speech/spam/030319spamreport.shtml"></ulink>.
es: Ocultar las direcciones puede ser algo controversial. A algunas personas les puede gustar mucho y se sorprenderán si el registro no lo hace automáticamente. Otras pueden pensar que es demasiado inconveniente (porque los humanos también tenemos que traducir las direcciones antes de utilizarlas). Algunas veces las personas afirman que es inefectivo, porque los recolectores en teoría pueden compensar cualquier patrón de modificación consistente. No obstante, hay que señalar que existe evidencia empírica de que ocultar las direcciones <emphasis>es</emphasis> efectivo, como se puede ver en <ulink url="http://www.cdt.org/speech/spam/030319spamreport.shtml"></ulink>.
gl: A ocultación de enderezos pode ser discutida. Gústalle moito a algunha xente , que se sorprenderá se os teus arquivos non o fan de maneira automática. Outra xente, pola contra, pensará que é unha incomodidade (xa ques as persoas terán tamén que traducir os enderezos antes de poder usalos). e hai xente que afirma que é unha práctica inútil, xa que un colleitador podería, en teoría, compensar calquera padrón de codificación. En calquera caso, hai evidencia empírica dabondo de que a ocultación de enderezos <emphasis>é</emphasis> efectiva, consulta <ulink url="http://www.cdt.org/speech/spam/030319spamreport.shtml"></ulink>.

source: Ideally, the list management software would leave the choice up to each individual subscriber, either through a special yes/no header or a setting in that subscriber's list account preferences. However, I don't know of any software which offers per-subscriber or per-post choice in the matter, so for now the list manager must make a decision for everyone (assuming the archiver offers the feature at all, which is not always the case). I lean very mildly toward turning address hiding on. Some people are very careful to avoid posting their email addresses on web pages or anywhere else a spam harvester might see it, and they would be disappointed to have all that care thrown away by a mailing list archive; meanwhile, the inconvenience address hiding imposes on archive users is very slight, since it's trivial to transform an obscured address back to a valid one if you need to reach the person. But keep in mind that, in the end, it's still an arms race: by the time you read this, harvesters might well have evolved to the point where they can recognize most common forms of hiding, and we'll have to think of something else.
es: Lo ideal sería que la aplicación administrativa de la lista diese la posibilidad de escoger a cada individuo, utilizando una cabecera si/no especial o configurándolo en las preferencias de la cuenta del suscriptor. Sin embargo, no conozco ninguna aplicación que permita hacer esto para cada suscriptor o para cada mensaje, así que por ahora el administrador de la lista debe tomar la decisión en nombre de todos (asumiendo que el archivador ofrece ésta característica, lo cual no es siempre así). Yo me inclino ligeramente hacia ocultar las direcciones. Algunas personas son muy cuidadosas para evitar enviar sus direcciones de correo electrónico en paginas web o en cualquier lugar donde un recolector de spam pueda verla, y podrían ser decepcionante que todo ese cuidado sea perdido gracias al registro de la lista de correo. Mientras tanto, la inconveniencia al ocultar las direcciones que impone en los usuarios del registro es muy pequeña, dada la trivialidad de transformar las direcciones al formato correcto si se necesita contactar con esa persona. Pero hay que seguir pensando en que, al final, sigue siendo una lucha sin fin: para cuando haya leído esto, los recolectores podrían haber evolucionado hasta el punto de reconocer la mayoría de formas comúnmente utilizadas para ocultar y tendremos que pensar en algo más.
gl: Idealmente, o software de xestión da lista debería deixar a escolla en mans de cada subscritor, ben mediante un cabezallo especial tipo "Si/Non" ou cunha opción de configuración nas preferencias da conta da lista de ese subscritor en particular. Porén, non coñezo ningún software que ofreza esa opción para cada subscritor ou para cada mensaxe, así que polo de agora será o xestor da lista quen teña que tomar a decisión por todos (dando por sentado que o arquivo ofrece esa utilidade, o que non sempre é así) Eu inclínome lixeiramente cara a que a ocultación de enderezos estea activada. Algunhas persoas poñen moito coidado en non publicar os seus enderezos en páxinas web ou en calquera outro sitio onde un colleitador de spam poida localizalos, e sentiríanse moi incómodos se esa precaución fose tirada ao lixo por un arquivo de listas de correo; mentres tanto, o inconveniente que supón a ocultación de enderezos para as persoas é moi pouco importante, xa que a transformación de un enderezo oculto nun utilizable é trivial no caso de que precisares acceder á persoa en cuestión. Pero non esquezas que, ao final, non deixa de ser unha carreira armamentística: para cando leas isto, os colleitadores poden perfectamente ter evolucionado ata o punto de seren quen de recoñecer as formas máis habituais de ocultación, e teremos que empezar a pensar noutra solución.

source: Identification and Header Management
es: Identificación y Administración de cabeceras
gl: Identificación e xestión de cabezallos
