Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Enables developers to manage code changes conveniently, including reverting and "change porting". Enables everyone to watch what's happening to the code.
es: Permite a los desarrolladores realizar cambios al código convenientemente, incluso retroceder y exportar cambios. Le permite a todos mirar lo que está sucediendo con el código.
gl: Permite aos desenvolvedores xestionaren convenientemente as mudanzas no código, incluíndo a reversión e o traslado de mudanzas ("change porting"). Permite tamén que todo o mundo saiba o que se está a facer co código.

source: Bug tracking
es: Gestión de fallos
gl: Seguimento de erros ("Bug Tracking")

source: Enables developers to keep track of what they're working on, coordinate with each other, and plan releases. Enables everyone to query the status of bugs and record information (e.g., reproduction recipes) about particular bugs. Can be used for tracking not only bugs, but also tasks, releases, new features, etc.
es: Permite a los desarrolladores mantener un registro de en qué están trabajando, coordinandose entre ellos y planear lanzamientos. Permite que todo el mundo pueda realizar búsquedas acerca del estado de los fallos y registrar información (p.e. recetas reproducibles) acerca de fallos en particular. Puede ser utilizado para seguir no solo fallos, sino también lanzamientos, tareas, nuevas características,etc.
gl: Permite aos desenvolvedores manteren o control sobre aquilo no que están a traballar, coordinárense cos demais e planificaren as publicacións de novas versións. Permite que todos os colaboradores poidan facer consultas sobre o estado en que se atopa a resolución de erros e gravar información (p.e.: procedementos de reprodución) sobre erros concretos. Pode ser usado non só para facer seguimento dos erros, senón tamén de tarefas, versións, novas funcionalidades, etc

source: Real-time chat
es: Chat en tiempo real
gl: Chat en tempo real (IRC)

source: A place for quick, lightweight discussions and question/answer exchanges. Not always archived completely.
es: Un sitio para discusiones rápidas, sencillas e intercambios de preguntas/respuestas. No siempre se archiva completamente.
gl: É o lugar onde se celebran discusións rápidas e pouco transcendentes e se fan intercambios de preguntas/respostas. Non sempre se arquivan completamente.

source: Each tool in this set addresses a distinct need, but their functions are also interrelated, and the tools must be made to work together. Below we will examine how they can do so, and more importantly, how to get people to use them. The web site is not discussed until the end, since it acts more as glue for the other components than as a tool unto itself.
es: Cada una de estas herramientas está dirigida a distintas necesidades, pero sus funciones están también interrelacionadas y se debe hacer que estas herramientas trabajen en conjunto. Más abajo examinaremos como podemos lograr esto y más importante aun como hacer que las personas se acostumbren a usarlas. El sitio web no se discute hasta el final, ya que actúa más como un pegamento para otros componentes que como una herramienta en sí.
gl: Cada ferramenta das descritas aborda unha necesidade concreta, mais as súas funcións están inter-relacionadas, e deben estar configuradas de xeito que poidan traballar conxuntamente. Máis adiante examinaremos como facer iso e, máis importante, como conseguir que a xente as empregue. O sitio web non se trata ata o final, dado que actúa máis como aglomerante dos demais compoñentes que como unha ferramenta en si mesma.

source: You may be able to avoid a lot of the headache of choosing and configuring these tools by using a <firstterm>canned hosting</firstterm> site: a server that offers prepackaged, templatized web areas with all the accompanying tools needed to run a free software project. See <xref linkend="canned-hosting"/><phrase output="printed"> later in this chapter</phrase> for a discussion of the advantages and disadvantages of canned hosting.
es: Se pueden evitar muchos dolores de cabeza por escoger y configurar estas herramientas si en su lugar utilizamos un <firstterm>hosting enlatado </firstterm>: un servicio que ofrece todas las herramientas necesarias para un proyecto open source ya listas para su uso gracias a plantillas y empaquetado. Más en <xref linkend="canned-hosting"/><phrase output="printed"> a continuación en éste mismo capítulo</phrase> para una discusión más profunda acerca de ventajas y desventajas de estas soluciones.
gl: Podedes evitar moitas das dores de cabeza derivadas da selección e configuración destas ferramentas empregando un sitio web do tipo<firstterm>canned hosting (aloxamento enlatado)</firstterm>: un servidor que ofrece áreas web preempacotadas e regularizadas que conteñen todas as ferramentas necesarias para manexar un proxecto de software libre. Podedes consultar o apartado <xref linkend="canned-hosting (aloxamento enlatado)"/><phrase output="printed"> máis adiante neste capítulo</phrase>, no que se discute sobre as vantaxes e desvantaxes deste tipo de sitios web.

source: Mailing Lists
es: Listas de correo
gl: Listas de Correo

source: Mailing lists are the bread and butter of project communications. If a user is exposed to any forum besides the web pages, it is most likely to be one of the project's mailing lists. But before they experience the mailing list itself, they will experience the mailing list interface&mdash;that is, the mechanism by which they join ("subscribe to") the list. This brings us to Rule #1 of mailing lists:
es: Las listas de correo son el pan y la mantequilla de las comunicaciones del proyecto. Si algún usuario es expuesto a algún foro aparte de las paginas web, probablemente sea la lista de correos del proyecto. Pero antes de trabajar con las listas en si mismas, deben tomar experiencia con la interfaz&mdash;esto es, el mecanismo por el cual se pueden unir ("suscribirse a") a la lista. Esto nos brinda la regla número uno de las listas de correo:
gl: As listas de correo son o pan e o sal das comunicacións nun proxecto. Se un usuario está exposto a un foro para alén das páxinas web, o máis probable é que se trate dunha das listas de correo do proxecto. Mais antes de chegar a usar as listas en si mesmas, primeiro terán que experimentar o uso das súas interfaces&mdash; é dicir, o mecanismo polo cal se subscriben ("suscribe to") á lista en cuestión. Isto nos leva á Regra nº1 das listas de correo:

source: Don't try to manage mailing lists by hand&mdash;get list management software.
es: No intentes dirigir las listas de correo a mano&mdash;consigue un software de manejo de listas.
gl: Non tratedes de xerir as listas de correo manualmente&mdash;empregade software de xestión de listas

source: It will be tempting to put this off. Setting up mailing list management software might seem like overkill at first. Managing small, low-traffic lists by hand will seem seductively easy: you just set up a subscription address that forwards to you, and when someone mails it, you add (or remove) their email address in some text file that holds all the addresses on the list. What could be simpler?
es: Será tentador dejar esto de lado. Configurar un software para listas de correo puede parecer demasiado difícil al principio. Manejar listas pequeñas de bajo tráfico a mano puede parecer seductor al principio: sólo hay que montar una lista de suscripción que te reenvía todo y cuando alguien envía un mensaje, se agrega (o elimina) su dirección de correo en algún tipo de fichero de texto que almacena todas las direcciones de la lista. ¿Qué podría ser más sencillo?
gl: Deixar esta regra de lado pode resultar tentador. Configurar software para a xestión das listas pode parecer excesivo. Xestionar listas pequenas, con pouco tráfego de mensaxes a man pode resultar sedutoramente sinxelo: simplemente creas un enderezo de subscrición encamiñado a ti, e cando alguén manda unha mensaxe a ela, ti engades (ou borras) o seu enderezo de email dun arquivo de texto que contén todos os enderezos da lista. Podería ser máis sinxelo?

source: The trick is that good mailing list management&mdash;which is what people have come to expect&mdash;is not simple at all. It's not just about subscribing and unsubscribing users when they request. It's also about moderating to prevent spam, offering the mailing list in digest versus message-by-message form, providing standard list and project information by means of auto-responders, and various other things. A human being monitoring a subscription address can supply only a bare minimum of functionality, and even then not as reliably and promptly as software could.
es: El truco está en hacer un buen manejo de las listas de correo&mdash;lo cual no es lo que la gente espera&mdash; no es nada sencillo. No es solo sobre suscribir y de suscribir usuarios cuando lo solicitan. También es sobre moderar para prevenir SPAM, ofrecer la lista resumida en lugar de mensaje por mensaje, proporcionar una lista estándar e información del proyecto a través de auto respuestas y muchas otras cosas. Un ser humano monitorizando las direcciones de suscripción es solo una pequeña parte del mínimo de funcionalidad e incluso así, no es la forma más segura y puntual que un software podría ofrecer.
gl: O truco está en que unha boa xestión da lista de correo&mdash;que é o que a xente espera&mdash;non é sinxela en absoluto. No se trata tan só de subscribir ou dar de baixa os usuarios cando o pediren. Ten tamén a ver con moderala, evitar o spam, ofertar a lista en formato de resumo de mensaxes ou nun formato que mostre todas as mensaxes, fornecer información estándar sobre a lista e o proxecto mediante mensaxes de resposta automática, e moitas outras cousas. Un ser humano que faga seguimento da lista de subscricións e baixas estará a fornecer tan só unha mínima parte das funcionalidades requiridas e, mesmo entón, non en forma tan segura e áxil como o faría o software.

source: Modern list management software usually offers at least the following features:
es: Un software para el manejo de listas de correo usualmente ofrece las siguientes características:
gl: O software de xestión de listas actual ofrece cando menos as seguintes utilidades:

source: Both email- and web-based subscription
es: Suscripción a través de correos o basada en web
gl: Subscrición tanto por email como a través dunha páxina web

source: When a user subscribes to a list, she should <emphasis>promptly</emphasis> get an automated welcome message in reply, telling her what she has subscribed to, how to interact further with the mailing list software, and (most importantly) how to unsubscribe. This automatic reply can be customized to contain project-specific information, of course, such as the project's web site, FAQ location, etc.
es: Cuando un usuario se suscribe a la lista, debería recibir una respuesta de bienvenida <emphasis>sin demora</emphasis>, explicándole como seguir interactuando con el software y (más importante) con eliminar la suscripción. Esta respuesta automática puede ser modificada para contener información específica del proyecto, por supuesto, como el sitio web, localización del FAQ, etc.
gl: Cando un usuario se subscribe a unha lista debería recibir <emphasis>inmediatamente</emphasis> unha mensaxe automática de benvida, dicíndolle a que se subscribiu, como interaxir en adiante co software de xestión da lista e (moi importante) como darse de baixa. Esta resposta automática pode ser personalizada para que conteña información especifica do proxecto, desde logo, tal como o enderezo da súa páxina web,a localización das FAQ (Frequently Asked Questions = Preguntas Respondidas Frecuentemente), etc

source: Subscription in either digest mode or message-by-message mode
es: Suscripción al modo de resúmenes o al modo de mensaje por mensaje
gl: Subscrición en modo "digest" (só resumos das mensaxes) ou en modo de mensaxes completas

source: In digest mode, the subscriber receives one email per day, containing all the list activity for that day. For people who are following a list loosely, without participating, digest mode is often preferable, because it allows them to scan all the subjects at once and avoid the distraction of emails coming in at random times.
es: En modo resumen, el suscriptor recibe un correo conteniendo toda la actividad de la lista en ese día. Para aquellos quienes desean seguir la lista indirectamente, sin participar, el modo resumen es a menudo el preferible, porque les permite revisar todos los temas a la vez y evitar las distracciones de los correos que llegan en momentos al azar.
gl: En modo digest, o subscritor recibe só.unha mensaxe por día coa totalidade da actividade da lista nese día. Para xente que está a seguir unha lista de xeito desligado, sen participar realmente na súa actividade, o modo digest acostuma ser o máis axeitado, xa que lle permite explorar a totalidade das materias tratadas dunha vez e evitar a distracción que supón que as mensaxes estean entrando de maneira aleatoria.

source: Moderation features
es: Características para la moderación
gl: Utilidades de moderación

source: To "moderate" is to check posts to make sure they are a)&nbsp;not&nbsp;spam, and b)&nbsp;on&nbsp;topic, before they go out to the entire list. Moderation necessarily involves humans, but software can do a lot to make it easier. There is more said about moderation later.
es: Moderar es revisar los mensajes para asegurar que: a)&nbsp;no&nbsp; es SPAM y b)&nbsp;en&nbsp;tema, antes de que lleguen a la lista. La moderación incluye necesariamente a seres humanos, pero el software puede hacer mucho para hacerlo más sencillo. Se discute más acerca de la moderación luego.
gl: "Moderar" consiste en controlar que as mensaxes entrantes:a)&nbsp;non son&nópico da bsp;spam, e b)&nbsp;se corresponden có&nbsp;tópico da lista, antes da súa distribución aos restantes usuarios da mesma. O feito de moderar as listas é unha tarefa tipicamente humana, mais o software pode contribuír enormemente a facela máis sinxela. Falaremos máis sobre a moderación máis adiante.

source: Administrative interface
es: Interfaz Administrativa
gl: Interface administrativa

source: Among other things, this enables an administrator to go in and remove obsolete addresses easily. This can become urgent when a recipient's address starts sending automatic "I am no longer at this address" replies back to the list in response to every list post. (Some mailing list software can even detect this by itself and unsubscribe the person automatically.)
es: Entre otras cosas, le permite a un administrador eliminar direcciones obsoletas fácilmente. Esto puede hacerse urgentemente cuando la dirección del receptor empieza a enviar respuestas automáticas del tipo "Ya no tengo ésta dirección de correo" a la lista en respuesta a cada mensaje. (Algunas aplicaciones para listas de correo pueden incluso detectar esto por si mismas y eliminar la suscripción de ésta persona automáticamente.)
gl: Entre outras cousas, permite ao administrador dar de baixa enderezos obsoletos de maneira sinxela. Isto pode ser urxente se o enderezo dun usuario comeza a emitir mensaxes automáticas do tipo "Non estou xa neste enderezo" en resposta a cada mensaxe enviada á lista. Algúns softwares de listas de correos poden mesmo detectar estas situacións por si mesmos e dar de baixa automaticamente á persoa en cuestión.

source: Header manipulation
es: Manipulación de las cabeceras
gl: Manipulación de cabezallos

source: Many people have sophisticated filtering and replying rules set up in their mail readers. Mailing list software can add and manipulate certain standard headers for these people to take advantage of (more details below).
es: Muchas personas tienen sofisticados filtros y reglas de respuestas configuradas en sus clientes de correo. Las aplicaciones de listas de correo pueden añadir y manipular ciertas cabeceras estándar de las que estas personas se puedan beneficiar (más detalles a continuación).
gl: Moita xente ten activadas no seu software de correo electrónico regras de filtraxe e de resposta realmente sofisticadas. O software de xestión de listas de correo pode engadir e manipular os cabezallos estándar para que esta xente se beneficie delas (algúns detalles máis adiante).

source: <term>Archiving</term>
es: <term>Archivo</term>
gl: <term>Arquivamento</term>

source: All posts to the managed lists are stored and made available on the web; alternatively, some mailing list software offers special interfaces for plugging in an external archiving tool such as MHonArc (<ulink url="http://www.mhonarc.org/"></ulink>). As <xref linkend="using-archives"/><phrase output="printed"> in <xref linkend="communications"/></phrase> discusses, archiving is crucial.
es: Todos los mensajes enviados a las listas son almacenados y hechos públicos en la web. Alternativamente, algunas aplicaciones de software para listas de correo ofrecen interfaces especiales para conectar alguna herramienta externa de archivo como MHonArc (<ulink url="http://www.mhonarc.org/"></ulink>). Al igual <xref linkend="using-archives"/><phrase output="printed"> en <xref linkend="communications"/></phrase> se discute que el archivo es crucial.
gl: Todas as mensaxes enviadas ás listas xestionadas son almacenadas e postas á disposición dos interesados na web; alternativamente, algúns softwares de listas de correo ofrecen interfaces especiais para enlazar ferramentas externas de arquivamento tales como MHonArc (<ulink url="http://www.mhonarc.org/"></ulink>). Como se comenta en <xref linkend="usando os arquivos"/><phrase output="printed"> en <xref linkend="comunicacións"/></phrase> , o arquivamento é unha tarefa crucial.

source: The point of all this is merely to emphasize that mailing list management is a complex problem that has been given a lot of thought, and mostly been solved. You certainly don't need to become an expert in it. But you should be aware that there's always room to learn more, and that list management will occupy your attention from time to time in the course of running a free software project. Below we'll examine a few of the most common mailing list configuration issues.
es: El objetivo de todo esto es sencillamente enfátizar que la administración de las listas de correo es un problema complejo sobre el cual se ha pensado mucho y que está casi resuelto. Ciertamente no es necesario convertirse en un experto, pero hay que reseñar que siempre hay lugar para el aprendizaje y que la administración de las listas ocupara algo de atención de vez en cuando durante la duración del proyecto. A continuación examinaremos algunos de los problemas más comunes que podemos encontrar al configurar las listas de correo.
gl: A intención de todos estes comentarios é salientar que a xestión das listas de correo é un problema complexo sobre o que se ten pensado moito, e que foi en grande medida solucionado. Certamente, vós non precisades tornarvos en expertos na materia. Mais deberiades saber que sempre hai máis sobre o que aprender, e que a xestión das listas vai ocupar a vosa atención de cando en vez ao longo da vida dun proxecto de software libre. Máis adiante examinaremos unhas poucas das cuestións máis frecuentes relativas á configuración das listas de correo.

source: Spam Prevention
es: Prevenir el Spam
gl: Prevención do spam

source: Between when this sentence is written and when it is published, the Internet-wide spam problem will probably double in severity&mdash;or at least it will feel that way. There was a time, not so long ago, when one could run a mailing list without taking any spam-prevention measures at all. The occasional stray post would still show up, but infrequently enough to be only a low-level annoyance. That era is gone forever. Today, a mailing list that takes no spam prevention measures will quickly be submerged in junk emails, to the point of unusability. Spam prevention is mandatory.
es: Entre el momento cuando ésta frase es escrita y cuando es publicada, el problema a lo largo y ancho de Internet el problema del Spam probablemente sea el doble de severo&mdash;o al menos parecerá que es así. Hubo una época, no mucho tiempo atrás, cuando se podía administrar una lista de correos sin la necesidad de tomar medidas para prevenir el Spam. Algún mensaje extraviado ocasional aparecía pero con tan poca frecuencia que solo era una molestia de bajo nivel. Esa época ya es historia. Hoy, las listas de correo que no toman medidas preventivas en contra del Spam se verá sumergida rápidamente en correo basura hasta el punto de ser inútil. Prevenir el Spam es una prioridad.
gl: Entre o momento en que esta frase foi escrita e aquel en que foi publicada, seguramente o problema do spam ten duplicado a súa severidade&mdash;ou cando menos se percibirá dese xeito. Houbo un tempo, non hai tanto, cando un podía pór en marcha unha lista de correo sen ter que tomar ningunha medida anti-spam. A mensaxe perniciosa ocasional podía certamente aparecer, mais de xeito tan pouco frecuente que se consideraba un inconveniente de baixo nivel. Ese tempo foise para sempre. Hoxe en día, unha lista de correo que non adopte ningunha precaución anti-spam verase rapidamente asolagada por correos lixo, ata o punto de se tornar inutilizable. A prevención anti-spam é polo tanto obrigatoria.

source: We divide spam prevention into two categories: preventing spam posts from appearing on your mailing lists, and preventing your mailing list from being a source of new email addresses for spammers' harvesters. The former is more important, so we examine it first.
es: La prevención de Spam se divide en dos categorías: prevenir que mensajes basura aparezcan en la lista y prevenir que la lista sea utilizada como fuente de nuevas direcciones de correo para los spammers. La primera es la más importante, así que la examinaremos primero.
gl: A prevención anti-spam pode ser dividida en dúas categorías: a que prevén que entren mensaxes spam na túa lista, e aquela que trata de evitar que a lista se converta nunha fonte de enderezos de correo electrónico para os spammers que as colleitan. A primeira é a máis importante, así que a analizaremos en primeiro lugar.

source: Filtering posts
es: Filtrado de los mensajes
gl: Filtraxe das mensaxes

source: There are three basic techniques for preventing spam posts, and most mailing list software offers all three. They are best used in tandem:
es: Existen tres técnicas básicas para prevenir mensajes basura y muchas aplicaciones para listas ofrecen las tres. Lo mejor es utilizarlas en tandem:
gl: Hai tres técnicas básicas para evitar a entrada de mensaxes lixo, e os máis dos software de listas fornecen as tres. Traballan mellor cando se usan en tándem:

source: Only auto-allow postings from list subscribers.
es: Sólo permitir automáticamente mensajes de los suscriptores a la lista.
gl: Soamente permitir automaticamente aquelas mensaxes enviadas á lista por subscritores.
