Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: Some bug trackers can monitor mailing lists and automatically log all emails that are about a known issue. Typically they do this by recognizing the issue's identifying number in the subject line of the mail, as part of a special string; developers learn to include these strings in their mails to attract the tracker's notice. The bug tracker may either save the entire email, or (even better) just record a link to the mail in the regular mailing list archive. Either way, this is a very useful feature; if your tracker has it, make sure both to turn it on and to remind people to take advantage of it.
es: Algunos gestores pueden monitorizar listas de correos y automáticamente registrar todos los correos que son acerca de un problema conocido. Por lo general, hacen esto reconociendo el número de identificación de la entrada en el asunto de los correos, como parte de una línea especial, así los desarrolladores pueden aprender a incluir estas lineas en sus correos para atraer la atención del gestor. El sistema puede guardar el correo completo o (incluso mejor) registrar un enlace al correo en el archivo regular de la lista de correos. De cualquier forma, ésta es una habilidad muy útil, así que si el sistema utilizado la aporta hay que utilizarla y hay que recordarle a la gente que la utilice.
gl: Algúns xestores de erros poden monitorizar as listas de correo e rexistrar automaticamente todas as mensaxes que teñen a ver cun asunto coñecido. Tipicamente fan isto mediante o recoñecemento do identificador do erro na liña de "asunto" das mensaxes para atraeren a atención do xestor. Este ou ben gardará toda a mensaxe, ou (aínda mellor) gravará unha ligazón á mensaxe gardada nos arquivos da lista de correo. En calquera caso, esta é unha característica moi útil; se o teu xestor dispón dela, asegúrate de activala e de recomendar á xente a súa utilización.

source: Pre-Filtering the Bug Tracker
es: Pre-filtrado del gestor de fallos
gl: Pre-filtrando o xestor de erros

source: Most issue databases eventually suffer from the same problem: a crushing load of duplicate or invalid issues filed by well-meaning but inexperienced or ill-informed users. The first step in combatting this trend is usually to put a prominent notice on the front page of the bug tracker, explaining how to tell if a bug is really a bug, how to search to see if it's already been filed, and finally, how to effectively report it if one still thinks it's a new bug.
es: Muchas de las bases de datos de fallos sufren eventualmente del mismo problema: una cantidad devastadora de fallos duplicados o inválidos hechos por usuarios bien intencionados pero sin experiencia o poco informados. El primer paso para combatir esta tendencia es, por lo general, colocar un vistoso aviso en la página principal del gestor de fallos, explicando como saber si un bug es realmente un bug, como buscar si el bug ya está incluido y finalmente, como reportar efectivamente si aun se cree que es un nuevo fallo.
gl: As máis das bases de datos de asuntos sofren de cando en vez o mesmo problema: unha cantidade crítica de asuntos duplicados ou inválidos procedentes de usuarios ben intencionados mais inexpertos ou mal informados. O primeiro paso para combater esta tendencia consiste en colgar un aviso ben visible na páxina de entrada ao xestor de erros no que se explique como saber se un erro é realmente un erro, como buscar se xa foi notificado e, finalmente, como facer correctamente a notificación se se segue a pensar que se trata realmente dun erro novo.

source: This will reduce the noise level for a while, but as the number of users increases, the problem will eventually come back. No individual user can be blamed for it. Each one is just trying to contribute to the project's well-being, and even if their first bug report isn't helpful, you still want to encourage them to stay involved and file better issues in the future. In the meantime, though, the project needs to keep the issue database as free of junk as possible.
es: Esto reducirá el nivel de ruido por un tiempo, pero mientras el número de usuarios vaya creciendo, el problema regresara eventualmente. Ningún individuo puede ser culpado de esto, ya que cada uno está intentando contribuir en beneficio del proyecto e incluso cuando su primer reporte no sea de verdadera utilidad, se desea animarlos para que continúen involucrándose y para que puedan hacer mejores reportes en el futuro. Mientras tanto, el proyecto necesita mantener en lo posible la base de datos libre de basura.
gl: Ese sistema reduciría o nivel de ruído por un tempo, mais segundo aumenta o número de usuarios, o problema vai retornar. Ningún usuario individual pode ser culpado diso. Cada un deles está pretendendo contribuír ao benestar do proxecto, e mesmo se a primeira notificación do erro non é útil, deberás continuar animándoos a permaneceren involucrados e a que fagan mellores contribucións no futuro. Mentres tanto, porén, o proxecto vai precisar manter a base de datos de asuntos o máis libre de lixo posible.

source: The two things that will do the most to prevent this problem are: making sure there are people watching the bug tracker who have enough knowledge to close issues as invalid or duplicates the moment they come in, and requiring (or strongly encouraging) users to confirm their bugs with other people before filing them in the tracker.
es: Las dos cosas que tendrán el máximo efecto a la hora de prevenir este problema son: asegurarnos de que hay gente vigilando el gestor de fallos quienes tienen el conocimiento suficiente para cerrar problemas como inválidos o duplicados mientras vayan llegando y requiriendo (o fomentando duramente) a los usuarios que confirme su reporte con otras personas antes de reportarlos en el gestor.
gl: As dúas cousas que mellor van contribuír a previr este problema son: estar seguro de que vai haber xente suficientemente capacitada controlando o que está a ocorrer no sistema de xestión de erros como para ser quen de pechar notificacións inválidas ou duplicadas no momento xusto en que entran, e requirir (ou recomendar fortemente) que os usuarios confirmen con outros usuarios os erros detectados por eles antes de reportalos ao sistema.

source: The first technique seems to be used universally. Even projects with huge issue databases (say, the Debian bug tracker at <ulink url="http://bugs.debian.org/"></ulink>, which contained 315,929 issues as of this writing) still arrange things so that <emphasis>someone</emphasis> sees each issue that comes in. It may be a different person depending on the category of the issue. For example, the Debian project is a collection of software packages, so Debian automatically routes each issue to the appropriate package maintainers. Of course, users can sometimes misidentify an issue's category, with the result that the issue is sent to the wrong person initially, who may then have to reroute it. However, the important thing is that the burden is still shared&mdash;whether the user guesses right or wrong when filing, issue watching is still distributed more or less evenly among the developers, so each issue is able to receive a timely response.
es: La primera técnica parece ser utilizada universalmente. Incluso proyectos con gigantescas bases de datos de fallos (digamos, el gestor de Debian en <ulink url="http://bugs.debian.org/"></ulink>, el cual contenía 315,929 reportes al momento de escribir este libro) siguen ordenando todo de tal manera que <emphasis>todos</emphasis> puedan ver los reportes mientras llegan. Puede que sea una persona diferente dependiendo de la categoría del problema. Por ejemplo, el proyecto Debian es una colección de paquetes de software, de manera que el proyecto automáticamente enruta cada reporte a la persona que mantiene el paquete específico. Por supuesto, a veces los usuarios no identifican bien la categoría a la que pertenece el problema, con el resultado de que el reporte es enviado a la persona equivocada, quien entonces deberá redireccionarlo. No obstante, lo importante es que la carga sigue siendo distribuida&mdash;cada vez que un usuario crea correcta o incorrectamente al reportar, la vigilancia de las entradas sigue siendo distribuida más o menos uniformemente entre los desarrolladores, de manera que cada reporte es respondido en un tiempo justo.
gl: Semella que a primeira das técnicas mencionadas está a ser usada universalmente. Mesmo proxectos con bases de datos inmensas (nomeadamente, o xestor de erros de Debian en <ulink url="http://bugs.debian.org/"></ulink>, que no momento de escribir este texto contiña 315.929 asuntos <footnote><para>N. do T.: máis de 500.000 no momento de facer esta tradución</para></footnote> aínda organizan as cousas de xeito que <emphasis>alguén</emphasis> ve os asuntos que van chegando ao sistema. Pode ser unha persoa diferente para cada categoría de asuntos. Por exemplo, o proxecto Debian é unha colección de pacotes de software, así que Debian encamiña automaticamente cada novo asunto aos mantedores do correspondente pacote. Por suposto, os usuarios poden ás veces trabucarse na identificación das categorías ás que corresponden os erros detectados, co resultado de que o erro é enviado inicialmente á persoa incorrecta, quen deberá encargarse de encamiñalo novamente. De calquera maneira, o importante é que a carga de traballo é compartida, de todos modos&mdash;se o usuario tiver dúbidas no momento de reportar un asunto, a vixilancia sobre a entrada de asuntos vai estar mellor ou peor distribuída entre os desenvolvedores, de xeito que cada asunto vai recibir sempre unha resposta a tempo.

source: The second technique is less widespread, probably because it's harder to automate. The essential idea is that every new issue gets "buddied" into the database. When a user thinks he's found a problem, he is asked to describe it on one of the mailing lists, or in an IRC channel, and get confirmation from someone that it is indeed a bug. Bringing in that second pair of eyes early can prevent a lot of spurious reports. Sometimes the second party is able to identify that the behavior is not a bug, or is fixed in recent releases. Or she may be familiar with the symptoms from a previous issue, and can prevent a duplicate filing by pointing the user to the older issue. Often it's enough just to ask the user "Did you search the bug tracker to see if it's already been reported?" Many people simply don't think of that, yet are happy to do the search once they know someone's <emphasis>expecting</emphasis> them to.
es: La segunda técnica esta menos extendida, probablemente sea porque es más difícil de automatizar. La idea esencial es que cada nuevo reporte es apadrinado hacia la base de datos. Cuando un usuario cree haber encontrado un bug, se le pide que lo describa en una de las listas de correo o en algún canal de IRC para que reciba confirmación de alguien de que en realidad es un fallo. Al introducir este segundo par de ojos puede prevenir muchos reportes falsos. A veces esta segunda persona puede identificar que este comportamiento no es un fallo o que ha sido resuelto recientemente. O puede que este familiarizado con los síntomas gracias a problemas anteriores, evitando un duplicado al señalar al usuario el viejo reporte. A veces es tan sencillo como preguntar al usuario "¿Has revisado el gestor de fallos para asegurarte de que no ha sido reportado ya?" Muchas personas no piensan en esto, pero se contentan con hacer la búsqueda sabiendo que hay alguien a la <emphasis>expectativa</emphasis> de que lo hagan.
gl: A segunda técnica está menos estendida, probablemente porque é máis difícil de automatizar. A idea esencial é que cada asunto novo é "coleguizado" na base de datos. Cando un usuario pensa que localizou un problema, solicítaselle que o describa nunha lista de correo, ou nun canal IRC, e recibe a confirmación por parte de alguén que lle di que efectivamente é un erro. Dispoñer cedo deste segundo par de ollos pode previr unha chea de reportes falsos. Ás veces, o segundo implicado é quen de identificar que o comportamento reportado non é un erro, ou que xa está corrixido nalgunha versión recente. Ou pode estar familiarizado cos síntomas dun asunto anterior, e evitar unha segunda incorporación do erro dirixindo o usuario cara ao asunto orixinal. Frecuentemente abonda con preguntarlle ao usuario: "Pesquisaches no sistema de xestión de erros se xa foi comunicado?". Moita xente simplemente nin pensa nesa posibilidade, aínda que farán a pesquisa de bo grado se saben que alguén <emphasis>espera</emphasis> que a fagan.

source: The buddy system can really keep the issue database clean, but it has some disadvantages too. Many people will file solo anyway, either through not seeing, or through disregarding, the instructions to find a buddy for new issues. Thus it is still necessary for volunteers to watch the issue database. Furthermore, because most new reporters don't understand how difficult the task of maintaining the issue database is, it's not fair to chide them too harshly for ignoring the guidelines. Thus the volunteers must be vigilant, and yet exercise restraint in how they bounce unbuddied issues back to their reporters. The goal is to train each reporter to use the buddying system in the future, so that there is an ever-growing pool of people who understand the issue-filtering system. On seeing an unbuddied issue, the ideal steps are:
es: El sistema de apadrinamiento puede mantener la limpieza de los reportes en la base de datos, pero también tiene algunas desventajas. Muchas personas harán los reportes sin consultar, al no buscar o despreocupándose de las instrucciones de buscar a un padrino para el nuevo reporte. Aun así, es necesario que los voluntarios sigan vigilando las bases de datos y dado que la mayoría de los nuevos usuarios que reportan fallos no entienden la dificultad de mantenerlas, no es justo reprenderlos duramente por ignorar las directrices. Aun así, los voluntarios deben ser vigilantes y ejercitar restricciones en como se rechazan reportes sin apadrinar de vuelta a quien lo haya hecho. El objetivo es entrenar a cada reportero para que utilice el sistema de apadrinamiento en el futuro, de tal manera que haya una siempre creciente fondo de gente quienes entienden el sistema de filtrado de fallos. Al encontrarnos con un reporte sin padrino, los pasos ideales a tomar son:
gl: O sistema de colegas pode manter a base de datos de asuntos realmente limpa, mais tamén ten algunhas desvantaxes. Moita xente vai reportar en solitario, de todas maneiras, ben por non teren atopado, ou por ignoraren deliberadamente, as instrucións sobre pesquisa dun colega para reportar asuntos novos. Así que aínda vai ser necesario que haxa voluntarios revisando a base de datos. Aínda máis, como os máis dos remitentes novos non van ser conscientes da dificultade de manter a base de datos de asuntos, non é axeitado reprendelos por teren ignorado as instrucións. Así que os voluntarios van ter que permanecer atentos, e controlar como lles van devolver os asuntos non "colegueados" aos seus remitentes. O obxectivo é adestrar cada remitente no uso do sistema de colegas, de tal xeito que haxa sempre unha reserva crecente de xente que entende o sistema de filtraxe. Cando se detecta un asunto non revisado por un colega, os pasos ideais son:

source: Immediately respond to the issue, politely thanking the user for filing, but pointing them to the buddying guidelines (which should, of course, be prominently posted on the web site).
es: Inmediatamente responder el reporte, agradeciendo al usuario por hacerlo, pero dirigiéndolo a las directrices de apadrinamiento (las cuales deberían, por supuesto, estar publicadas en un lugar prominente del sitio web.)
gl: Responder inmediatamente ao asunto, agradecendo amablemente o usuario por telo remitido, mais dirixíndoos as instrucións sobre revisión por terceiros (que, por suposto, deberán estar ben visibles na web do proxecto).

source: If the issue is clearly valid and not a duplicate, approve it anyway, and start it down the normal life cycle. After all, the reporter's now been informed about buddying, so there's no point wasting the work done so far by closing a valid issue.
es: Si el reportes es claramente valido y no un duplicado, hay que aprobarlo de todas formas y de esta manera que inicie su ciclo de vida normal. Después de todo, quien ha realizado el reporte ya ha sido informado sobre el apadrinamiento, así que no tiene sentido perder el trabajo ya hecho al cerrarlo como invalido.
gl: Se o asunto for claramente válido e non estiver duplicado, aprobádeo de todas maneiras, e iniciade o seu ciclo de vida normal. Despois de todo, o remitente xa estará informado sobre o sistema de revisión, e non ten sentido perder o tempo e o traballo feito pola vía de pechar un asunto perfectamente válido.

source: Otherwise, if the issue is not clearly valid, close it, but ask the reporter to reopen it if they get confirmation from a buddy. When they do, they should put a reference to the confirmation thread (e.g., a URL into the mailing list archives).
es: Si el problema no es claramente valido, hay que cerrarlo, pero solicitando que sea reabierto si reciben la confirmación por parte de un padrino. Cuando lo hagan, deberán colocar una referencia al hilo de confirmación (por ejemplo, una URL en el archivo de la listas de correo).
gl: Pola contra, se o asunto non for claramente válido, péchao, mais pídelle ao remitente que o reabra se recibir confirmación dun colega. Cando a recibiren, deberán facer mención ao fío de confirmación (p.e.: mediante unha URL dos arquivos da lista).

source: Remember that although this system will improve the signal/noise ratio in the issue database over time, it will never completely stop the misfilings. The only way to prevent misfilings entirely is to close off the bug tracker to everyone but developers&mdash;a cure that is almost always worse than the disease. It's better to accept that cleaning out invalid issues will always be part of the project's routine maintenance, and to try to get as many people as possible to help.
es: Hay que recordar que a pesar de que este sistema mejorara la proporción señal/ruido en la base de datos de problemas a lo largo del tiempo, nunca pondrá fin a los reportes inválidos. La única manera de evitar esto por completo es cerrar el gestor de fallos a todos quienes no sean desarrolladores&mdash;una cura que casi siempre es peor que la enfermedad. Es mejor aceptar que la limpieza de reportes inválidos siempre será una parte de la rutina de mantenimiento del proyecto e intentar obtener la mayor cantidad de ayuda para hacerlo.
gl: Lembra que aínda que este sistema vai mellorar co tempo a relación sinal/ruído na base de datos, non vai poder evitar completamente a introdución de asuntos incorrectos. A única maneira de previr totalmente este problema é pechar o xestor de erros para todo o mundo salvo para os desenvolvedores&mdash;un remedio que é case sempre peor que a enfermidade. É mellor aceptar que a limpeza de asuntos inválidos vai constituír sempre unha tarefa máis da rutina de mantemento do proxecto, e tratar de contar co máximo número de persoas botando unha man.

source: See also <xref linkend="issue-manager"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>.
es: Más en <xref linkend="issue-manager"/><phrase output="printed"> en el <xref linkend="managing-volunteers"/></phrase>.
gl: Podes ver máis sobre este tema en <xref linkend="xestor-de-asuntos"/><phrase output="printed"> en <xref linkend="xestionando-voluntarios"/></phrase>.

source: IRC / Real-Time Chat Systems
es: IRC / Sistemas de Chat en Tiempo Real
gl: IRC / Sistema de comunicacións en tempo real

source: Many projects offer real-time chat rooms using <firstterm>Internet Relay Chat</firstterm> (<firstterm>IRC</firstterm>), forums where users and developers can ask each other questions and get instant responses. While you <emphasis>can</emphasis> run an IRC server from your own web site, it is generally not worth the hassle. Instead, do what everyone else does: run your IRC channels at Freenode (<ulink url="http://freenode.net/"></ulink>). Freenode gives you the control you need to administer your project's IRC channels,<footnote><para>There is no requirement or expectation that you donate to Freenode, but if you or your project can afford it, please consider a contribution. They are a tax-exempt charity in the U.S., and they perform a valuable service.</para></footnote> while sparing you the not-insignificant trouble of maintaining an IRC server yourself.
es: Muchos proyectos ofrecen salas de chat utilizando <firstterm>Internet Relay Chat</firstterm> (<firstterm>IRC</firstterm>), foros donde los usuarios y desarrolladores pueden hacerse preguntas y obtener respuestas instantáneas. Mientras que se <emphasis>puede</emphasis> llevar un servidor de IRC para nuestro sitio web, por lo general no vale la pena. En cambio podemos hacer lo que todo el mundo: crear canales de IRC en Freenode (<ulink url="http://freenode.net/"></ulink>). Freenode proporciona el control necesario para administrar los canales IRC del proyecto, <footnote><para>No es un requerimiento ni tampoco se espera ninguna donación a Freenode, pero si usted o el proyecto se lo pueden permitir, por favor considerelo. Son una caridad exenta de impuestos en EE.UU. y proveen de un servicio muy valioso.</para></footnote>mientras que nos evita la molestia de tener que mantener un servidor de IRC.
gl: Moitos proxectos ofrecen salas de conversación en tempo real usando foros <firstterm>Internet Relay Chat</firstterm>(<firstterm>IRC</firstterm>) nos que usuario e desenvolvedores poden responder ás preguntas dos demais e obter respostas instantáneas. Aínda que <emphasis>poidas</emphasis> manter un servidor IRC na túa propia sede web, normalmente non paga a pena facelo. Pola contra, fai o que fai todo o mundo: establece os teus canais IRC en Freenode(<ulink url="http://freenode.net/"></ulink>). Freenode ofréceche o control que precisas para administrar os canais IRC do teu proxecto, <footnote><para>Non hai obriga nin se espera que fagas unha doazón a Freenode, mais se ti ou o teu proxecto podedes afrontalo, por favor, pensa en contribuír economicamente. están exentos de impostos nos EEUU, e están a fornecer un servizo realmente valioso.</para></footnote>
