Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: The first thing to do is choose a channel name. The most obvious choice is the name of your project&mdash;if that's available at Freenode, then use it. If not, try to choose something as close to your project's name, and as easy to remember, as possible. Advertise the channel's availabity from your project's web site, so a visitor with a quick question will see it right away. For example, this appears in a prominently placed box at the top of Subversion's home page:
es: Lo primero que hay que hacer es decidir un nombre para el canal. La opción más obvia es utilizar el nombre del proyecto&mdash;si es que se encuentra disponible en Freenode. Si no, se puede utilizar algo lo más parecido al nombre del proyecto y que sea en lo posible, fácil de recordar. Hay que publicitar la disponibilidad del canal en el sitio web del proyecto, de manera que un visitante con una duda pueda verlo rápidamente. Por ejemplo, esto aparece en un contenedor prominente en la parte de arriba de la página principal de Subversion:
gl: A primeira tarefa é a de buscar un nome para o canal. A elección máis obvia é a do nome do teu proxecto&mdash;se estiver dispoñible en Freenode, úsao. Se non , tenta dar con algo que se lle pareza o máis posible, e que sexa o máis doado de lembrar. Anuncia a dispoñibilidade do canal na páxina do proxecto, de xeito que un visitante que teña necesidade de facer unha pregunta urxente o atope á primeira. Por exemplo, esta mensaxe aparece nunha caixa moi ben situada na páxina de Subversion:

source: <blockquote> <para><emphasis>If you're using Subversion, we recommend that you join the</emphasis> <literal>users@subversion.tigris.org</literal> <emphasis>mailing list, and read the <ulink url="http://svnbook.red-bean.com/">Subversion Book</ulink> and <ulink url="http://subversion.tigris.org/faq.html">FAQ</ulink>. You can also ask questions on IRC at</emphasis> <literal>irc.freenode.net</literal> <emphasis>channel</emphasis>&nbsp;<literal>#svn</literal>.</para> </blockquote> <para>Some projects have multiple channels, one per subtopic. For example, one channel for installation problems, another for usage questions, another for development chat, etc. (<xref linkend="growth"/><phrase output="printed"> in <xref linkend="communications"/></phrase> discusses and how to divide into multiple channels). When your project is young, there should only be one channel, with everyone talking together. Later, as the user-to-developer ratio increases, separate channels may become necessary.</para> <para>How will people know all the available channels, let alone which channel to talk in? And when they talk, how will they know what the local conventions are?</para> <para>The answer is to tell them by setting the <firstterm>channel topic</firstterm>.<footnote><para>To set a channel topic, use the <literal>/topic</literal> command. All commands in IRC start with "<literal>/</literal>". See <ulink url="http://www.irchelp.org/"></ulink> if you're not familiar with IRC usage and administration; in particular, <ulink url="http://www.irchelp.org/irchelp/irctutorial.html"></ulink> is an excellent tutorial.</para></footnote> The channel topic is a brief message each user sees when they first enter the channel. It gives quick guidance to newcomers, and pointers to further information. For example:</para> <screen> You are now talking on #svn Topic for #svn is Forum for Subversion user questions, see also http://subversion.tigris.org/. || Development discussion happens in #svn-dev. || Please don't paste long transcripts here, instead use a pastebin site like http://pastebin.ca/. || NEWS: Subversion 1.1.0 is released, see http://svn110.notlong.com/ for details. </screen> <para>That's terse, but it tells newcomers what they need to know. It says exactly what the channel is for, gives the project home page (in case someone wanders into the channel without having first been to the project web site), mentions a related channel, and gives some guidance about pasting.</para> <sidebar id="paste-sites"> <title>Paste Sites</title> <para>An IRC channel is a shared space: everyone can see what everyone else is saying. Normally, this is a good thing, as it allows people to jump into a conversation when they think they have something to contribute, and allows spectators to learn by watching. But it becomes problematic when someone has to provide a large quantity of information at once, such as a debugging session transcript, because pasting too many lines of output into the channel will disrupt other conversations.</para> <para>The solution is to use one of the <firstterm>pastebin</firstterm> or <firstterm>pastebot</firstterm> sites. When requesting a large amount of data from someone, ask them not to paste it into the channel, but instead to go to (for example) <ulink url="http://pastebin.ca/"></ulink>, paste their data into the form there, and tell the resulting new URL to the IRC channel. Anyone can then visit the URL and view the data.</para> <para>There are a number of free paste sites available now, too many for a comprehensive list, but here are some of the ones I've seen used: <ulink url="http://www.nomorepasting.com/"></ulink>, <ulink url="http://pastebin.ca/"></ulink>, <ulink url="http://nopaste.php.cd/"></ulink> <ulink url="http://rafb.net/paste/"></ulink> <ulink url="http://sourcepost.sytes.net/"></ulink>, <ulink url="http://extraball.sunsite.dk/notepad.php"></ulink>, and <ulink url="http://www.pastebin.com/"></ulink>.</para> </sidebar>
gl: <blockquote> <para><emphasis>Se estás a empregar Subversion, recomendámosche que te unas á lista</emphasis> <literal>users@subversion.tigris.org</literal> <emphasis>, e que leas o <ulink url="http://svnbook.red-bean.com/">Subversion Book</ulink> e as <ulink url="http://subversion.tigris.org/faq.html">FAQ</ulink>. Podes tamén facer preguntas no IRC en </emphasis> <literal>irc.freenode.net</literal> <emphasis>canal</emphasis>&nbsp;<literal>#svn</literal>.</para> </blockquote> <para>Algúns proxectos ofrecen varios canais, un por subtema. Por exemplo, un canal para problemas de instalación, outro para cuestións sobre o uso, outro para conversas sobre desenvolvemento, etc. (<xref linkend="growth"/><phrase output="printed"> en <xref linkend="comunicacións"/></phrase> trata sobre como subdividir en múltiples canais). Mentres o teu proxecto sexa novo, debería haber un só canal, con todo o mundo charlando nel. Máis tarde, cando o ratio usuario-desenvolvedor crece, a separación de canáis pode volverse necesaria.</para> <para>Como vai saber a xente cales son os canais dispoñibles, e en que canal charlar? E cando falen nun canal, como van saber cales son as regras locais?</para> <para>A resposta está en dicirllo pola vía de establecer o <firstterm>tema do canal</firstterm>.<footnote><para>Para facelo, usa o comando <literal>/topic</literal>. Todos os comandos no IRC comezan polo carácter "<literal>/</literal>". Bótalle unha ollada a <ulink url="http://www.irchelp.org/"></ulink> se non estás familiarizado co uso e administración do IRC; en particular, <ulink url="http://www.irchelp.org/irchelp/irctutorial.html"></ulink> é un excelente tutorial.</para></footnote> O tema do canal é unha mensaxe breve que cada usuario ve no momento de entrar no canal. Inclúe instrucións para os novatos e ligazóns a máis información. Por exemplo:</para> <screen> Estás charlando en #svn O tema para #svn é o Foro para as cuestións dos usuarios de Subversion, podes visitar tamén http://subversion.tigris.org/. || As discusións sobre desenvolvemento teñen lugar en #svn-dev. || Por favor non coles transcricións longas aquí, pola contra usa un sitio como http://pastebin.ca/. || NOVAS: Subversion 1.1.0 foi liberado, máis detalles en ttp://svn110.notlong.com/. </screen> <para>Xa sei que é pesado, mais infórmalles aos novatos sobre todo o que precisan saber. Di exactamente para que é o canal, facilita o enderezo da páxina do proxecto (para o caso de que alguén se pasee polo canal sen ter visitado antes o sitio web do proxecto), menciona un canal relacionado e dá algúns consellos sobre pegar textos.</para> <sidebar id="sitios-de-pegado"> <title>Sitios de pegado</title> <para>Un canal IRC é un espazo compartido: todo o mundo pode ver o que calquera outro está a escribir. Normalmente isto é bo, xa que permite que a xente se meta nunha conversa cando cre que ten algo co que contribuír, e permite que os observadores aprendan mirando. Mais empeza a ser un problema cando alguén ten unha chea de información que compartir dunha vez, tal como a transcrición dunha sesión de corrección de erros, xa que pegar demasiadas liñas no canal vai entorpecer outras conversas.</para> <para>A solución está en usar un dos sitios <firstterm>pastebin</firstterm> ou <firstterm>pastebot</firstterm>. Cando se precise que alguén aporte uha cantidade grande de datos, non lle pidas que os pegue no chat, senón que vaia (por exemplo) a <ulink url="http://pastebin.ca/"></ulink>, pegue os seus datos no formulario da páxina, e comunique a URL resultante no canal. Calquera poderá visitar a URL e ver os datos. </para> <para> Hai uns cantos sitios gratuítos para pegado de datos na web, demasiados para unha lista entendible, mais estes son alguns dos que eu teño usado: <ulink url="http://www.nomorepasting.com/"></ulink>, <ulink url="http://pastebin.ca/"></ulink>, <ulink url="http://nopaste.php.cd/"></ulink> <ulink url="http://rafb.net/paste/"></ulink> <ulink url="http://sourcepost.sytes.net/"></ulink>, <ulink url="http://extraball.sunsite.dk/notepad.php"></ulink>, e <ulink url="http://www.pastebin.com/"></ulink>.</para> </sidebar>

source: Many technically-oriented IRC channels have a non-human member, a so-called <firstterm>bot</firstterm>, that is capable of storing and regurgitating information in response to specific commands. Typically, the bot is addressed just like any other member of the channel, that is, the commands are delivered by "speaking to" the bot. For example:
gl: Moitos canais IRC orientados a asuntos técnicos inclúen un membro non humano, chamado <firstterm>bot</firstterm>, que é quen de almacenar e devolver información en resposta a certos comandos. Tipicamente, a comunicación co bot faise de xeito exactamente igual que con calquera outro membro do canal, é dicir, os comandos se executan pola vía de "dicirllo" ao bot. Por exemplo:

source: &lt;kfogel&gt; ayita: learn diff-cmd = http://subversion.tigris.org/faq.html#diff-cmd &lt;ayita&gt; Thanks!
es: Muchos canales técnicos de IRC tienen un miembro no humano, un tal llamado <firstterm>bot</firstterm>, el cual es capaz de almacenar y regurgitar información en respuesta a comandos específicos. El bot se parece a un miembro más del canal, esto es, los comandos se hacen llegar "hablándole" al bot. Por ejemplo:"
gl: &lt;kfogel&gt; ayita: learn diff-cmd = http://subversion.tigris.org/faq.html#diff-cmd &lt;ayita&gt; Grazas!

source: That told the bot (who is logged into the channel as ayita) to remember a certain URL as the answer to the query "diff-cmd". Now we can address ayita, asking the bot to tell another user about diff-cmd:
gl: Así lle dixo ao bot (que está rexistrado no canal como ayita) que lembre unha certa URL como resposta á consulta "diff.cmd". Agora poderemos dirixirnos a ayita para que informe outro usuario acerca de diff-cmd:

source: The same thing can be accomplished via a convenient shorthand:
gl: O mesmo pode facerse mediante un atallo axeitado:

source: The exact command set and behaviors differ from bot to bot. The above example is with <literal>ayita</literal> (<ulink url="http://hix.nu/svn-public/alexis/trunk/"></ulink>), of which there is usually an instance running in <literal>#svn</literal> at freenode. Other bots include Dancer (<ulink url="http://dancer.sourceforge.net/"></ulink>) and Supybot (<ulink url="http://supybot.com/"></ulink>). Note that no special server privileges are required to run a bot. A bot is a client program; anyone can set one up and direct it to listen to a particular server/channel.
gl: A configuración exacta do comando e os comportamentos varían dun bot a outro. O exemplo anterior é para <literal>ayita</literal> (<ulink url="http://hix.nu/svn-public/alexis/trunk/"></ulink>do que normalmente hai unha instancia funcionando no canal <literal>#svn</literal> en freenode. Outros bots son Dancer (<ulink url="http://dancer.sourceforge.net/"></ulink>) e Supybot (<ulink url="http://supybot.com/"></ulink>). Non son precisos privilexios especiais para executar un bot. Un bot é un programa cliente; calquera pode pór un en marcha e dirixilo para que escoite un determinado servidor/canal.

source: If your channel tends to get the same questions over and over, I highly recommend setting up a bot. Only a small percentage of channel users will acquire the expertise needed to manipulate the bot, but those users will answer a disproportionately high percentage of questions, because the bot enables them to respond so much more efficiently.
es: El conjunto exacto de comandos y conductas difieren entre bots. El ejemplo anterior utiliza <literal>ayita</literal> (<ulink url="http://hix.nu/svn-public/alexis/trunk/"></ulink>), del cual existe una instancia en <literal>#svn</literal> en Freenode. Otros bots son Dancer (<ulink url="http://dancer.sourceforge.net/"></ulink>) y Supybot (<ulink url="http://supybot.com/"></ulink>). No son necesarios privilegios específicos en el servidor para ejecutar un bot. Un bot es un programa cliente; cualquiera puede fijar y dirigirlo para que escuche en un servidor/canal en particular.
gl: Se no teu canal se tende a repetir as mesmas preguntas unha e outra vez, eu recoméndoche implementar un bot. Tan só un número pequeno de usuarios do canal vai adquirir a experiencia necesaria para manipular o bot, mais son os mesmos usuarios que van responder a un número desproporcionadamente grande de cuestións, xa que o bot vailles permitir facelo de xeito moito máis eficiente.

source: Archiving IRC
es: Si el canal del proyecto tiende a recibir las mismas preguntas una y otra vez, recomiendo utilizar un bot. Sólo un pequeño porcentaje de usuarios del canal adquirirán la habilidad necesaria para manejar el bot, pero serán los que sí lo hagan quienes responderán a una cantidad desproporcionada de preguntas, porque el bot permite que sean respondidas con mayor eficiencia.
gl: Arquivando o IRC

source: Although it is possible to archive everything that happens in an IRC channel, it's not necessarily expected. IRC conversations may be nominally public, but many people think of them as informal, semi-private conversations. Users may be careless with grammar, and often express opinions (for example, about other software or other programmers) that they wouldn't want preserved forever in an online archive.
es: Archivando IRC
gl: Aínda que é posible arquivar todo o que ocorre nun canal IRC, non necesariamente se espera que o fagas. As conversacións IRC poden ser nominalmente públicas, mais moita xente pensa que son semiprivadas e informais. Talvez os usuarios non teñan coidado coa gramática, e a miúdo expresen opinións (por exemplo, acerca de outro software ou outros programadores) que non queren que sexan gardadas para sempre nun arquivo en liña.

source: Of course, there will sometimes be <emphasis>excerpts</emphasis> that should be preserved, and that's fine. Most IRC clients can log a conversation to a file at the user's request, or failing that, one can always just cut and paste the conversation from IRC into a more permanent forum (most often the bug tracker). But indiscriminate logging may make some users uneasy. If you do archive everything, make sure you state so clearly in the channel topic, and give a URL to the archive.
es: Aunque es posible archivar todo lo que sucede en los canales de IRC, no es algo necesario. Las conversaciones en IRC pueden ser públicas, por lo que muchas personas piensan en ellas como conversaciones informales semi-privadas. Los usuarios puede que no cuiden la gramática y a veces expresen opiniones (por ejemplo, acerca del software o sobre otros desarrolladores) que no querrán que sean preservadas eternamente en un archivo en línea.
gl: Por suposto, sempre haberá <emphasis>citas</emphasis> que deberían ser conservadas, e iso está ben. Os máis dos clientes IRC poden rexistrar unha conversación nun ficheiro, ou se iso non é posible, un sempre pode "copiar e pegar" a conversación do IRC a un foro máis permanente (frecuentemente o sistema de xestión de incidencias). Mais tamén o rexistro indiscriminado pode facer que algúns usuarios se sintan incómodos. Se arquivares absolutamente todo, deberías ter a seguridade de que iso está claramente establecido no tema do canal, e que hai unha URL coñecida do arquivo.

source: <firstterm>RSS</firstterm> (Really Simple Syndication) is a mechanism for distributing meta-data-rich news summaries to "subscribers", that is, people who have indicated an interest in receiving those summaries. A given RSS source is usually called a <firstterm>feed</firstterm>, and the user's subscription interface is called a <firstterm>feed reader</firstterm> or <firstterm>feed aggregator</firstterm>. <ulink url="http://www.rssbandit.org/">RSS Bandit</ulink> and the eponymous <ulink url="http://www.feedreader.com/">Feedreader</ulink> are two open source RSS readers, for example.
es: Wikis
gl: <firstterm>RSS</firstterm> (Really Simple Syndication) é un mecanismo para distribuír resumos de noticias, moi ricos en metadatos, aos usuarios subscritos, é dicir: á xente que manifestou o seu interese en recibiren eses resumos. Unha fonte RSS determinada é normalmente denominada un <firstterm>feed</firstterm>, e a interface de subscrición é chamada <firstterm>lector de feed</firstterm> ou <firstterm>agregador de feed </firstterm>. <ulink url="http://www.rssbandit.org/">RSS Bandit</ulink> e o epónimo <ulink url="http://www.feedreader.com/">Feedreader</ulink> son dous lectores de RSS de código aberto, por exemplo.

source: There is not space here for a detailed technical explanation of RSS<footnote><para>See <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html"></ulink> for that.</para></footnote>, but you should be aware of two main things. First, the feed reading software is chosen by the subscriber and is <emphasis>the same</emphasis> for all the feeds that subscriber monitors&nbsp;&mdash;&nbsp;in fact, this is the major selling point of RSS: that the subscriber chooses one interface to use for all their feeds, so each feed can concentrate just on delivering content. Second, RSS is now ubiquitous, so much so that most people who use it don't even know they're using it. To the world at large, RSS looks like a little button on a web page, with a label saying "Subscribe to this site" or "News feed". You click on the button, and from then on, your feed reader (which may well be an applet embedded in your home page) automatically updates whenever there's news from the site.
es: Un <firstterm>wiki</firstterm> es un sitio web que permite a cualquier visitante editar o extender su contenido; el término "wiki" (una palabra Hawaiana que significa "rápido" o "super-rápido") también es usado para la aplicación que permite este tipo de edición. Los wikis fueron inventados en 1995, pero su popularidad alzo vuelo a partir del año 2000 o 2001, impulsado parcialmente por el éxito de la Wikipedia (<ulink url="http://www.wikipedia.org/"></ulink>), un enciclopedia de contenido libre basada en un wiki. Imaginemos un wiki como algo entre IRC y las páginas web: los wikis no trabajan en tiempo real, así que la gente tiene la posibilidad de deliberar y pulir sus contribuciones, pero a la vez son muy sencillos de utilizar, facilitando más la edición que una página web.
gl: Non hai espazo aquí para facer unha explicación técnica detallada de RSS<footnote><para>podes ver <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html"></ulink> para maior información.</para></footnote>, mais deberías ter en conta dúas cousas. A primeira é que o software de lectura de feeds é seleccionado polo usuario e vai ser <emphasis>o mesmo</emphasis> para todos os feeds que o subscritor estea a monitorizar&nbsp;&mdash;&nbsp;de feito, este é o maior atractivo de RSS: que o subscritor escolle usar unha interface para todos os feeds, así que cada feed ten que concentrarse exclusivamente en servir os contidos. A segunda é que o RSS é xa ubicuo, tanto que as máis das persoas que están a empregalo nin saben que o usan. Cara á xente en xeral, RSS ten o aspecto dun pequeno botón nunha páxina web, cunha etiqueta que di "Subscríbete a este sitio" ou "Feed de noticias". Ti premes o botón, e de aí en adiante o teu lector de feed (que pode perfectamente ser unha applet embebida na túa páxina web) actualízase automaticamente cada vez que se introduce unha novidade na web de orixe.

source: This means that your open source project should probably offer an RSS feed (note that many of the canned hosting sites&nbsp;&mdash;&nbsp;see <xref linkend="canned-hosting"/>&nbsp;&mdash;&nbsp;offer it right out of the box). Be careful not to post so many news items each day that subscribers can't separate the wheat from the chaff. If there are too many news events, people will just ignore the feed, or even unsubscribe in exasperation. Ideally, a project would offer separate feeds, one for big announcements, another following (say) events in the issue tracker, another for each mailing list, etc. In practice, this is hard to do well: it can result in interface confusion both for visitors to the project's web site and for the administrators. But at a minimum, the project should offer one RSS feed on the front page, for sending out major announcements such as releases and security alerts.
es: Los wikis no son aun equipamiento estándar para los proyectos open source, pero probablemente pronto lo serán. Dado que son una tecnología relativamente nueva y la gente aún experimenta con las diferentes maneras de utilizarlos, sólo ofreceré algunas precauciones &mdash;llegados a este punto, es más fácil analizar los usos equivocados de los wikis en lugar de analizar sus exitos.
gl: Isto quere dicir que o teu proxecto de software de fontes abertas debería probablemente ofrecer un feed RSS (os máis dos sitios de aloxamento preconfigurado xa o ofrecen como opción por defecto&nbsp;&mdash;&nbsp;véxase <xref linkend="aloxamento-preconfigurado"/>&nbsp;&mdash;&nbsp;). Mais ten coidado de non publicares tantas novas ao día que os subscritores non sexan quen de separar o gran da palla. Se hai demasiados eventos de novas, a xente simplemente vai ignorar o feed ou, aínda peor, vaise dar de baixa por desesperación. Idealmente, un proxecto debería ofertar feeds separados: un para os grandes anuncios, outro seguindo (digamos) os eventos do xestor de incidencias, outro para cada lista de correo, etc. Na práctica, isto é difícil de facer en condicións: pode producir confusión de interfaces tanto para os visitantes da web do proxecto como para os administradores. Mais como mínimo, o proxecto debería ofrecer un feed RSS na portada da web para enviar novas sobre os eventos máis relevantes, tales como novas versións ou avisos de seguridade.
