Repository: amaneiro/poss-gl
Catalog: po/*/ch03.po
Languages: es, gl

source: A database in which changes are stored. Some version control systems are centralized: there is a single, master repository, which stores all changes to the project. Others are decentralized: each developer has his own repository, and changes can be swapped back and forth between repositories arbitrarily. The version control system keeps track of dependencies between changes, and when it's time to make a release, a particular set of changes is approved for that release. The question of whether centralized or decentralized is better is one of the enduring holy wars of software development; try not to fall into the trap of arguing about it on your project lists.
es: Una base de datos en la que los cambios son almacenados. Algunas versiones de sistemas de control de versiones son centralizados, es decir, existe un único repositorio maestro, el cual almacena todos los cambios en el proyecto. Otros sistemas son descentralizados, cada desarrollador tiene su propio repositorio y los cambios pueden ser intercambiados entre repositorios arbitrariamente. El sistema de control de versiones mantiene un registro de las dependencias entre estos cambios y cuando llega el momento de realizar un lanzamiento, un conjunto particular de cambios es aprobado para ese lanzamiento. La cuestión de cual sistema es mejor es otra de las guerras santas del desarrollo de software. Intentad no caer en la trampa de discutir sobre esto en las listas de correo del proyecto.
gl: Unha base de datos na que se almacenan as mudanzas. Algúns sistemas de control de versións están centralizados: hai un único repositorio no que se almacenan todos as mudanzas do proxecto. Outros son descentralizados: cada desenvolvedor garda o seu propio repositorio, e as mudanzas poden ser trocadas entre repositorios arbitrariamente. O sistema de control de versións mantén o seguimento das dependencias entre mudanzas, e cando chega a hora de liberar unha nova versión, un conxunto concreto de mudanzas é aprobado para esa versión. A cuestión sobre se é mellor a centralización ou a descentralización é unha das guerras santas máis longas do desenvolvemento de software; tenta non caer na trampa de discutires sobre este asunto nas listas de correo do teu proxecto.

source: The process of obtaining a copy of the project from a repository. A checkout usually produces a directory tree called a "working copy" (see below), from which changes may be committed back to the original repository. In some decentralized version control systems, each working copy is itself a repository, and changes can be pushed out to (or pulled into) any repository that's willing to accept them.
es: El proceso de obtener una copia del proyecto desde el repositorio. Por lo general, un checkout produce un árbol de directorios llamado "copia funcional" desde el cual los cambios serán enviados de vuelta al repositorio original. En algunas versiones descentralizadas de sistemas de control, cada copia funcional es en si mismo un repositorio y los cambios son empujados (o atraídos) a cualquier repositorio que este dispuesto a aceptarlos.
gl: O proceso de descarregar unha copia do proxecto desde un repositorio. Un checkout xera normalmente unha árbore de directorios chamada "copia de traballo" (ver debaixo), desde a que as mudanzas poden ser enviadas novamente ao repositorio orixinal. Nalgúns sistemas de control de versións descentralizados, cada copia de traballo é ao tempo un repositorio, e as mudanzas poden ser enviadas (ou traídas de) calquera outro repositorio que as acepte.

source: working copy
es: copia funcional
gl: copia de traballo

source: A developer's private directory tree containing the project's source code files, and possibly its web pages or other documents. A working copy also contains a little bit of metadata managed by the version control system, telling the working copy what repository it comes from, what "revisions" (see below) of the files are present, etc. Generally, each developer has his own working copy, in which he makes and tests changes, and from which he commits.
es: El árbol de directorios privado de cada desarrollador que que contiene el código fuente del proyecto y posiblemente las páginas web u otros documentos. Una copia funcional también contiene un pequeña cantidad de meta-data administrada por el sistema de control de versiones, informando a la copia funcional cual es repositorio central de procedencia, la revisión de los ficheros presentes, etc. Generalmente, cada desarrollador tiene su propia copia funciona en la cual realiza y prueba los cambios y desde la cual envía sus commits (cambios).
gl: A árbore de directorios dun desenvolvedor que contén os ficheiros de código fonte e, posiblemente, as súas páxinas web ou outros documentos. Unha copia de traballo contén tamén un certo número de metadatos xeridos polo sistema de control de versións, que lle din de que repositorio vén, que "revisións" (ver máis abaixo) contén, etc. Xeralmente, cada desenvolvedor mantén a súa propia copia de traballo, na que fai e comproba as mudanzas, e desde a que fai os commits.

source: <firstterm>revision</firstterm>, <firstterm>change</firstterm>, <firstterm>changeset</firstterm>
es: <firstterm>revisión</firstterm>, <firstterm>cambio</firstterm>, <firstterm>conjunto de cambios</firstterm>
gl: <firstterm>conxunto de mudanzas(changeset) </firstterm>, <firstterm>mudanza</firstterm>, <firstterm>revisión</firstterm>

source: A "revision" is usually one specific incarnation of a particular file or directory. For example, if the project starts out with revision 6 of file F, and then someone commits a change to F, this produces revision 7 of F. Some systems also use "revision", "change", or "changeset" to refer to a set of changes committed together as one conceptual unit.
es: Una revisión es usualmente una encarnación específica de un fichero o directorio en particular. Por ejemplo, si el proyecto se inicia en la revisión 6 del fichero F y alguien envía un cambio al fichero F, esto produce la revisión 7 de F. Algunos sistemas también utilizan revisión (revision), cambio (change) o conjunto de cambios (changeset) para referirse a un conjunto de cambios enviados juntos como una unidad conceptual.
gl: Unha "revisión" é xeralmente a encarnación dun ficheiro ou directorio en particular. Por exemplo, se o proxecto comeza coa revisión 6 do ficheiro F, e despois alguén fai un commit cunha mudanza a F, isto produce a revisión 7 de F. Algúns sistemas usan tamén "revisión", "mudanza" ou "changeset" para se referiren a un conxunto de mudanzas subidas todas xuntas nun único commit como unha unidade conceptual

source: These terms occasionally have distinct technical meanings in different version control systems, but the general idea is always the same: they give a way to speak precisely about exact points in time in the history of a file or a set of files (say, immediately before and after a bug is fixed). For example: "Oh yes, she fixed that in revision 10" or "She fixed that in revision 10 of foo.c."
es: Estos conceptos pueden tener distintos significados técnicos en cada sistema de control de versiones, pero en general, la idea es siempre la misma: dar un sistema para comunicar de manera precisa la historia de cambios en un fichero o conjunto de ficheros (inmediatamente antes y después de que se ha corregido un fallo). Por ejemplo: "Eso se ha resuelto en la revisión 10" o "Se ha corregido eso en la revisión 10 del fichero foo.c."
gl: Estes termos teñen ocasionalmente diferentes significados técnicos en diferentes sistemas de control de versións, mais a idea máis estendida é sempre a mesma: son a maneira de falar con precisión acerca de puntos temporais concretos na historia dun ficheiro ou un conxunto de ficheiros (digamos, inmediatamente antes e despois de que un erro é reparado). Por exemplo: "ó, si, reparou ese problema na revisión 10" ou "reparou iso na revisión 10 de foo.c"

source: When one talks about a file or collection of files without specifying a particular revision, it is generally assumed that one means the most recent revision(s) available.
es: Cuando se habla sobre ficheros o una colección de ficheros sin especificar una revisión en particular, por lo general se asume que nos referimos a la revisión disponible más reciente.
gl: Cando un fala sobre un ficheiro ou colección de ficheiros sen especificar unha revisión en particular, xeralmente se asume que se está a referir a(s) revisión(s) máis recentes.

source: "Version" Versus "Revision"
es: "Versión" Versus "Revisión"
gl: "Versión" fronte a "Revisión"

source: The word <firstterm>version</firstterm> is sometimes used as a synonym for "revision", but I will not use it that way in this book, because it is too easily confused with "version" in the sense of a version of a piece of software&mdash;that is, the release or edition number, as in "Version 1.0". However, since the phrase "version control" is already standard, I will continue to use it as a synonym for "revision control" and "change control".
es: El termino <firstterm>versión</firstterm> es a veces utilizado como un sinónimo para "revisión", pero aquí no voy a utilizarla de esta forma, ya que se puede confundir fácilmente con "versión" en el sentido de una versión de un programa&mdash;así que, el número de lanzamiento o edición como en "Versión 1.0". Y aunque la frase "control de versiones" es un estándar, continuare utilizándolo como sinónimo para "control de revisiones" y para "control de cambios".
gl: A palabra <firstterm>versión</firstterm> ás veces é usada como sinónimo de "revisión", mais eu non o vou usar nese sentido neste libro, porque é demasiado fácil confundilo co termo "versión" tal como cando se fala de versións dun software&mdash;isto é, o número de liberación ou distribución, como en "Versión 1.0". De todos os xeitos, como a expresión "control de versións" é de feito estándar, eu vou continuar a empregala como sinónimo de "control de revisión" e "control de mudanzas".

source: A textual representation of a change. A diff shows which lines were changed and how, plus a few lines of surrounding context on either side. A developer who is already familiar with some code can usually read a diff against that code and understand what the change did, and even spot bugs.
es: Una representación contextual de un cambio. Un diff muestra las lineas que han sido modificadas, como y además, algunas lineas contextuales rodeándolas a cada lado. Un desarrollador familiarizado con el código puede, con leer un diff de ese código, entender lo que hace el cambio e incluso detectar fallos.
gl: Representación textual dunha mudanza. Un "diff" mostra que liñas foron mudadas e como, ademais dunhas poucas liñas de contextualización desa información. Un desenvolvedor que estea familiarizado cun código dado, poderá ler o diff comparándoo co código e entender que foi o que se mudou, e mesmo localizar erros.

source: <firstterm>tag</firstterm>
es: etiqueta (tag)
gl: <firstterm>etiqueta (tag)</firstterm>

source: A label for a particular collection of files at specified revisions. Tags are usually used to preserve interesting snapshots of the project. For example, a tag is usually made for each public release, so that one can obtain, directly from the version control system, the exact set of files/revisions comprising that release. Common tag names are things like <literal>Release_1_0</literal>, <literal>Delivery_00456</literal>, etc.
es: Una etiqueta para una colección particular de ficheros en una revisión específica. Los tags son utilizados para preservar capturas interesantes del proyecto. Por ejemplo, un tag es hecho para cada lanzamiento público, de forma que cada persona pueda obtener, directamente desde el sistema de control de versiones, el conjunto exacto de ficheros/revisiones que componen el lanzamiento. Algunos tags comunes son como <literal>Release_1_0</literal>, <literal>Delivery_00456</literal>, etc.
gl: Designan coleccións particulares de ficheiros pertencentes a unha revisión específica. As etiquetas xeralmente son usadas para preservar fitos interesantes dun proxecto. Por exemplo, frecuentemente se lle adxudica unha etiqueta a cada versión liberada, de tal xeito que se poida obter, directamente dende o sistema de control de versións, o conxunto exacto de ficheiros que compoñen esa versión. Os nomes que se acostuman empregar para as etiquetas poden ser do estilo de: <literal>Versión_1_0</literal>, <literal>Distribución_00456</literal>, etc.

source: branch
es: rama (branch)
gl: rama (branch)

source: A copy of the project, under version control but isolated, so that changes made to the branch don't affect the rest of the project, and vice versa, except when changes are deliberately "merged" from one side to the other (see below). Branches are also known as "lines of development". Even when a project has no explicit branches, development is still considered to be happening on the "main branch", also known as the "main line" or "<firstterm>trunk</firstterm>".
es: Es una copia del proyecto, bajo el control de versiones, pero aislado, de forma que los cambios realizados en esta rama no afecten al resto del proyecto y vice versa, excepto cuando los cambios sean deliberadamente "unidos" de un lado al otro. Las ramas también son conocidas como "lineas de desarrollo". Incluso cuando un proyecto no tiene ramas específicas se considera que el desarrollo se esta produciendo en la rama principal, también conocida como "línea primaria" o "<firstterm>trunk</firstterm>".
gl: Unha copia do proxecto, baixo o control de versións mais individualizada, tal que as mudanzas feitas á rama non afectan ao resto do proxecto, e viceversa, excepto cando as mudanzas son fusionadas (merged) desde unha rama a outra (ver debaixo). As ramas son tamén coñecidas como "liñas de desenvolvemento". Mesmo cando un proxecto non ten ramas, considérase que o desenvovemento se está a facer na "rama principal (main branch)", tamén coñecida como "liña principal (main line)" ou" <firstterm>tronco (trunk)</firstterm>".

source: Branches offer a way to isolate different lines of development from each other. For example, a branch can be used for experimental development that would be too destabilizing for the main trunk. Or conversely, a branch can be used as a place to stabilize a new release. During the release process, regular development would continue uninterrupted in the main branch of the repository; meanwhile, on the release branch, no changes are allowed except those approved by the release managers. This way, making a release needn't interfere with ongoing development work. See <xref linkend="branches"/><phrase output="printed"> later in this chapter</phrase> for a more detailed discussion of branching.
es: Las ramas o branches, permiten aislar diferentes lineas de desarrollo de si mismas. Por ejemplo, una rama puede ser utilizada para un desarrollo experimental que sería demasiado inestable para la rama principal. O al contrario, una rama puede ser utilizada como sitio para estabilizar una versión para lanzamiento. Durante el proceso de lanzamiento, el desarrollo regular se mantendría ininterrumpida en la rama principal. Mientras tanto, en la rama de lanzamiento, ningún cambio es aceptado excepto aquellos aprobados por el responsable del lanzamiento. De esta manera, realizar un lanzamiento no tiene porque interferir con el trabajo de desarrollo que se está realizando. Para más información <xref linkend="branches"/><phrase output="printed"> más adelante en el capítulo</phrase> para una discusión más detallada sobre las ramas.
gl: As ramas ofrecen unha maneira de isolar entre si diferentes liñas de desenvolvemento que poderían desestabilizar o tronco principal. Ou alternativamente, unha rama pode ser empregada para estabilizar unha nova versión. Durante o proceso de liberación, o desenvolvemento normal do proxecto pode continuar na rama principal do repositorio; mentres tanto, na rama da liberación, non se permite introducir novas mudanzas distintas das aprobadas polos xestores da liberación. Así, facer unha liberación non ter por que interferir cos traballos de desenvolvemento. Podes consultar <xref linkend="ramas (branches)"/><phrase output="printed"> máis adiante neste capítulo</phrase> se precisares máis detalles sobre a creación de ramas.

source: merge (a.k.a. port)
es: merge
gl: fusionar ("merge", ou "port")

source: To move a change from one branch to another. This includes merging from the main trunk to some other branch, or vice versa. In fact, those are the most common kinds of merges; it is rare to port a change between two non-main branches. See <xref linkend="vc-singularity"/> for more about this kind of merging.
es: Mover un cambio de una rama a otra, lo que incluye unir desde la rama principal a otra rama o vice versa. De hecho, estos son las uniones más comunes y es rara la ocasión en la que esto se hace entre dos ramas no principales. Para más información sobre los merge <xref linkend="vc-singularity"/>.
gl: Trasladar unha mudanza entre ramas. Inclúe fusionar desde o tronco principal a unha rama ou viceversa. De feito, estas son precisamente as fusións máis frecuentes; é raro facer fusións entre ramas secundarias do proxecto. Podes ver máis información sobre este tema en <xref linkend="vc-singularity"/>.

source: "Merge" has a second, related meaning: it is what the version control system does when it sees that two people have changed the same file but in non-overlapping ways. Since the two changes do not interfere with each other, when one of the people updates their copy of the file (already containing their own changes), the other person's changes will be automatically merged in. This is very common, especially on projects where multiple people are hacking on the same code. When two different changes <emphasis>do</emphasis> overlap, the result is a "conflict"; see below.
es: "Merge" tiene otro significado: es lo que hace el sistema de control de versiones cuando se encuentra con que dos personas han realizado cambios en un mismo fichero sin relación alguna. Ya que estos cambios no interfieren entre ellos, cuando alguna de estas personas actualizan su copia del fichero (el cual ya contiene los cambios) los cambios de la otra persona serán unidos automáticamente. Esto sucede muy a menudo, especialmente en proyectos con múltiples personas realizando cambios en el mismo código. Cuando dos cambios diferentes están relacionados, el resultado es un "conflicto".
gl: "Fusionar (merge)" ten un segundo significado, relacionado co anterior: é o que fai o sistema de control de versións cando detecta que dúas persoas fixeron mudanzas a un mesmo ficheiro, mais en aspectos que non se sobrepoñen. Dado que as dúas mudanzas non interfiren entre si, cando un dos desenvolvedores actualiza a súa copia do ficheiro (contendo aínda as súas propias mudanzas), as mudanzas feitas polo segundo desenvolvedor fusiónanse automaticamente cos anteriores. Isto é moi frecuente, especialmente en proxectos nos que moitas persoas están traballando sobre o mesmo código. Cando dúas mudanzas diferentes <emphasis>interfiren</emphasis>, o resultado é un "conflicto".

source: conflict
es: conflicto
gl: conflicto

source: What happens when two people try to make different changes to the same place in the code. All version control systems automatically detect conflicts, and notify at least one of the humans involved that their changes conflict with someone else's. It is then up to that human to <firstterm>resolve</firstterm> the conflict, and to communicate that resolution to the version control system.
es: Sucede cuando dos o más personas intentan realizar diferentes cambios en la misma porción de código. Todos los sistemas de control de versiones detectan estos conflictos automáticamente y notifican a al menos uno de los humanos involucrados de que sus cambios entran en conflicto con los de alguien más. Es entonces tarea de esta personas <firstterm>resolver</firstterm> el conflicto y comunicar esa resolución al sistema de control de versiones.
gl: É o que sucede cando dúas persoas tratan de facer mudanzas diferentes sobre a mesma porción de código. Todos os sistemas de control de versións detectan automaticamente os conflitos, e lle notifican a cando menos un dos desenvolvedores implicados que as súas mudanzas entran en conflito coas de alguén máis. <firstterm>Resolver</firstterm> o conflicto e comunicarllo ao sistema fica entón na man desa persoa.

source: lock
es: bloqueo (lock)
gl: bloquear (lock)

source: A way to declare an exclusive intent to change a particular file or directory. For example, "I can't commit any changes to the web pages right now. It seems Alfred has them all locked while he fixes their background images." Not all version control systems even offer the ability to lock, and of those that do, not all require the locking feature to be used. This is because parallel, simultaneous development is the norm, and locking people out of files is (usually) contrary to this ideal.
es: Declaración de un intento exclusivo para cambiar un fichero o directorio en particular. Por ejemplo, "No puedo enviar cambios a las paginas web ahora mismo, ya que parece que Alfredo las tiene bloqueadas mientras arregla sus imágenes de fondo." No todos los sistemas de control de versiones ofrecen la posibilidad del bloqueo y aquellos que sí lo permiten, no es necesario que se utilice. Esto es porque el desarrollo paralelo y simultaneo es la norma y bloquear a la gente para que no puedan modificar los ficheros es contrario a la idea del sistema.
gl: É unha maneira de declarar un intento de introducir mudanzas en exclusiva nun ficheiro ou directorio dado. Por exemplo: "Non podo subir ningunha mudanza ás páxinas web neste momento. Alfred as ten bloqueadas mentres corrixe as imaxes do fondo". Non todos os sistemas de control de versións ofrecen a posibilidade de facer bloqueos, e entre os que si o fan, non todos esixen que se empregue o bloqueo. Isto é así porque o desenvolvemento simultáneo e en paralelo é a norma, e bloquear a xente que pretende traballar sobre os ficheiros é (xeralmente) contrario a este ideal.
