Repository: amaneiro/poss-gl
Catalog: po/*/ch04.po
Languages: es, gl

source: Being a BD requires a combination of traits. It needs, first of all, a well-honed sensitivity to one's own influence in the project, which in turn brings self-restraint. In the early stages of a discussion, one should not express opinions and conclusions with so much certainty that others feel like it's pointless to dissent. People must be free to air ideas, even stupid ideas. It is inevitable that the BD will post a stupid idea from time to time too, of course, and therefore the role also requires an ability to recognize and acknowledge when one has made a bad decision&mdash;though this is simply a trait that <emphasis>any</emphasis> good developer should have, especially if she stays with the project a long time. But the difference is that the BD can afford to slip from time to time without worrying about long-term damage to her credibility. Developers with less seniority may not feel so secure, so the BD should phrase critiques or contrary decisions with some sensitivity for how much weight her words carry, both technically and psychologically.
es: Ser un DB requiere una combinación de características. Se necesita, antes que nada, una cierta delicadeza para juzgar su propia influencia en el proyecto, lo que a su vez lleva a sujetar los primeros impulsos. En los primeros pasos de una discusión uno no debe expresar opiniones y conclusiones con tanta seguridad que los otros sientan que es inútil opinar en contra. La gente debe sentirse libre de ventilar sus ideas, aunque sean tontas. Es inevitable que el DB sugiera alguna idea tonta de vez en cuando, y por lo tanto esta función requiere la disponibilidad de reconocer cuando uno haya tomado una mala decisión&mdash; si bien es ésta una característica sencilla que <emphasis>cualquier</emphasis> buen desarrollador debe tener, especialmente si permanece en el proyecto por mucho tiempo. Pero la diferencia es que el DB puede darse el lujo de equivocarse de vez en cuando sin tener que lamentar daños permanentes en su credibilidad. Los desarrolladores más jóvenes pueden no tener tanta seguridad, y por eso los DB deben expresar sus críticas o decisiones en contra con mucha delicadeza para contrapesar la fuerza psicológica y técnica que tienen sus palabras.
gl: Ser un DB (ditador benevolente) require unha combinación de características. Necesítase, en primeiro lugar, unha certa delicadeza para xulgar a súa propia influencia no proxecto, o que á súa vez leva á moderación. Nas primeiras etapas dunha discusión, un non debe expresar opinións e conclusións con tanta seguridade que os outros sintan que é inútil opinar en contra. A xente debe ser libre de lanzar ideas, mesmo ideas estúpidas. É inevitable que o DB expoña unha idea estúpida de cando en vez tamén, por suposto, e polo tanto este rol require a capacidade de recoñecer cando un toma unha mala decisión; aínda que isto é unha característica básica que calquera bo desenvolvedor debe ter, especialmente se se mantén no proxecto durante tempo. Mais a diferenza é que o DB pode darse o luxo de equivocarse de cando en vez sen ter que lamentar danos permanentes na súa credibilidade. Os desenvolvedores que levan menos tempo poden sentirse máis inseguros, polo que o BD debería expoñer as críticas ou decisións contrarias con a suficiente sensibilidade tendo en conta o peso das súas palabras, tanto tecnicamente como psicoloxicamente.

source: The BD does <emphasis>not</emphasis> need to have the sharpest technical skills of anyone in the project. She must be skilled enough to work on the code herself, and to understand and comment on any change under consideration, but that's all. The BD position is neither acquired nor held by virtue of intimidating coding skills. What <emphasis>is</emphasis> important is experience and overall design sense&mdash;not necessarily the ability to produce good design on demand, but the ability to recognize good design, whatever its source.
es: El DB <emphasis>no</emphasis> necesita tener una habilidad técnica superior que supere a todos los que están en el proyecto. Tiene que saber lo suficiente como para trabajar en el código, y entender y comentar cualquier cambio en consideración, y eso es todo. La posición del DB no se adquiere ni mantiene en virtud a una habilidad de codificar intimidatoria. Lo que <emphasis>si</emphasis> es importante es la experiencia y un sentido general del diseño &mdash;no necesariamente la habilidad de producir un buen diseño a pedido, pero si la habilidad de reconocer el buen diseño, provenga de donde proveniere.
gl: O BD <emphasis>non</emphasis> necesita ter a maior capacidade técnica do proxecto. Debe ser suficiente como para traballar sobre o código, e entender e poder opinar sobre calquera mudanza en cuestión, mais iso é todo. A posición do DB non se adquire nin mantén en virtude dunha habilidade de xerar código que intimide. O que <emphasis>si</emphasis> é realmente importante é a experiencia e un bo sentido de deseño global do proxecto; non necesariamente a habilidade de xerar un bo deseño baixo demanda, senón a capacidade de recoñecelo, sexa cal for a súa orixe.

source: It is common for the benevolent dictator to be a founder of the project, but this is more a correlation than a cause. The sorts of qualities that make one able to successfully start a project&mdash;technical competence, ability to persuade other people to join, etc.&mdash;are exactly the qualities any BD would need. And of course, founders start out with a sort of automatic seniority, which can often be enough to make benevolent dictatorship appear the path of least resistance for all concerned.
es: Es común que un dictador benevolente sea el fundador del proyecto, pero esto es más una correlación que una causa. El tipo de cualidades que permite poner en marcha con éxito un proyecto son exáctamente las cualidades que cualquier DB debe tener&mdash; competencia técnica, habilidad de persuadir para que otro se una, etc.&mdash;. Y por supuesto, los fundadores se inician con una cierta senioridad automática, que puede ser suficiente a menudo para que el dictador benevolente aparezca por el camino de menor resistencia para todos aquellos a quienes les incumbe.
gl: É común que un ditador benevolente sexa o fundador do proxecto, mais isto é máis unha correlación que unha causa. O tipo de cualidades que permite pór en marcha con éxito un proxecto, competencia técnica, capacidade de persuadir a outros a unírense, etc, son exactamente as cualidades que calquera DB necesita. E, por suposto, os fundadores inícianse cunha especie de antigüidade automática, que a miúdo pode ser suficiente para que o ditador benevolente xurda cunha menor resistencia por parte de todos os involucrados.

source: Remember that the potential to fork goes both ways. A BD can fork a project just as easily as anyone else, and some have occasionally done so, when they felt that the direction they wanted to take the project was different from where the majority of other developers wanted to go. Because of forkability, it does not matter whether the benevolent dictator has root (system administrator privileges) on the project's main servers or not. People sometimes talk of server control as though it were the ultimate source of power in a project, but in fact it is irrelevant. The ability to add or remove people's commit passwords on one particular server affects only the copy of the project that resides on that server. Prolonged abuse of that power, whether by the BD or someone else, would simply lead to development moving to a different server.
es: Recordar que la amenaza de un fork vale para los dos sentidos. Un DB puede hacer un fork de un proyecto tan facilmente como cualquier otro, y ocasionalmente lo han hecho, cuando sienten que la dirección que está tomando el proyecto es diferente de donde la mayoría de los desarrolladores quieren ir. Por causa de la forkabilidad, poco importa si el dictador benevolente tiene privilegios de root (que corresponden al administrador del sistema) en el servidor principal del proyecto. A veces la gente se refiere al control del servidor como si fuera la mayor fuente de poder en un proyecto, pero de hecho es irrelevante. La posibilidad de agregar o quitar las palabras clave para hacer commit en un servidor afecta solo a la copia del proyecto que reside en el servidor. Un abuso constante de ese poder, sea por el DB o por cualquier otro, va a terminar simplemente con un cambio del desarrollo en un servidor diferente.
gl: Debe recordarse que a posibilidade de escisión vai en ambos os sentidos. Un DB pode facer unha escisión dun proxecto tan facilmente como calquera outro, e ocasionalmente fixérono así, cando se considerou que a dirección que está tomando o proxecto é diferente ao que a maioría dos desenvolvedores desexan. Debido á posibilidade dunha escisión, non importa se o ditador benevolente ten privilexios de root (administrador do sistema) nos servidores principais do proxecto ou non. Ás veces a xente fala de control do servidor coma se fose a última fonte de poder nun proxecto, pero en realidade é irrelevante. A posibilidade de agregar ou quitar as contrasinais de commit dos membros nun servidor só afecta á copia do proxecto que reside no servidor. Un abuso prolongado dese poder, xa sexa polo DB ou doutra persoa, simplemente levaría ao traslado a un servidor diferente.

source: Whether your project should have a benevolent dictator, or would run better with some less centralized system, largely depends on who is available to fill the role. As a general rule, if it's simply obvious to everyone who should be the BD, then that's the way to go. But if no candidate for BD is immediately obvious, then the project should probably use a decentralized decision-making process, as described in the next section.
es: Si el proyecto tendrá un dictador benevolente o si va a funcionar mejor con un sistema menos centralizado, depende ampliamente de quién es el que va a cumplir con esa función. Por lo general es algo muy obvio desde el comienzo saber quién va a ser el DB, y entonces todo se encamina en ese sentido. Pero si no hay un candidoto obvio para el DB, puede ser que el proyecto se incline a usar un proceso descentralizado de tomas de decisión, como se va a describir en la prósima sección.
gl: Se o teu proxecto debería ter un ditador benevolente ou se vai funcionar mellor cun sistema menos centralizado, depende en gran medida de que exista alguén adecuado para exercer este papel. Como regra xeral, se for moi obvio para todos quen debería ser o DB, entón ese é o camiño a seguir. Contodo, se ningún candidato para BD é inmediatamente obvio, entón o proxecto probablemente deba utilizar unha toma de decisións descentralizada, como se describe na seguinte sección.

source: Consensus-based Democracy
es: Democracia basada en el Consenso
gl: Democracia baseada no consenso

source: As projects get older, they tend to move away from the benevolent dictatorship model and toward more openly democratic systems. This is not necessarily out of dissatisfaction with a particular BD. It's simply that group-based governance is more "evolutionarily stable", to borrow a biological metaphor. Whenever a benevolent dictator steps down, or attempts to spread decision-making responsibility more evenly, it is an opportunity for the group to settle on a new, non-dictatorial system&mdash;establish a constitution, as it were. The group may not take this opportunity the first time, or the second, but eventually they will; once they do, the decision is unlikely ever to be reversed. Common sense explains why: if a group of N people were to vest one person with special power, it would mean that N&nbsp;-&nbsp;1 people were each agreeing to decrease their individual influence. People usually don't want to do that. Even if they did, the resulting dictatorship would still be conditional: the group anointed the BD, clearly the group could depose the BD. Therefore, once a project has moved from leadership by a charismatic individual to a more formal, group-based system, it rarely moves back.
es: A medida que el proyecto avanza, se tiende a pasar del modelo del dictador benevolente a los sistemas más abiertaente democráticos. Este paso no se produce necesariamente por la insatisfacción causada por un DB. Es que el gobierno basado en el grupo llega a ser estable en su evolución, para usar así una metáfora biológica. Siempre que un dictador benevolente se baja o intenta difundir la responsablidad de tomar decisiones entre todos por igual, se da la oportunidad para que el grupo se asiente en un nuevo sistema no-dictatorial&mdash;estableciendo una constitución, por así decirlo. Puede ser que el grupo no aprovecha la primera oportunidad, ni quizás tampoco la segunda, pero en algún momento lo hará; y una vez hecho, es muy difícil que esta decisión se vuelva atrás. Y el sentido comun lo explica: si un grupo de N individuos tuviera que investir una persona con poderes especiales, eso significaría que N&nbsp;-&nbsp;1 personas tuvieron que aceptar que sus influencias individuales se disminuyan. Normalmente la gente no quiere hacer cosas como esa. Y si las hiciera, todavía la dictadura que de allí resulte sería condicional: el grupo que unge a un DB, es claramente el grupo que puede deponer al DB. Por lo tanto, una vez que el proyecto a pasado de un liderazgo carismático individual a un sistema más formal basado en el grupo, muy rara vez vuelve para atrás.
gl: A medida que os proxectos van madurando, tenden a afastarse do modelo do ditador benevolente cara a sistemas democráticos máis abertos. Isto non se debe necesariamente á insatisfacción causada por un DB en concreto. Trátase simplemente de que unha forma de goberno baseada no grupo é máis "evolutivamente estable", usando unha metáfora biolóxica. Sempre que un ditador benevolente renuncia, ou intenta repartir a responsabilidade na toma de decisións máis equitativamente, é unha oportunidade para o grupo de asentarse nun sistema non ditatorial&mdash;establecer unha constitución, por así dicilo. O grupo pode non aproveitar esta oportunidade a primeira vez, ou na segunda, pero finalmente vaino facer; unha vez que o fan, a decisión é pouco probable que se inverta. O sentido común explica o porqué: se un grupo de persoas N tivese que investir unha persoa con poder especial, iso significaría que N&nbsp;-&nbsp;1 persoas tiveron que aceptar diminuíren a súa influencia individual. Normalmente a xente non quere facer iso. Mesmo se o fixesen, a ditadura resultante aínda sería condicional: o grupo que designa un DB, é claramente o grupo que pode depor ao DB. Polo tanto, unha vez que o proxecto pasou dun liderado carismático individual a un sistema máis formal baseado no grupo, é raro que volva ao estado anterior.

source: The details of how these systems work vary widely, but there are two common elements: one, the group works by consensus most of the time; two, there is a formal voting mechanism to fall back on when consensus cannot be reached.
es: Los detalles de cómo funcionan esos sistemas varían ampliamente, pero hay en ellos dos elementos comunes: uno, el grupo funciona por consencio la mayoría del tiempo; dos, hay un mecanismo formal de votaciones para los casos en que el consenso no puede alcanzarse.
gl: Os detalles de como funcionan eses sistemas varían amplamente, mais hai dous elementos comúns: un, o grupo funciona por consenso na maioría dos casos, dous, conta cun mecanismo formal de votacións alternativo para as situacións nas que o consenso non poida ser alcanzado.

source: <firstterm>Consensus</firstterm> merely means an agreement that everyone is willing to live with. It is not an ambiguous state: a group has reached consensus on a given question when someone proposes that consensus has been reached, and no one contradicts the assertion. The person proposing consensus should, of course, state specifically what the consensus is, and what actions would be taken in consequence of it, if they're not obvious.
es: <firstterm>Consenso</firstterm> significa solamente un acuerdo que todos aceptan de una vez por todas. No es un estado ambiguo: un grupo alcanza el consenso en un asunto particular cuando alguien expresa que se ha alcanzado un consenso y nadie contradice esa afirmación. La persona que propone el consenso debe, por cierto, dejar en claro cual es el consenso alcanzado, y que acciones deben tomarse en consecuencia de él, si es que ésto no resulta obvio.
gl: <firstterm>Consenso</firstterm> simplemente quere dicir un acordo que todo o mundo está disposto a aceptar. Non é un estado ambiguo: un grupo chegou a un consenso sobre un asunto particular cando alguén propón que o consenso foi alcanzado, e ninguén contradí esa afirmación. A persoa que propón o consenso debe, por suposto, establecer especificamente o que supón este consenso, e que accións deben tomarse en consecuencia, se non resultaren obvias.

source: Most conversation in a project is on technical topics, such as the right way to fix a certain bug, whether or not to add a feature, how strictly to document interfaces, etc. Consensus-based governance works well because it blends seamlessly with the technical discussion itself. By the end of a discussion, there is often general agreement on what course to take. Someone will usually make a concluding post, which is simultaneously a summary of what has been decided and an implicit proposal of consensus. This provides a last chance for someone else to say "Wait, I didn't agree to that. We need to hash this out some more."
es: La mayoría de las conversaciones de un proyecto son sobre los asuntos técnicos, como el modo correcto de corregir algún error, la conveniencia o no de agregar un asunto, la forma estricta como un documento se enlaza, etc. Un gobierno basado en el consenso funciona bien porque se entrelaza con la discusión técnica y se confunde con ella silenciosamente. Al terminar una discusión, generalmente hay acuerdo sobre cual es el camino a seguir. Alguien hace una intervención conclusiva, que es al mismo tiempo un resumen de lo que se ha ido decidiendo y queda como una propuesta implícita de consenso. Esto ofrece una última oportunidad para que alguien diga &quot;Un momento, no estoy de acuerdo. Debemos reconsiderar esto un poco más&quot;
gl: A maioría das conversacións nun proxecto tratan sobre temas técnicos, como a forma correcta de corrixir algún erro, engadir ou non unha característica, como de estrita ten que ser a documentación das interfaces, etc. O goberno baseado no consenso funciona ben porque mestura á perfección a transparencia e a discusión técnica en si mesma. Ao final dun debate, a miúdo hai un acordo xeral sobre que camiño tomar. Alguén fai unha intervención conclusiva, que é á vez un resumo do que se decidiu e unha proposta implícita de consenso. Isto ofrece unha última oportunidade para que alguén diga "¡Espera, non estou de acordo con iso. Temos que reconsiderar isto un pouco máis".

source: For small, uncontroversial decisions, the proposal of consensus is implicit. For example, when a developer spontaneously commits a bugfix, the commit itself is a proposal of consensus: "I assume we all agree that this bug needs to be fixed, and that this is the way to fix it." Of course, the developer does not actually say that; she just commits the fix, and the others in the project do not bother to state their agreement, because silence is consent. If someone commits a change that turns out <emphasis>not</emphasis> to have consensus, the result is simply for the project to discuss the change as though it had not already been committed. The reason this works is the topic of the next section.
es: En decisiones de poca importancia que no ofrecen discusión, la propuesta de consenso es implícita. Por ejemplo, cuando un desarrollador hace un commit de una reparación de error, el mismo commit es la propuesta de consenso: &quot;Supongo que todos estamos de acuerdo en que este error debe ser corregido, y esta es la manera de hacerlo.&quot; Por supuesto, el desarrollador no lo dice; simplemente hace el commit de la reparación, y los demás no se preocupan de manifestar su acuerdo, porque el silencio es el consentimiento. Si alguien hace el commit de un cambio que resulta <emphasis>no</emphasis> tener consenso, se produce simplemente una discusión sobre el cambio como si todavía no estuviera incluido como cambio. La explicación de por qué esto funciona es el tema de la próxima sección.
gl: Para as pequenas decisións, non controvertidas, a proposta de consenso é implícita. Por exemplo, cando un desenvolvedor realiza un commit non solicitado para a corrección dun erro, o mesmo commit é a proposta de consenso: "Supoño que todos estamos de acordo en que este erro debe ser solucionado, e que este é o xeito de arranxalo". Por suposto, o desenvolvedor non o di explicitamente; só leva a cabo a reparación, e os outros membros do proxecto non se molestan en manifestar o seu acordo, porque o silencio é consentimento. Se alguén realiza un commit que <emphasis>non</emphasis> alcanza o consenso, para o proxecto é simple analizar a mudanza como se aínda non se realizase. A razón de que isto funcione é o tema da próxima sección.

source: Version Control Means You Can Relax
es: Control de Versión Significa que Uno Puede Evitar el Estrés
gl: Control de versións quere dicir que te podes relaxar
