Repository: amaneiro/poss-gl
Catalog: po/*/ch04.po
Languages: es, gl

source: Voting's main advantage is that it finally settles a question so everyone can move on. But it settles it by a head count, instead of by rational dialogue leading everyone to the same conclusion. The more experienced people are with open source projects, the less eager I find them to be to settle questions by vote. Instead they will try to explore previously unconsidered solutions, or compromise more severely than they'd originally planned. Various techniques are available to prevent a premature vote. The most obvious is simply to say "I don't think we're ready for a vote yet," and explain why not. Another is to ask for an informal (non-binding) show of hands. If the response clearly tends toward one side or another, this will make some people suddenly more willing to compromise, obviating the need for a formal vote. But the most effective way is simply to offer a new solution, or a new viewpoint on an old suggestion, so that people re-engage with the issues instead of merely repeating the same arguments.
es: La ventaja principal de la votación es que se cierra la cuestión y se puede seguir adelante. Pero el arreglo se hace por un conteo de votos, en lugar de un diálogo racional que conduzca a todos a la misma conclusión. Cuanto más experiencia tiene la gente en proyectos de fuente abierta, les encuentro menos dispuestas a querer arreglar las cuestiones por medio de la votación. Tratarán primero de explorar las soluciones que previamente no hayan sido consideradas, o entrar en soluciones de compromiso más ajustadas de lo que planearon en un comienzo. Hay varias técnicas para prevenir una votación prematura. La más obvia es decir simplemente &quot;no creo que ya estemos listos para una votación&quot;, y explicar por qué no. La otra es pedir que sin compromiso se levanten las manos. Si la respuesta tiende claramente hacia un lado, necesariamente va a inclinar al otro grupo a querer encontrar soluciones de compromiso, obviando así la necesidad de la votación formal. Pero la manera más efectiva es simplemente ofrecer una solución nueva, o un nuevo punto de vista para una sugerencia antigua, de modo que la gente se re-conecte con los temas en lugar de repetir meramente los mismos argumentos.
gl: A principal vantaxe da votación é que se pecha a cuestión e pódese seguir adiante. Mais o acordo alcánzase por un reconto, en lugar dun diálogo racional que conduza a todos á mesma conclusión. As persoas con máis experiencia en proxectos de software libre, son as que menos ansiosas atopei por alcanzar solucións a través da votación. No seu lugar, tratarán de buscar solucións previamente non consideradas ou transixir máis do que planearan. Existen varias técnicas para previr unha votación prematura. A máis obvia é simplemente dicir "eu non creo que esteamos listos para unha votación", e explicar por que non. Outra é a de solicitar un método informal (non vinculante) a man alzada. Se a resposta tende claramente cara a un lado ou outro, isto fará que, de súpeto, algunhas persoas estean máis dispostos a chegar a un acordo, evitando a necesidade dunha votación formal. Mais a forma máis efectiva é simplemente ofrecer unha solución nova, ou un novo punto de vista sobre unha proposta antiga, para que a xente volva ocuparse dos problemas a tratar en troca de limitárense a repetir os mesmos argumentos.

source: In certain rare cases, everyone may agree that all the compromise solutions are worse than any of the non-compromise ones. When that happens, voting is less objectionable, both because it is more likely to lead to a superior solution and because people will not be overly unhappy no matter how it turns out. Even then, the vote should not be rushed. The discussion leading up to a vote is what educates the electorate, so stopping that discussion early can lower the quality of the result.
es: En algunos casos raros, todos pueden concordar que las soluciones de compromiso presentadas son perores que cualquiera de las soluciones en consideración. Cuando esto ocurre, la votación no es tan objetable, por un lado porque es muy probable que se va a llegar a una solución superior, y por otro porque la gente no se va a desanimar con el resultado, cualquiera sea la opción que gane. Aún en estos casos, no hay que apurarse en votar. La discusión que arriba en una votación es lo que educa al electorado, y detener pronto la discusión puede disminuir la calidad del resultado.
gl: Nalgúns casos isolados, todos poden estar de acordo en que as solucións intermedias son peores que calquera das que non o son. Cando iso ocorre, a votación non é tan cuestionable, tanto porque é máis probable que conduza a unha solución superior como porque a xente non vai estar demasiado descontenta, non importando como resulte. Ata entón, a votación non debe precipitarse. A discusión que desemboca nunha votación é o que educa o electorado, e deter pronto unha discusión pode diminuír a calidade do resultado.

source: (Note that this advice to be reluctant to call votes does not apply to the change-inclusion voting described in <xref linkend="stabilizing-a-release"/><phrase output="printed"> in <xref linkend="development-cycle"/></phrase>. There, voting is more of a communications mechanism, a means of registering one's involvement in the change review process so that everyone can tell how much review a given change has received.)
es: (Fijarse que este consejo de ser reacio a las votaciones no se aplican a la votación sobre cambio-inclusión que se describe en <xref linkend="stabilizing-a-release"/><phrase output="printed"> en <xref linkend="development-cycle"/></phrase>. Allí, la votación es más bien un mecanismo de comunicación, un medio de registrar el propio compromiso en el proceso de revisión de cambio de modo que todos puedan decir cuánta revisión ha recibido un cambio dado.)
gl: (Ten en conta que este consello de ser relutante ás votacións non se aplica á votación sobre mudanza-inclusión que se describe en <xref linkend="estabilizando unha release"/><phrase output="printed"> en <xref linkend="ciclo de desenvolvemento"/></phrase>. Alí, a votación é máis un mecanismo de comunicación, un medio de rexistrar o propio compromiso no proceso de revisión de mudanza para que todos poidan dicir canta atención recibiu unha mudanza determinada).

source: Who Votes?
es: ¿Quién Vota?
gl: Quen vota?

source: Having a voting system raises the question of electorate: who gets to vote? This has the potential to be a sensitive issue, because it forces the project to officially recognize some people as being more involved, or as having better judgement, than others.
es: Al tener un sistema de votación aparece la cuestión del electorado: ¿A quién le corresponde votar? Este asunto puede convertirse en delicado, porque fuerza a que el proyecto reconozca oficialmente que hay gente con mayor compromiso, o con mejores apreciaciones que los otros.
gl: Ter un sistema de votación pon de manifesto a cuestión do electorado: quen vai votar? Isto pode ser un tema delicado, porque obriga a que o proxecto recoñeza oficialmente que hai xente máis involucrada, ou máis valorada que outros.

source: The best solution is to simply take an existing distinction, commit access, and attach voting privileges to it. In projects that offer both full and partial commit access, the question of whether partial committers can vote largely depends on the process by which partial commit access is granted. If the project hands it out liberally, for example as a way of maintaining many third-party contributed tools in the repository, then it should be made clear that partial commit access is really just about committing, not voting. The reverse implication naturally holds as well: since full committers <emphasis>will</emphasis> have voting privileges, they must be chosen not only as programmers, but as members of the electorate. If someone shows disruptive or obstructionist tendencies on the mailing list, the group should be very cautious about making him a committer, even if the person is technically skilled.
es: La mejor solución es simplemente tomar la distinción existente, el acceso a los commits, y asociar los privilegios del voto en eso. En proyectos en que existan accesos completos y parciales a los commits, la cuestión de permitir el voto a los que tienen commit parcial dependerá en gran manera de los procesos por los que el commit parcial fue otorgado. Si el proyecto lo maneja con liberalidad, por ejemplo como una manera de mantener muchas herramientas de contribución de terceras partes en el repositorio, entonces debe dejarse en claro que el acceso al commit parcial hace referencia a los commits, no a la votación. Naturalmente la implicación inversa se mantiene: puesto que los que tienen commit completo <emphasis>tendrán</emphasis> privilegios de votación, deben elegirse no solo como programadores, sino también como miembros del electorado. Si alguien muestra tendencias disruptivas u obstruccionistas en la lista de correo, el grupo debe ser muy cauto en incluirlo entre los que hacen commits, auque sea una persona capacitada técnicamente.
gl: A mellor solución é simplemente tomar unha distinción existente, o acceso a commit, e asociar a isto o privilexio de voto. Nos proxectos que ofrecen permisos tanto parciais como totais, a cuestión de se os committers con acceso parcial poden votar, depende en gran medida do proceso polo cal se concede o acceso parcial a commit. Se o proxecto é administrado dunha forma liberal, por exemplo, como un medio de manter moitas ferramentas de colaboración para terceiras partes no repositorio, debe ficar claro que o acceso a commit parcial é só o dereito de realizar commits, non de voto. Naturalmente a implicación inversa mantense: como os committers con acceso total <emphasis>terán</emphasis> privilexios de voto, estes deben ser elixidos non só como programadores, senón como membros do electorado. Se alguén mostra tendencias que poden producir rupturas ou obstrucións na lista de correo, o grupo debe ser moi cauteloso á hora de facelo committer, ata se a persoa está capacitada tecnicamente.

source: The voting system itself should be used to choose new committers, both full and partial. But here is one of the rare instances where secrecy is appropriate. You can't have votes about potential committers posted to a public mailing list, because the candidate's feelings (and reputation) could be hurt. Instead, the usual way is that an existing committer posts to a private mailing list consisting only of the other committers, proposing that someone be granted commit access. The other committers speak their minds freely, knowing the discussion is private. Often there will be no disagreement, and therefore no vote necessary. After waiting a few days to make sure every committer has had a chance to respond, the proposer mails the candidate and offers him commit access. If there is disagreement, discussion ensues as for any other question, possibly resulting in a vote. For this process to be open and frank, the mere fact that the discussion is taking place at all should be secret. If the person under consideration knew it was going on, and then were never offered commit access, he could conclude that he had lost the vote, and would likely feel hurt. Of course, if someone explicitly asks for commit access, then there is no choice but to consider the proposal and explicitly accept or reject him. If the latter, then it should be done as politely as possible, with a clear explanation: "We liked your patches, but haven't seen enough of them yet," or "We appreciate all your patches, but they required considerable adjustments before they could be applied, so we don't feel comfortable giving you commit access yet. We hope that this will change over time, though." Remember, what you're saying could come as a blow, depending on the person's level of confidence. Try to see it from their point of view as you write the mail.
es: E sistema de votación debe ser usado para elegir a los nuevos miembros que hacen commit, sea completo o parcial. Y aquí aparece una de las circunstancias raras en donde el voto secreto es apropiado. No pueden ponerse los votos para los que hacen commits en una lista de correo pública, porque se pueden herir los sentimientos y la reputación de un candidato. En lugar de eso, la forma común es que los que tienen voto lo pongan en una lista de correo privada donde solamente estén los que pueden hacer commits, para proponer que alguien sea habilitado para hacer commits. De esta manera todos pueden expresarse libremente, sabiendo que la discusión es privada. A menudo no habrá desacuerdo, y no se necesitará votar. Luego de esperar unos días para asegurarse que todos tuvieron oportunidad de responder, el proponente envía un mail al candidato y le ofrece el acceso a los commits. Si hay desacuerdo, se inicia una discusión como para cualquier otro asunto, con la posibilidad de terminar en una votación. Para que este proceso sea abierto y transparente, tambien tiene que ser secreto el hecho que hay una discusión en curso. Si la persona en consideración sabe lo que está ocurriendo, y luego no se le ofrece un acceso de commit, puede concluir que él ha perdido el voto, y sentirse herido por ello. Por supuesto, si alguien explícitamente pide el acceso al commit, entonces no hay nada que hacer sino considerar la propuesta y explícitamente aceptarle o rechazarle. Si ocurre lo segundo, tiene que hacerse con sumo tacto, con una explicación clara: &quot;Nos agradan tus aportes, pero todavía no hemos visto lo suficiente&quot;, o &quot;Hemos tenido en cuenta todos tus aportes, pero se han tenido que hacer considerables ajustes antes de poder aplicarlos, por lo que todavía no nos sentimos confiados para darte el acceso al commit. Esperamos que esto cambie con el tiempo&quot;. Recordar que lo que se dice puede caer como un golpe, dependiendo del grado de confianza que se tenga con la persona. Tratar de verlo desde su punto de vista, en el momento que se escribe el mail.
gl: O sistema de votación debería ser utilizado para elixir os novos committers, tanto con privilexios completos como parciais. Mais aquí é un dos raros casos en que o segredo é apropiado. Non se pode ter os votos sobre os potenciais committers nunha lista de correo pública, porque os sentimentos dos candidatos (e a reputación) poderían resultar feridos. No canto disto, a forma habitual é que un committer actual envíe a unha lista de correo privada, formada só por committers, a proposta de que lle sexan concedidos permisos de commit a alguén. Deste xeito todos poden expresarse libremente, sabendo que a discusión é privada. A miúdo, non haberá desacordo, e polo tanto non se necesitará votar. Logo de esperar uns días para asegurarse de que todos tiveron a oportunidade de responder, o propoñente envía un mail ao candidato e ofrécelle permisos de commit. Se hai desacordo, iníciase unha discusión como para calquera outra cuestión, resultando posiblemente nunha votación. Para que este proceso sexa aberto e franco, o mero feito de que se está a levar a cabo debería ser totalmente secreto. Se a persoa en cuestión sabía o que estaba pasando, e logo non se ofrece o acceso a commit, pode concluír que perdeu a votación, e probablemente sentirse ferido. Por suposto, se alguén explicitamente pide o acceso ao commit, entón non hai máis remedio que considerar a proposta e explicitamente aceptalo ou rexeitalo. Neste último caso, entón debe facerse con sumo tacto, cunha explicación clara: "Gústannos os teus remendos, mais aínda non demostran o suficiente" ou "apreciamos todos os teus remendos, mais necesitaron considerables axustes antes de poder ser aplicados, polo que aínda non nos sentimos cómodos concedéndoche permisos de commit. Aínda que esperamos que isto mude co tempo". Recorda que o que se di pode caer como un golpe, dependendo do nivel de confianza coa persoa. Trata de velo desde o seu punto de vista cando escribas o email.

source: Because adding a new committer is more consequential than most other one-time decisions, some projects have special requirements for the vote. For example, they may require that the proposal receive at least <emphasis>n</emphasis> positive votes and no negative votes, or that a supermajority vote in favor. The exact parameters are not important; the main idea is to get the group to be careful about adding new committers. Similar, or even stricter, special requirements can apply to votes to <emphasis>remove</emphasis> a committer, though hopefully that will never be necessary. See <xref linkend="committers"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase> for more on the non-voting aspects of adding and removing committers.
es: Puesto que agregar un nuevo miembro que pueda hacer commits es una decisión más secuencial que otras decisiones, algunos proyectos tienen requerimientos especiales para el voto. Por ejemplo, puede requerirse que la propuesta reciba por lo menos <emphasis>n</emphasis> votos positivos y que no tenga ningún voto negativo, o que cierta supermayoría vote a favor. Los parámetros exactos no son importantes; la idea principal es que el grupo debe ser cuidadoso al otorgar acceso a los commits. Similarmente, o todavía más estrictamente, se aplican requerimientos especiales a la votación para <emphasis>quitar</emphasis> el acceso a los commits, y ojalá que eso nunca sea necesario. Ver<xref linkend="committers"/><phrase output="printed"> en <xref linkend="managing-volunteers"/></phrase> para más aspectos sobre la no votación para agregar o quitar acceso a los commits.
gl: Posto que adicionar un novo committer é máis importante que a maioría de decisións puntuais, algúns proxectos teñen requirimentos especiais para o voto. Por exemplo, poderase esixir que a proposta reciba polo menos n votos positivos e ningún voto negativo, ou que certa supermaioría vote a favor. Os parámetros exactos non son importantes, a idea principal é conseguir que o grupo debe ser coidadoso ao engadir novos committers. Similares requirimentos especiais, ou ata máis estritos, débense aplicar nas votacións para <emphasis>eliminar</emphasis> committers, aínda que oxalá que iso nunca sexa necesario. Ver <xref linkend="committers"/><phrase output="printed"> en <xref linkend="xestionando voluntarios"/></phrase> para máis información sobre aspectos ademais dos relacionados coa votación engadindo e eliminando committers.

source: Polls Versus Votes
es: Encuestas Versus Votaciones
gl: Enquisas versus votacións

source: For certain kinds of votes, it may be useful to expand the electorate. For example, if the developers simply can't figure out whether a given interface choice matches the way people actually use the software, one solution is to ask to all the subscribers of the project's mailing lists to vote. These are really <firstterm>polls</firstterm> rather than votes, but the developers may choose to treat the result as binding. As with any poll, be sure to make it clear to the participants that there's a write-in option: if someone thinks of a better option not offered in the poll questions, her response may turn out to be the most important result of the poll.
es: Para ciertas clases de votaciones, puede ser útil expandir el electorado. Por ejemplo, si los desarrolladores no tienen una idea clara para decidir si una interfase dada se adapta al modo como la gente realmente usa el software, una solución es hacer una votación entre todos los suscriptos en la lista de correo del proyecto. Estas son realmente <firstterm>encuestas</firstterm> más que votaciones, pero los desarrolladores pueden acordar que los resultados sean vinculantes. Como en cualquier votación, hay que asegurarse de informar a los participantes que hay una opción escrita: si a alguien se le ocurre una opción mejor que no está en la lista, su respuesta puede llegar a ser el resultado más importante de la votación.
gl: Para certas clases de votacións, pode ser útil ampliar o electorado. Por exemplo, se os desenvolvedores non poden determinar se unha interface dada coincide co xeito coa xente realmente usa o software, unha solución é pedir que voten todos os subscritores das listas de correo do proxecto. Estas son realmente <firstterm>enquisas</firstterm> en lugar de votacións, mais os desenvolvedores poden optar por tratar os resultados como vinculantes. Como en calquera votación, asegúrate de deixares claro aos participantes que existe a opción de incluír novas opcións: se alguén pensa nunha opción mellor que non está na lista, esta resposta pode chegar a ser o resultado máis importante da enquisa.

source: Vetoes
es: Vetos
gl: Vetos

source: Some projects allow a special kind of vote known as a <firstterm>veto</firstterm>. A veto is a way for a developer to put a halt to a hasty or ill-considered change, at least long enough for everyone to discuss it more. Think of a veto as somewhere between a very strong objection and a filibuster. Its exact meaning varies from one project to another. Some projects make it very difficult to override a veto; others allow them to be overridden by regular majority vote, perhaps after an enforced delay for more discussion. Any veto should be accompanied by a thorough explanation; a veto without such an explanation should be considered invalid on arrival.
es: Algunos proyectos permiten un tipo especial de voto que se conoce como <firstterm>veto</firstterm>. El veto es la manera que tiene un desarrollador para detener un cambio apresurado o mal considerado, por lo menos por un tiempo suficiente para que todos puedan discutirlo más. Entender el veto como algo que está entre una objeción fuerte y una discusión sin fin. El sentido exacto del veto varía de un proyecto a otro. Algunos proyectos hacen que sea difícil contrarrestar un veto; otros permiten que sea superado por el voto de una simple mayoría, quizás luego de una forzada demora producida por más discusión. Un veto debe ser acompañado por una explicación exhaustiva; el veto presentado sin esa explicación debe ser considerado inválido.
gl: Algúns proxectos permiten un tipo especial de dereito que se coñece como <firstterm>veto</firstterm>. O veto é unha forma para que un desenvolvedor poida deter unha mudanza apresurada ou mal considerada, polo menos o tempo suficiente para que todos poidan discutila máis a fondo. Pensa no veto como algo que se sitúa entre unha forte obxección e unha manobra obstrucionista. O seu significado exacto varía dun proxecto a outro. Algúns proxectos fan que sexa moi difícil invalidar un veto; outros permiten que sexa superado polo voto da maioría, quizais logo dunha demora forzada para poder examinar máis o tema. Un veto debe ser acompañado por unha explicación exhaustiva; o veto presentado sen esa explicación debe ser considerado inválido.
