Repository: amaneiro/poss-gl
Catalog: po/*/ch04.po
Languages: es, gl

source: The fact that the project's source code is kept under version control means that most decisions can be easily unmade. The most common way this happens is that someone commits a change mistakenly thinking everyone would be happy with it, only to be met with objections after the fact. It is typical for such objections to start out with an obligatory apology for having missed out on prior discussion, though this may be omitted if the objector finds no record of such a discussion in the mailing list archives. Either way, there is no reason for the tone of the discussion to be different after the change has been committed than before. Any change can be reverted, at least until dependent changes are introduced (i.e., new code that would break if the original change were suddenly removed). The version control system gives the project a way to undo the effects of bad or hasty judgement. This, in turn, frees people to trust their instincts about how much feedback is necessary before doing something.
es: Mantener el código fuente del proyecto bajo el control de versión significa que la mayoría de las decisiones pueden fácilmente deshacerse. La manera corriente para que esto pase es que alguien haga commit de un cambio pensando que todos van a aceptarlo con gusto, y después encontrarse con las objeciones ante el hecho. Una forma típica de esas objeciones es comenzar con las disculpas del caso por no haber intervenido en discusiones anteriores, aunque esto se puede omitir si el discrepante no encuentra registros de tales discusiones en los archivos de la lista de correos. En cualquier caso, no hay motivos para que el tono de la discusión sea diferente después del cambio introducido que antes. Cualquier cambio puede ser revertido, al menos antes de que se introduzcan cambios dependientes (es decir, nuevo código que se daña si el cambio original es quitado de repente). El sistema de control de versión permite que el proyecto deshaga los efectos de malas ideas o propuestas ligeras. Esto, a su vez, le da la libertad a la gente para que confíe en sus instintos y aprenda cuanta consulta es necesaria antes de hacer algo.
gl: O feito de que o código fonte do proxecto fique baixo un sistema de control de versións quere dicir que a maioría das decisións poden facilmente desfacerse. O caso máis común no que isto ocorre é que alguén realiza un commit pensando, erroneamente, que todo o mundo estará de acordo con esa mudanza, soamente atopándose coas obxeccións despois de que se realizou. É típico desas obxeccións comezar obrigatoriamente desculpándose por non intervir no debate previo, aínda que isto pode omitirse se o obxector non atopa ningún rexistro dese debate nos arquivos da lista de correo. De todos modos, non hai ningunha razón para que o ton da discusión sexa diferente despois do commit que antes. Calquera mudanza pode ser revertida, polo menos ata que se introduzan mudanzas dependentes (é dicir, novo código que fallaría se as mudanzas realizadas son eliminadas subitamente). O sistema de control de versións ofrece ao proxecto un xeito de desfacer os efectos de malas ideas ou apresuradas. Isto, á súa vez, outorga liberdade á xente para confiar nos seus instintos sobre canto "feedback" é necesario antes de facer algo.

source: This also means that the process of establishing consensus need not be very formal. Most projects handle it by feel. Minor changes can go in with no discussion, or with minimal discussion followed by a few nods of agreement. For more significant changes, especially ones with the potential to destabilize a lot of code, people should wait a day or two before assuming there is consensus, the rationale being that no one should be marginalized in an important conversation simply because he didn't check email frequently enough.
es: También significa que el proceso de consensuar no necesita ser muy formal. Muchos proyectos manejan esto por instinto. Los cambios menores pueden ir sin discusión, o con una discusión mínima seguida por algunos acuerdos. En cambios de mayor importancia, especialmente aquellos que pueden desestabilizar una parte del código, la gente espera uno o dos días antes de suponer que hay consenso. La razón es que nadie puede ser dejado de lado en una conversación importante simplemente por no haber inspeccionado su correo con la frecuencia debida.
gl: Isto tamén quere dicir que o proceso de establecer un consenso non necesita ser moi formal. Moitos proxectos manexan isto por instinto. As mudanzas menores pódense levar a cabo sen discusión, ou cunha discusión mínima seguida por algúns xestos de asentimento. Para as mudanzas máis significativas, especialmente aquelas co suficiente potencial para desestabilizar unha cantidade considerable de código, as persoas deben esperar un día ou dous antes de asumiren que existe consenso. A razón de ser disto é que ninguén debe ser marxinado nunha negociación importante simplemente porque non comproba o seu correo electrónico coa frecuencia suficiente.

source: Thus, when someone is confident he knows what needs to be done, he should just go ahead and do it. This applies not only to software fixes, but to web site updates, documentation changes, and anything else unlikely to be controversial. Usually there will be only a few instances where an action needs to be undone, and these can be handled on a case-by-case basis. Of course, one shouldn't encourage people to be headstrong. There is still a psychological difference between a decision under discussion and one that has already taken effect, even if it is technically reversible. People always feel that momentum is allied to action, and will be slightly more reluctant to revert a change than to prevent it in the first place. If a developer abuses this fact by committing potentially controversial changes too quickly, however, people can and should complain, and hold that developer to a stricter standard until things improve.
es: Entonces, cuando alguien se siente seguro que sabe lo que tiene que hacer, no para en mientes y lo hace. Esto se aplica no sólo al software fijo, sino a las actualizaciones de la Web, a cambios en la documentación y a cualquier otra cosa que no sea controversial. Generalmente se darán pocos casos en los que la acción tenga que ser deshecha, y estos pueden ser tratados individualmente en cada caso. Por supuesto que no se debe incentivar a la gente para que sea obstinada. Hay todavía una diferencia psicológica entre una decisión bajo discusión y una que ya haya tenido efecto, por más que se diga que es técnicamente reversible. La gente siente que el momento es un aliado de la acción, y que se sentirán más reacios a revertir un cambio que a prevenirlo en el primer instante. Si un desarrollador se abusa de este principio y rápidamente hace commits de cambios que generan controversia, ciertamente la gente puede y debe quejarse, y mantener a ese desarrollador en un estándar estricto hasta que las cosas mejoren.
gl: Así, cando alguén estiver seguro de que sabe o que hai que facer, debería seguir adiante e facelo. Isto aplícase non só ao software, senón tamén ás actualizacións do sitio web, mudanzas na documentación, e calquera outra cousa que non suscite controversia. Polo xeral só haberá uns poucos casos en que unha acción deba ser rectificada, e estas poden ser tratadas caso por caso. Por suposto, non se debe animar a xente a que sexa demasiado obstinada. Hai aínda unha diferenza psicolóxica entre unha decisión baixo discusión e unha que xa foi efectuada, mesmo se for tecnicamente reversible. A xente sempre sente que o impulso está unido á acción, e serán un pouco máis relutantes a reverteren unha mudanza que a previla nun primeiro momento. Se un desenvolvedor abusa deste feito, efectuando commits potencialmente controvertidos demasiado rápido, a xente pode e debe queixarse, aplicándolle a este desenvolvedor unhas normas máis estritas ata que isto mellore.

source: When Consensus Cannot Be Reached, Vote
es: Cuando No Se Puede Tener Consenso, Vote
gl: Cando o consenso non pode ser alcanzado, votación

source: Inevitably, some debates just won't consense. When all other means of breaking a deadlock fail, the solution is to vote. But before a vote can be taken, there must be a clear set of choices on the ballot. Here, again, the normal process of technical discussion blends serendipitously with the project's decision-making procedures. The kinds of questions that come to a vote often involve complex, multifaceted issues. In any such complex discussion, there are usually one or two people playing the role of <firstterm>honest broker</firstterm>: posting periodic summaries of the various arguments and keeping track of where the core points of disagreement (and agreement) lie. These summaries help everyone measure how much progress has been made, and remind everyone of what issues remain to be addressed. Those same summaries can serve as prototypes for a ballot sheet, should a vote become necessary. If the honest brokers have been doing their job well, they will be able to credibly call for a vote when the time comes, and the group will be willing to use a ballot sheet based on their summary of the issues. The brokers themselves may be participants in the debate; it is not necessary for them to remain above the fray, as long as they can understand and fairly represent others' views, and not let their partisan sentiments prevent them from summarizing the state of the debate in a neutral fashion.
es: Inevitablemente, algunos debates no llegarán al consenso. Cuando no haya otro medio de salir del callejón, la solución es votar. Pero antes que se llegue a la votación, debe aclararse unas cuantas opciones del ballotage. De nuevo en este caso el proceso de discusión técnica se integra suavemente con los procedimientos de toma de decisión del proyecto. El tipo de asuntos que llega a votación implican a menudo temas complejos, llenos de facetas. En cualquiera de tales discusiones complicadas, hay a menudo una o dos personas que hacen las veces de <firstterm>negociador honesto</firstterm>: aportan periódicamente la síntesis de los argumentos y siguen las líneas de los puntos centrales del desacuerdo (y del acuerdo). Estas síntesis ayudan a que todos estimen el progreso que se va haciendo, y les recuerda a todos cuáles asuntos quedan pendientes. Estas síntesis podrán servir como modelos para una propuesta de votación, en caso de que ésta se vuelva necesaria. Si los negociadores honestos se han desempeñado bien en su oficio, estarán en condiciones de llamar a votación cuando llegue el tiempo, y todos querrán usar las propuestas vertidas en esas síntesis para organizar la votación. Los negociadores también serán partícipes del debate; no es necesario que ellos queden fuera de la votación, en tanto puedan entender y representar los puntos de vista de los demás, y no dejen que sus sentimientos partidarios les impidan producir síntesis del estado del debate en una forma neutral.
gl: Inevitablemente, algúns debates non chegarán ao consenso. Cando fallan todos os outros medios de saír do estancamento, a solución é votar. Mais antes de levar a cabo a votación, debe existir un claro conxunto de opcións nas papeletas. Aquí, de novo, o proceso normal de discusión técnica intégrase, case casualmente, cos procedementos de toma de decisións do proxecto. Os tipos de preguntas que teñen lugar na votación entrañan a miúdo asuntos complexos e polifacéticos. En calquera debate tan complexo, hai xeralmente unha ou dúas persoas exercendo o papel de <firstterm>intermediario honesto</firstterm>: expondo periodicamente resumos dos diversos argumentos e facendo un seguimento de onde residen os puntos centrais de desacordo (e acordo). Estes resumos axudan a medir o grao de progreso alcanzado, e recordar que cuestións quedan por resolver. Estas sínteses poden servir como modelos para unha papeleta de votación, en caso de ser necesaria esta. Se os intermediarios honestos fixeron ben o seu traballo, estarán en condicións de chamar á votación cando chegar o momento, e o grupo estará disposto a usar a papeleta de votación baseada no seu resumo das cuestións a resolver. Os intermediarios tamén participarán no debate; non é necesario que fiquen fóra da contenda, a condición de que poidan entender e representar as opinións dos demais, e non deixen que os seus sentimentos partidistas lles impidan sintetizar o estado do debate dunha forma neutral.

source: The actual content of the ballot is usually not controversial. By the time matters reach a vote, the disagreement has usually boiled down to a few key issues, with recognizable labels and brief descriptions. Occasionally a developer will object to the form of the ballot itself. Sometimes his concern is legitimate, for example, that an important choice was left off or not described accurately. But other times a developer may be merely trying to stave off the inevitable, perhaps knowing that the vote probably won't go his way. See <xref linkend="difficult-people"/><phrase output="printed"> in <xref linkend="communications"/></phrase> for how to deal with this sort of obstructionism.
es: Normalmente la organización de la votación no cae en la controversia. Cuando llega el tiempo de votar, el desacuerdo ha sido analizado y reducido a unas pocas cuestiones, bien etiquetadas y acompañadas de descripciones concisas. De vez en cuando un desarrollador hará una objeción sobre la forma de votar. A veces esta preocupación es legítima, por ejemplo, cuando una opción importante ha sido dejada de lado o no ha sido presentada con precisión. Pero otras veces un desarrollador puede tratar de impedir lo inevitable, quizás porque se da cuenta que el voto no va acompañar su idea. Ver<xref linkend="difficult-people"/><phrase output="printed"> en <xref linkend="communications"/></phrase> para ver como tratar este tipo de obstruccionismo.
gl: O contido real da votación non acostuma ser polémico. Por cuestións de tempo, ao chegar a unha votación, o desacordo foi reducido a unhas poucas cuestións, ben etiquetadas e con descricións breves. Ocasionalmente, un desenvolvedor oporase á forma da votación mesma. Ás veces esta preocupación é lexítima, por exemplo, que unha opción importante sexa deixada de lado ou que non se describa con precisión. Mais outras veces un desenvolvedor pode tratar de impedir o inevitable, tal vez por saber que o voto non vai ir no seu sentido. Ver <xref linkend="difficult-people"/><phrase output="printed"> en <xref linkend="communications"/></phrase> para saber como facer fronte a este tipo de obstrucionismo.

source: Remember to specify the voting system, as there are many different kinds, and people might make wrong assumptions about which procedure is being used. A good choice in most cases is <firstterm>approval voting</firstterm>, whereby each voter can vote for as many of the choices on the ballot as he likes. Approval voting is simple to explain and to count, and unlike some other methods, it only involves one round of voting. See <ulink url="http://en.wikipedia.org/wiki/Voting_system#List_of_systems"></ulink> for more details about approval voting and other voting systems, but try to avoid getting into a long debate about which voting system to use (because, of course, you will then find yourself in a debate about which voting system to use to decide the voting system!). One reason approval voting is a good choice is that it's very hard for anyone to object to&mdash;it's about as fair as a voting system can be.
es: Recuerde de especificar el sistema de votación, puesto que hay varias formas, y la gente puede tener falsas expectativas sobre el procedimiento que va a ser usado. Una buena opción es la <firstterm>votación por aprobación</firstterm>, en la que cada votante puede votar por todas las opciones que quiera, dentro de las opciones presentadas. La votación por aprobación se resuelve simplemente explicando y contando, y a diferencia de otros métodos, solo requiere una ronda de votación. Ver <ulink url="http://en.wikipedia.org/wiki/Voting_system#List_of_systems"></ulink> para mas detalles acerca de la votación por aprobación y otros sistemas de votación, pero tratar de no caer en un debate largo sobre cuál deba ser el sistema que se use (ya que se verán atrapados en el círculo de tener que votar para decidir cómo votar!) Una razón para defender la votación por aprobación como una buena opción es que es difícil que alguien se oponga&mdash;es lo más transparente que puede ser una votación.
gl: Recorda que se debe especificar o sistema de votación, xa que hai moitos tipos diferentes, e a xente pode ter falsas expectativas sobre o procedemento que se utiliza. Unha boa elección na maioría dos casos é o <firstterm>voto de aprobación</firstterm>, a través do cal cada elector pode votar por tantas opcións como desexe. O voto de aprobación é fácil de explicar e recontar, e a diferenza doutros métodos, só require unha rolda de votación. Consulta <ulink url="http://en.wikipedia.org/wiki/Voting_system#List_of_systems"></ulink> para obteres máis detalles acerca da votación de aprobación e outros sistemas de votación, mais debes tratar de evitar entrar nun longo debate sobre que sistema de votación utilizar (porque, por suposto, pódeste atopar nun debate sobre que sistema de votación utilizar para decidir o sistema de votación!). Unha razón para escolleres o voto de aprobación como unha boa opción é que é moi difícil para alguén oporse a este&mdash;é tan xusto como un sistema de votación pode chegar a ser.

source: Finally, conduct votes in public. There is no need for secrecy or anonymity in a vote on matters that have been debated publicly anyway. Have each participant post her votes to the project mailing list, so that any observer can tally and check the results for herself, and so that everything is recorded in the archives.
es: Finalmente, voto secreto, voto abierto. No hay necesidad de guardar secretos o aparecer como anónimos en una votación sobre asuntos que se han debatido públicamente. Cada participante pone su voto en la lista de correo del proyecto, de modo que cualquier observador pueda hacer el conteo y verificar el resultado, y que todo quede archivado.
gl: Para rematar, débense administrar as votacións publicamente. Non hai necesidade de segredos ou anónimos nunha votación sobre os asuntos que se debateron publicamente. Cada participante envía o seu voto á lista de correo do proxecto, de modo que calquera observador poida facer o reconto e verificar os resultados por si mesmo, e así fique todo rexistrado nos arquivos.

source: When To Vote
es: Cuando Se Debe Votar
gl: Cando votar

source: The hardest thing about voting is determining when to do it. In general, taking a vote should be very rare&mdash;a last resort for when all other options have failed. Don't think of voting as a great way to resolve debates. It isn't. It ends discussion, and thereby ends creative thinking about the problem. As long as discussion continues, there is the possibility that someone will come up with a new solution everyone likes. This happens surprisingly often: a lively debate can produce a new way of thinking about the problem, and lead to a proposal that eventually satisfies everyone. Even when no new proposal arises, it's still usually better to broker a compromise than to hold a vote. After a compromise, everyone is a little bit unhappy, whereas after a vote, some people are unhappy while others are happy. From a political standpoint, the former situation is preferable: at least each person can feel he extracted a price for his unhappiness. He may be dissatisfied, but so is everyone else.
es: Lo más difícil en la votación es determinar cuando se debe votar. Generalmente la votación tiene que ser algo fuera de lo común&mdash;el último resorte cuando todas las otras opciones han fallado. No tome a la votación como el gran camino para resolver los debates. No lo es. Finaliza la discusión, y por tanto finaliza el pensamiento creativo sobre el problema. Mientras la discusión está en el tapete, existe la posibilidad de que alguien aporte una solución nueva, que sea del agrado de todos. Sorprendentemente, esto ocurre a menudo: un debate abierto puede producir un giro nuevo del pensamiento sobre el problema, y llevar a una propuesta que eventualmente satisfaga a todos. Aún cuando no surja una propuesta nueva, todavía es mejor negociar una solución de compromiso que poner un voto. Luego de una solución de compromiso, todos quedan algo insatisfechos, mientras que después de una votación unos quedan contentos y otros en desánimo. Desde un punto de vista político, la primera situación es preferible: al menos cada uno puede sentir que su desánimo es el precio de su accionar. Puede estar insatisfecho, pero todos lo están.
gl: O máis difícil da votación é determinar cando é necesario realizala. Levar a cabo unha votación debería ser algo pouco frecuente&mdash;o último recurso cando todas as opcións fracasaron. Non se debe pensar na votación como unha gran solución para resolver discusións. Non o é. Finaliza a discusión, e polo tanto, tamén acaba coa creatividade sobre como resolver o problema. Mentres a discusión continúa, existe a posibilidade de que alguén apareza cunha nova solución que lle guste a todos. Sorprendentemente, isto ocorre a miúdo: un debate aberto pode producir unha nova forma de pensar sobre o problema, e dar lugar a unha proposta que finalmente satisfaga a todos. Embora non xurda unha proposta nova, é mellor negociar unha solución intermedia a que teña lugar unha votación. Logo de alcanzar un compromiso, todos están un pouco tristes, mentres que logo dunha votación, algunhas persoas non están contentas e outros son felices. Desde un punto de vista político, a primeira situación é preferible: polo menos cada persoa pode sentir que obtén algo en troca da súa infelicidade. Pode estar insatisfeito, mais todos o están.
