Repository: amaneiro/poss-gl
Catalog: po/*/ch04.po
Languages: es, gl

source: Social and Political Infrastructure
es: Infraestructura Social y Política
gl: Infraestrutura social e política

source: The first questions people usually ask about free software are "How does it work? What keeps a project running? Who makes the decisions?" I'm always dissatisfied with bland responses about meritocracy, the spirit of cooperation, code speaking for itself, etc. The fact is, the question is not easy to answer. Meritocracy, cooperation, and running code are all part of it, but they do little to explain how projects actually run on a day-to-day basis, and say nothing about how conflicts are resolved.
es: Las primeras preguntas que la gente se hace sobre el software libre son &quot;¿Cómo funciona? ¿Cómo se mantiene el proyecto? ¿Quién toma las decisiones? Siempre quedo insatisfecho con respuestas conciliadoras sobre la estima del mérito, el espíritu de cooperación, el código que se expresa por si mismo, etc. El caso es que sobre esto no hay una respuesta fácil. La meritocracia, la cooperación, y un código que funciona son partes de ella, pero aportan muy poco para explicar como funciona realmente un proyecto en el andar de todos los días, y nada dice sobre cómo se resuelven los conflictos.
gl: Xeralmente, as primeiras cuestións que a xente acostuma facer sobre o software libre son: Como traballa?Que mantén un proxecto activo?Quen toma as decisións? Eu sempre me dou por satisfeito con respostas conciliadoras sobre meritocracia, o espírito de cooperación, o código fala por si mesmo, etc. O feito é que a cuestión non é fácil de responder. Meritocracia, cooperación e executar código son parte deste, mais non chegan a explicar como os proxectos funcionan no día a día, e non din nada sobre como son resoltos os conflitos.

source: This chapter tries to show the structural underpinnings successful projects have in common. I mean "successful" not just in terms of technical quality, but also operational health and survivability. Operational health is the project's ongoing ability to incorporate new code contributions and new developers, and to be responsive to incoming bug reports. Survivability is the project's ability to exist independently of any individual participant or sponsor&mdash;think of it as the likelihood that the project would continue even if all of its founding members were to move on to other things. Technical success is not hard to achieve, but without a robust developer base and social foundation, a project may be unable to handle the growth that initial success brings, or the departure of charismatic individuals.
es: Este capítulo trata de mostrar la estructura subyacente que los proyectos exitosos tienen en comun. Me refiero con el término &quot;exitosos&quot; no solamente a la calidad técnica, sino también a la salud operacional y la capacidad de sobrevivencia. La salud operacional es la capacidad efectiva del proyecto de incorporar las contribuciones de nuevos códigos y nuevos desarrolladores, y de asumir la responsabilidad de los informes de errores que ingresan. Capacidad de sobrevivencia es la posibilidad de que el proyecto exista independientemente de algún participante o auspiciante en particular&mdash; tómelo como la posibilidad que tiene el proyecto para continuar aún cuando alguno de sus miembros fundadores tuviera que pasar a ocuparse de otras cosas. El éxito técnico no es difícil de alcanzar, pero sin una base robusta de desarrollo y un fundamento social, un proyecto puede resultar incapaz de manejar el crecimiento que el éxito inicial aporta, o la ausencia de algún individuo carismático.
gl: Este capítulo trata de mostrar a estrutura subxacente que os proxectos de éxito teñen en común. Refírome a "éxito" non só en termos de calidade técnica, senón tamén á saúde operacional e de supervivencia. Saúde operacional é a capacidade efectiva do proxecto de incorporar as novas contribucións de código e novos desenvolvedores, e para dar resposta aos informes de erros. Supervivencia é a capacidade do proxecto de existir independentemente dalgún participante ou patrocinador, entendendo isto como a probabilidade de que o proxecto continúe, ata se todos os seus membros fundadores tivesen que pasar a outras cousas. O éxito técnico non é difícil de atinxir, mais sen unha base robusta de desenvolvemento e base social, un proxecto pode ser incapaz de manexar o crecemento que trae o éxito inicial ou a saída de persoas carismáticas.

source: There are various ways to achieve this kind of success. Some involve a formal governance structure, by which debates are resolved, new developers are invited in (and sometimes out), new features planned, and so on. Others involve less formal structure, but more conscious self-restraint, to produce an atmosphere of fairness that people can rely on as a <foreignphrase>de facto</foreignphrase> form of governance. Both ways lead to the same result: a sense of institutional permanence, supported by habits and procedures that are well understood by everyone who participates. These features are even more important in self-organizing systems than in centrally-controlled ones, because in self-organizing systems, everyone is conscious that a few bad apples can spoil the whole barrel, at least for a while.
es: Hay varias maneras de alcanzar este tipo de éxito. Algunas suponen una estructura formal de supervisión, por la que se resuelven los debates, se aceptan (o rechazan) nuevos desarrolladores, se planifican nuevas características, etc. Otras requieren menos estructura formal, pero más aplicación en conciencia, para producir una atmósfera de armonía en la que la gente puede confiar como una forma<foreignphrase>de facto</foreignphrase> de supervisión. Ambos caminos llevan al mismo resultado: un sentido de permanencia institucional, ayudado por los hábitos y procedimientos que son bien comprendidos por todos los que participan. Estas características son todavía más importantes en los sistemas que se organizan a si mismos que en aquellos que están controlados centralmente, porque en los sistemas que se organizan a si mismos, cada uno es conciente que unas pocas manzanas pueden arruinar todo el cajón, al menos por un tiempo.
gl: Hai varios xeitos de lograr este tipo de éxito. Nalgúns casos supón dispoñer dunha estrutura formal de goberno, na que se resolven os debates, convídanse (ou expúlsanse) novos desenvolvedores, planifícanse novas características, etc. Outros requiren dunha estrutura menos formal, mais tense que facer un esforzo maior de autocontrol para producir unha atmosfera de equidade na que a xente pode confiar coma unha forma de goberno <foreignphrase>de facto</foreignphrase>. Ambas formas conducen ao mesmo resultado: un sentimento de permanencia institucional, apoiado por hábitos e procedementos que son entendidos por todas as persoas que participan. Estas características son aínda máis importantes nos sistemas auto-organizados que nos centralizados, xa que nos sistemas auto-organizados, todos son conscientes de que unhas poucas mazás apodrecidas poden apodrecer todo o cesto, polo menos durante un tempo.

source: Forkability
gl: Posibilidade de escisión (forkability)

source: The indispensable ingredient that binds developers together on a free software project, and makes them willing to compromise when necessary, is the code's <firstterm>forkability</firstterm>: the ability of anyone to take a copy of the source code and use it to start a competing project, known as a <firstterm>fork</firstterm>. The paradoxical thing is that the <emphasis>possibility</emphasis> of forks is usually a much greater force in free software projects than actual forks, which are very rare. Because a fork is bad for everyone (for reasons examined in detail in <xref linkend="forks"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>), the more serious the threat of a fork becomes, the more willing people are to compromise to avoid it.
es: El ingrediente indispensable que une a los desarrolladores en un proyecto de software libre, y que los lleva a comprometerse cuando es necesario es la <firstterm>&quot;forkabilidad&quot;</firstterm> del código: la capacidad de cada uno de tomar una copia del código fuente y usarlo para abrir un proyecto que compita con el original, evento que se conoce como <firstterm>&quot;fork&quot;</firstterm>. Lo que aparece como paradójico aquí es que <emphasis>la posibilidad</emphasis> de los &quot;forks&quot; es una fuerza mucho mayor en los proyectos de software libre que los &quot;forks&quot; reales, los que son muy raros. Puesto que un &quot;fork&quot; es malo para todos (por razones que se examinan en detalle en <xref linkend="forks"/><phrase output="printed"> en <xref linkend="managing-volunteers"/></phrase>), cuanto más seria sea la amenaza de un &quot;fork&quot;, tanto mas son las personas que se comprometen a evitarlo.
gl: O ingrediente indispensable que une os desenvolvedores nun proxecto de software libre, e fai que estean dispostos a comprometérense cando for necesario, é a <firstterm>capacidade de escisión (forkability)</firstterm> do código: a capacidade de calquera de coller unha copia do código fonte e utilizala para iniciar un proxecto en concorrencia, coñecido como "fork".O paradoxo é que a <emphasis>posibilidade </emphasis>de escisión (fork) é unha forza moito maior nos proxectos de software libre que as escisións actuais, as cales son moi raras. Xa que unha escisión é mala para todos (por motivos examinados en detalle en <xref linkend="forks"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>), canto mais alto sexa o risco de escisión, máis dispostos a comprometerse para evitalo estarán os membros.

source: Forks, or rather the potential for forks, are the reason there are no true dictators in free software projects. This may seem like a surprising claim, considering how common it is to hear someone called the "dictator" or "tyrant" in a given open source project. But this kind of tyranny is special, quite different from the conventional understanding of the word. Imagine a king whose subjects could copy his entire kingdom at any time and move to the copy to rule as they see fit. Would not such a king govern very differently from one whose subjects were bound to stay under his rule no matter what he did?
es: Los &quot;forks&quot;, o más bien la posibilidad de que se produzca un &quot;fork&quot;, es la razón por la cual no hay verdaderos dictadores en los proyectos de software libre. Esto puede ser una expresión sorprendente, considerando que es muy común oir que alguien es llamado el &quot;dictador&quot; o el &quot;tirano&quot; en algún proyecto de fuente abierta. Pero esta tiranía es especial, muy diferente de lo que comúnmente se entiende por esa palabra. Imaginaos un rey cuyos súbditos pudieran copiar todo su reino en cualquier momento y trasladarse a la copia para gobernarla como creen que corresponde. ¿No sería el gobierno de ese rey muy diferente de otro cuyos súbditos están obligados a permanecer bajo su gobierno, sin importar lo que él haga?
gl: As escisións, ou máis ben as escisións potenciais, son a razón de que non existan verdadeiros ditadores nos proxectos de software libre. Isto pode parecer unha afirmación sorprendente, considerando que é común oír como alguén é cualificado de "ditador" ou "tirano" nalgún proxecto de código aberto. Mais este tipo de tiranía é especial, moi diferente da interpretación convencional da palabra. Imaxinádevos un rei cuxos súbditos puidesen copiar todo o seu reino en calquera momento e pasar á copia para gobernala como mellor lles parecese. Non sería o goberno dese rei moi diferente doutro cuxos súbditos estiveren obrigados a permanecer baixo o seu mandato, sen importar o que fixer?

source: This is why even projects that are not formally organized as democracies are, in practice, democracies when it comes to important decisions. Replicability implies forkability; forkability implies consensus. It may well be that everyone is willing to defer to one leader (the most famous example being Linus Torvalds in Linux kernel development), but this is because they <emphasis>choose</emphasis> to do so, in an entirely non-cynical and non-sinister way. The dictator has no magical hold over the project. A key property of all open source licenses is that they do not give one party more power than any other in deciding how the code can be changed or used. If the dictator were to suddenly start making bad decisions, there would be restlessness, followed eventually by revolt and a fork. Except, of course, things rarely get that far, because the dictator compromises first.
es: Por esta razón aún aquellos proyectos que no están organizados formalmente como democracias, son en la práctica democracias en el momento en que se toman las decisiones importantes. La replicabilidad incluye a la &quot;forkability&quot;; &quot;forkability&quot; incluye al consenso. Podría bien darse el caso de que todos quieran apoyarse en un líder (el ejemplo más famoso es el de Linus Torvalds durante el desarrollo del kernel de Linux), pero esto es porque ellos <emphasis>así lo eligen</emphasis>, de una manera ajena a todo cinicismo y en una forma no siniestra. El dictador no tiene un dominio mágico sobre el proyecto. Una propiedad de todas las licencias de fuente abierta es que no se le da a una parte más poder que a cualquier otra para decidir cómo se debe usar o cambiar el código. Si el dictador de repente comenzara a tomar malas decisiones, se produciría una agitación, seguida eventualmente por un levantamiento y por un &quot;fork&quot;. Excepto que, por supuesto, muy rara vez las cosas llegan tan lejos, porque antes el dictador busca soluciones de compromiso.
gl: Por esta razón mesmo os proxectos que non están organizados formalmente como democracias, na práctica, compórtanse como tales cando se trata de afrontar decisións importantes. A capacidade de replicar implica a posibilidade de escindirse; a posibilidade dunha escisión implica consenso. É moi posible que todo o mundo estea disposto a someterse a un líder (o exemplo máis famoso é Linus Torvalds no desenvolvemento do kernel de Linux), mais isto é así porque eles <emphasis>escollen</emphasis> facelo, dunha forma totalmente libre de cinismo ou dobreces. O ditador non ten un dominio máxico sobre o proxecto. Unha propiedade clave de todas as licenzas de fontes abertas é que non conceden máis poder a unha parte sobre as decisións de como mudar o código ou usalo. Se o ditador, de repente, comezase a tomar malas decisións, produciríase unha axitación, seguida finalmente dun levantamento e unha escisión.

source: But just because forkability puts an upper limit on how much power anyone can exert in a project doesn't mean there aren't important differences in how projects are governed. You don't want every decision to come down to the last-resort question of who is considering a fork. That would get tiresome very quickly, and sap energy away from real work. The next two sections examine different ways to organize projects such that most decisions go smoothly. These two examples are somewhat idealized extremes; many projects fall somewhere along a continuum between them.
es: Pero, sólo porque la forkability pone un límite al abuso de poder que uno puede ejercer en un proyecto, eso no quiere decir que no hayan diferencias importantes en el modo como se gobiernan los proyectos. Nadie desea que en todas las decisiones se llegue a la pregunta de última instancia de quien está considerando un fork. Eso pasaría rápidamente a ser muy agobiante, restando energía necesaria para el trabajo efectivo. Las dos secciones que siguen examinan los modos de organizar los proyectos para que la mayoría de las decisiones se tomen naturalmente. Estos dos ejemplos son los casos extremos idealizados; muchos proyectos quedan de alguna manera incluidos entre esos casos.
gl: Mais porque exista a posibilidade dunha escisión, o que impón un gran límite en canto a poder que alguén exerce nun proxecto, non quere dicir que non existan importantes diferenzas en como son dirixidos os proxectos. Non é desexable que cada decisión sexa condicionada pola posibilidade de que alguén estea considerando unha escisión. Isto pode converterse en algo pesado e esbanxar enerxías destinadas ao auténtico traballo. As dúas seccións seguintes examinan os modos de organizar os proxectos para que a maioría das decisións sexan tomadas sen problemas. Estes dous exemplos son os casos estremos idealizados; moitos proxectos estarán situados entre estes estremos.

source: Benevolent Dictators
es: Dictadores Benevolentes
gl: Ditadores benevolentes

source: The <firstterm>benevolent dictator</firstterm> model is exactly what it sounds like: final decision-making authority rests with one person, who, by virtue of personality and experience, is expected to use it wisely.
es: El modelo de un <firstterm>dictador benevolente</firstterm> es precisamente lo que se describe así: La autoridad final de la toma de decisiones reside en una persona, de quien se espera que, por la fuerza de su personalidad o experiencia, la use sabiamente.
gl: O modelo de <firstterm>ditador benevolente</firstterm> é exactamente o que parece: a autoridade de tomar a decisión final radica nunha soa persoa, da que, en virtude da súa personalidade e experiencia, espérase que a use sabiamente.

source: Although "benevolent dictator" (or <firstterm>BD</firstterm>)is the standard term for this role, it would be better to think of it as "community-approved arbitrator" or "judge". Generally, benevolent dictators do not actually make all the decisions, or even most of the decisions. It's unlikely that one person could have enough expertise to make consistently good decisions across all areas of the project, and anyway, quality developers won't stay around unless they have some influence on the project's direction. Therefore, benevolent dictators commonly do not dictate much. Instead, they let things work themselves out through discussion and experimentation whenever possible. They participate in those discussions themselves, but as regular developers, often deferring to an area maintainer who has more expertise. Only when it is clear that no consensus can be reached, and that most of the group <emphasis>wants</emphasis> someone to guide the decision so that development can move on, do they put their foot down and say "This is the way it's going to be." Reluctance to make decisions by fiat is a trait shared by virtually all successful benevolent dictators; it is one of the reasons they manage to keep the role.
es: Auque el término estándar de esta función es &quot;dictador benévolo&quot; (o <firstterm>DB</firstterm>), sería mejor que lo imaginemos como un &quot;árbitro aprobado por la comunidad&quot; o un &quot;juez&quot;. En general, los dictadores benevolentes no toman realmente las decisiones, ni siquiera la mayoría de las decisiones. No es probable que una persona pueda tener todo el conocimiento para tomar decisiones buenas y coherentes en todas las áreas de un proyecto, y además, los desarrolladores de calidad no se acercarán al proyecto a no ser que tengan alguna influencia en su dirección. Por lo que los dictadores benevolentes no se comportan como mandones. Por el contrario, dejan que las cosas funcionen por sí solas por el intercambio de ideas y la experimentación, siempre que eso sea posible. Ellos mismos participan en esas discusiones, como un desarrollador cualquiera, a menudo delegando a un administrador de area que tenga mas conocimiento. Solamente cuando queda claro que no se puede alcanzar un consenso, y cuando la mayoría del grupo <emphasis>desea</emphasis> que alguien guíe la decisión para que el desarrollo pueda seguir adelante, pisan firme y dicen: &quot;Esta es la forma que tiene que ser&quot;. Una característica compartida por casi todos los dictadores benevolentes exitosos es que tienen un rechazo a tomar decisiones con un &quot;así tiene que ser&quot;; esta es una de las razones por la permanecen en la función.
gl: Aínda que "ditador benevolente" (ou <firstterm>BD</firstterm>) é o termo estándar para este rol, sería mellor pensar nel coma un "árbitro autorizado da comunidade" ou "xuíz". En xeral, os ditadores benevolentes realmente non toman todas as decisións, nin incluso a maioría das decisións. É pouco probable que unha persoa poida ter os suficientes coñecementos para a toma de decisións apropiadas en todas as áreas dun proxecto, e ademais, os desenvolvedores máis cualificados non permanecerán no proxecto a non ser que teñan algunha influencia sobre a dirección do proxecto. Polo tanto, os ditadores benevolentes non adoitan ditar moito. Pola contra, deixan que as cousas funcionen por si soas a través do debate e a experimentación sempre que sexa posible. Participan nesas discusións, mais como un desenvolvedor máis , a miúdo delegando nun mantedor desa área que teña máis pericia. Só cando é evidente que non se logra o consenso, e que a maioría do grupo <emphasis>quere</emphasis> que alguén guíe a decisión para que o desenvolvemento poida seguir adiante, pisan firme e din: "Esta é a forma en que vai ser". As reticencias a tomar decisións por decreto é unha característica compartida por case todos os ditadores benevolentes con éxito, é unha das razóns polas que logran manter este rol.

source: Who Can Be a Good Benevolent Dictator?
es: ¿Quién puede ser un Buen Dictador Benevolente?
gl: Quen pode ser un bo ditador benevolente?
