Repository: amaneiro/poss-gl
Catalog: po/*/ch04.po
Languages: es, gl

source: With vetoes comes the problem of veto abuse. Sometimes developers are too eager to raise the stakes by casting a veto, when really all that was called for was more discussion. You can prevent veto abuse by being very reluctant to use vetoes yourself, and by gently calling it out when someone else uses her veto too often. If necessary, you can also remind the group that vetoes are binding for only as long as the group agrees they are&mdash;after all, if a clear majority of developers wants X, then X is going to happen one way or another. Either the vetoing developer will back down, or the group will decide to weaken the meaning of a veto.
es: Junto con los vetos se introduce el problema del abuso del veto. A veces los desarrolladores están demasiado ansiosos en levantar la presión con el pedido de veto, cuando lo que realmente se requiere es más discusión. Se puede evitar el abuso del veto empezando por ser uno mismo contrario al uso del veto, y haciendo notar con tacto cuando alguien usa el veto muy a menudo. Si fuera necesario, se puede recordar para el grupo que los vetos tienen fuerza de obligación siempre y cuando el grupo esté de acuerdo&mdash;después de todo, si una gran mayoría de desarrolladores quieren X, de una u otra manera van a conseguir X. O bien el desarrollador que propuso el veto lo retira, o el grupo va a quitarle fuerza al significado del veto.
gl: Cos vetos introdúcese o problema do abuso do veto. Ás veces os desenvolvedores están demasiado ansiosos por aumentar a presión cun veto, cando o que realmente se require é máis discusión. Podes previr o abuso do veto sendo moi relutante ao uso deste, e facendo notar con tacto cando alguén usa o veto demasiado a miúdo. Se for necesario, tamén podes lembrarlle ao grupo que os vetos son de obrigado cumprimento a condición de que o grupo estea de acordo&mdash;despois de todo, se a maioría de desenvolvedores queren X, X vai ocorrer dun modo ou outro. Ou ben o desenvolvedor do veto retírao, ou o grupo vai quitarlle importancia a este dereito de veto.

source: You may see people write "-1" to express a veto. This usage comes from the Apache Software Foundation, which has a highly structured voting and veto process, described at <ulink url="http://www.apache.org/foundation/voting.html"></ulink>. The Apache standards have spread to other projects, and you will see their conventions used to varying degrees in a lot of places in the open source world. Technically, "-1" does not always indicate a formal veto even according to the Apache standards, but informally it is usually taken to mean a veto, or at least a very strong objection.
es: A veces se escribe un &quot;-1&quot; para contabilizar el veto. Esta costumbre viene de la Fundación del Software Apache, quienes tienen un proceso muy estructurado de votos y votaciones, que está en <ulink url="http://www.apache.org/foundation/voting.html"></ulink>. Las normas de Apache se han difundido a otros proyectos, y se pueden ver sus acuerdos usados de distinta forma en muchos lugares del mundo de la fuente abierta. Técnicamente &quot;-1&quot; no siempre indica que hay un veto formal de acuerdo a las normas de Apache, pero informalmente se considera que representa un veto, o por lo menos una objeción muy fuerte.
gl: Pode verse que a xente escribe "-1" para expresar un dereito de veto. Este costume vén da Apache Software Foundation, que ten moi estruturados o sistema de voto e o proceso de veto, que se describe en <ulink url="http://www.apache.org/foundation/voting.html"></ulink>. As normas de Apache estendéronse a outros proxectos, e pódese ver como as súas convencións son utilizadas en diversos graos en moitos lugares no mundo do código aberto. Tecnicamente "-1" non sempre indica un veto formal de acordo coas normas de Apache, mais informalmente considérase que representa un veto, ou polo menos unha obxección moi forte.

source: Like votes, vetoes can apply retroactively. It's not okay to object to a veto on the grounds that the change in question has already been committed, or the action taken (unless it's something irrevocable, like putting out a press release). On the other hand, a veto that arrives weeks or months late isn't likely to be taken very seriously, nor should it be.
es: Igual que con las votaciones, los vetos se pueden aplicar con efectos retroactivos. No es correcto rechazar un veto porque el cambio en cuestión haya sido puesto en commit, o porque la acción está asumida (a no ser que se trate de algo irrevocable, como por ejemplo una edición de prensa). Por otro lado, un veto que llega semanas, o meses tarde no tiene la posibilidad de que se lo tome muy en serio, ni tendría que ser así.
gl: Do mesmo xeito que as votacións, os vetos pódense aplicar con carácter retroactivo. Non é correcto rexeitar un veto sobre a base de que a mudanza en cuestión xa se cometeu, ou das medidas adoptadas (a menos que sexa algo irrevogable, por exemplo unha nota de prensa). Doutra banda, un veto que chega con semanas ou meses de atraso, non é probable que se tome moi en serio, nin debería selo.

source: Writing It All Down
es: Tomando Nota de Todo
gl: Poñer todo por escrito

source: At some point, the number of conventions and agreements floating around in your project may become so great that you need to record it somewhere. In order to give such a document legitimacy, make it clear that it is based on mailing list discussions and on agreements already in effect. As you compose it, refer to the relevant threads in the mailing list archives, and whenever there's a point you're not sure about, ask again. The document should not contain any surprises: it is not the source of the agreements, it is merely a description of them. Of course, if it is successful, people will start citing it as a source of authority in itself, but that just means it reflects the overall will of the group accurately.
es: En cierto momento, el número de acuerdos y arreglos que circulan por el proyecto pueden llegar a ser tan grandes que se necesita registrarlos en algún lugar. Y para dar legitimidad a esos documentos, hay que tener bien claro que están basados el las discusiones de las listas de correo y en acuerdos que ya estaban en vigencia. Cuando se los escribe, se hace referencia a las líneas de los archivos de la lista de correo y cada vez que no se está seguro sobre un punto, se pregunta de nuevo. El documento no debe contener sorpresas: Éste no es fuente de los acuerdos, sino solamente la descripción de ellos. Por supuesto, si es aceptado, la gente comenzará a citarlo como si fuera una fuente de autoridad, pero eso sólo significa que refleja con exactitud la voluntad de todos los del grupo.
gl: Nalgún momento, o número de convenios e acordos que circulan no seu proxecto poden chegar a ser tan grandes que se necesiten rexistrar nalgún lugar. A fin de dar lexitimidade a eses documentos, debe ficar claro que se basean nas discusións da lista de correo e nos acordos xa en vigor. A medida que o redactes, remítete aos fíos relevantes dos arquivos das listas de correo, e cada vez que haxa un punto no que non esteas seguro, pregunta de novo. O documento non debería conter ningunha sorpresa: non é a fonte dos acordos, é simplemente unha descrición destes. Por suposto, se ten éxito, a xente comezará a citalo como fonte de autoridade en si mesmo, mais iso só significa que reflicte a vontade xeral do grupo con precisión.

source: This is the document alluded to in <xref linkend="developer-guidelines"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>. Naturally, when the project is very young, you will have to lay down guidelines without the benefit of a long project history to draw on. But as the development community matures, you can adjust the language to reflect the way things actually turn out.
es: Este es el documento aludido <xref linkend="developer-guidelines"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>. Naturalmente, cuando el proyecto recién comienza, se tendrá que esbozar una guía, sin que por esto se excluya la confección de una posterior historia del proyecto. Pero, a medida que la comunidad madura, se pueden hacer ajustes del lenguaje para reflejar la manera final a la que se ha llegado.
gl: Este é o documento aludido <xref linkend="directrices para o desenvolvedor"/><phrase output="printed"> en <xref linkend="primeiros pasos"/></phrase>. Naturalmente, cando o proxecto é moi recente, terá que establecer os criterios a seguir sen os beneficios cos que contan os proxectos con máis historia. Mais a medida que a comunidade de desenvolvemento madura, pode axustar a linguaxe para reflectir a forma en que actualmente son levadas a cabo as cousas.

source: Don't try to be comprehensive. No document can capture everything people need to know about participating in a project. Many of the conventions a project evolves remain forever unspoken, never mentioned explicitly, yet adhered to by all. Other things are simply too obvious to be mentioned, and would only distract from important but non-obvious material. For example, there's no point writing guidelines like "Be polite and respectful to others on the mailing lists, and don't start flame wars," or "Write clean, readable bug-free code." Of course these things are desirable, but since there's no conceivable universe in which they might <emphasis>not</emphasis> be desirable, they are not worth mentioning. If people are being rude on the mailing list, or writing buggy code, they're not going to stop just because the project guidelines said to. Such situations need to be dealt with as they arise, not by blanket admonitions to be good. On the other hand, if the project has specific guidelines about <emphasis>how</emphasis> to write good code, such as rules about documenting every API in a certain format, then those guidelines should be written down as completely as possible.
es: No se debe pretender que uno lo ha dicho todo. Ningún documento puede captar todo lo que la gente necesita saber para participar en un proyecto. Muchos de los acuerdos del proyecto permanecen tácitos, nunca explicitados, sin embargo aceptados por todos. Algunas cosas son muy obvias para incluirlas, y resultarían distractivas al lado del material que no es obvio y es importante. Por ejemplo, no tiene sentido escribir en la guía una instrucción como &quot;Sea educado y respetuoso con los otros miembros de la lista de correos, y no incite a las discusiones acaloradas&quot; o &quot;Escriba código sin errores, claros y limpios.&quot; Por supuesto que son cosas deseables, pero no existe un universo concebible donde estas cosas <emphasis>no</emphasis> sean deseables, por lo que no vale la pena mencionarlas. Si alguien es grosero en la lista de correos, o escribe el código con errores, no van a dejar de hacerlo sólo porque la guía del proyecto lo dice. Estas situaciones requieren atención en el momento que aparecen, y no bastan las normas generales que dicen que hay que ser buenos. Además, si el proyecto tiene líneas específicas sobre <emphasis>cómo</emphasis> escribir un código bueno, entonces esas líneas de la guía deber escribirse con todo el detalle que sea posible.
gl: Non trates de abranguelo todo. Ningún documento pode capturar todo o que a xente necesita saber acerca da participación nun proxecto. Moitas das convencións que un proxecto contrae son tácitas, nunca mencionadas explicitamente, mais aceptadas por todos. Outras cousas son simplemente demasiado evidentes para seren mencionadas, e só iría en detrimento de material importante mais non evidente. Por exemplo, non ten sentido redactar directrices como "Sexa cortés e respectuoso cos demais nas listas de correo, e non inicie apaixonadas guerras", ou "Escriba código limpo, fácil de ler e libre de erros." Por suposto, estas cousas son desexables, mais xa que non existe un universo concibible no que puidesen <emphasis>non</emphasis> ser desexables, non son dignas de mención. Se a xente for groseira na lista de correo, ou escribir código con erros, non van deixar de facelo só porque a guía do proxecto o di. Estas situacións requiren atención no momento en que aparecen, e non con admonicións xerais para ser bos. Por outra parte, se o proxecto tiver liñas específicas sobre <emphasis>como</emphasis> escribir bo código, entón esas directrices da guía deberían escribirse co máximo detalle posible.

source: A good way to determine what to include is to base the document on the questions that newcomers ask most often, and on the complaints experienced developers make most often. This doesn't necessarily mean it should turn into a FAQ sheet&mdash;it probably needs a more coherent narrative structure than FAQs can offer. But it should follow the same reality-based principle of addressing the issues that actually arise, rather than those you anticipate might arise.
es: . <para>Una buena manera de determinar qué debe incluirse en el documento es referirse a las preguntas que los recién llegados hacen, y a las quejas de los desarrolladores con experiencia. Esto no quiere decir que necesariamente tienen que convertirse en un informe FAQ&mdash;posiblemente el documento necesita una estructura narrativa más coherente que la que puede ofrecer el FAQ. Tiene entonces que seguir el mismo principio basado en la práctica, que hay que incluir asuntos que realmente se producen, y no tanto tratar de anticiparse a los asuntos que pueden producirse.</para> .
gl: Un bo xeito de determinar o que debe incluírse é basear o documento nas preguntas que fan os chegados recentemente, e nas queixas que expoñen os desenvolvedores con experiencia máis a miúdo. Isto non quere dicir que necesariamente teñan que converterse nun FAQ&mdash;posiblemente o documento necesite unha estrutura narrativa máis coherente que a que pode ofrecer o FAQ. Mais debería seguir o mesmo principio baseado en abordar as cuestións que realmente se producen, en troca de anticiparse ás que poidan xurdir.

source: If the project is a benevolent dictatorship, or has officers endowed with special powers (president, chair, whatever), then the document is also a good opportunity to codify succession procedures. Sometimes this can be as simple as naming specific people as replacements in case the BD suddenly leaves the project for any reason. Generally, if there is a BD, only the BD can get away with naming a successor. If there are elected officers, then the nomination and election procedure that was used to choose them in the first place should be described in the document. If there was no procedure originally, then get consensus on a procedure on the mailing lists <emphasis>before</emphasis> writing about it. People can sometimes be touchy about hierarchical structures, so the subject needs to be approached with sensitivity.
es: Si el proyecto tiene un dictador benévolo, o si tiene miembros con poderes especiales (presidente, secretario general, o lo que sea), entonces el documento es una buena oportunidad de escribir los procedimientos de la sucesión de poderes. A veces eso puede ser tan simple como nombrar cierta gente como reemplazantes en el caso en que el DB abandone el proyecto por alguna razón. Generalmente, si hay un DB, es sólo él quien puede decidir el nombre de un sucesor. Si se elige una comisión, entonces el procedimiento de la elección y el nombramiento de los integrantes de la comisión tiene que estar descrito en el documento. Si al comienzo no existe un procedimiento, entonces hay que conseguir un consenso en la lista de correos <emphasis>antes</emphasis> de escribir sobre el procedimiento. Hay gente que puede ser sensible con las estructuras jerárquicas, por lo que el asunto tiene que ser tratado con delicadeza.
gl: Se o proxecto é unha ditadura benévola, ou ten axentes dotados de poderes especiais (presidente, secretario, ou calquera outro), entón o documento é tamén unha boa oportunidade para codificar os procedementos de sucesión. Ás veces isto pode ser tan simple como nomear a persoas específicas como sucesores no caso de que o DB abandone repentinamente o proxecto por calquera razón. Xeralmente, se hai un DB, é só el quen pode designar un sucesor. Se se elixe unha comisión, entón o procedemento da elección e o nomeamento dos integrantes da comisión ten que estar descrito no documento. Se orixinariamente non existe un procedemento, entón hai que conseguir un consenso nas listas de correo <emphasis>antes</emphasis> de escribir sobre isto. A xente, algunhas veces, pode ser susceptible coas estruturas xerárquicas, de modo que o tema debe ser tratado con delicadeza.

source: Perhaps the most important thing is to make it clear that the rules can be reconsidered. If the conventions described in the document start to hamper the project, remind everyone that it is supposed to be a living reflection of the group's intentions, not a source of frustration and blockage. If someone makes a habit of inappropriately asking for rules to be reconsidered every time the rules get in her way, you don't always need to debate it with her&mdash;sometimes silence is the best tactic. If other people agree with the complaints, they'll chime in, and it will be obvious that something needs to change. If no one else agrees, then the person won't get much response, and the rules will stay as they are.
es: Quizás lo mas importante es dejar en claro que las reglas pueden ser reconsideradas. Si los acuerdos descritos en el documento comienzan a frenar el proyecto, recordar a todos que fue pensado como una reflexión viviente de las intenciones del grupo, no para provocar frustración y bloqueo. Si alguien toma por hábito pedir que las reglas se reconsideren cada vez que una regla se considera, no siempre conviene debatir el tema con ella&mdash;a veces el silencio es la mejor táctica. Si hay mas de uno que se une a las quejas, la campana ha sonado, y será lógico suponer que algo necesita ser cambiado. Si nadie se une a la queja, entonces esa persona no representa a nadie, y las reglas quedarán como están.
gl: Quizais o máis importante é deixar claro que as normas poden ser reconsideradas. Se os acordos descritos no documento comezan a frear o proxecto, recordar a todos que se supón que é un vivo reflexo das intencións do grupo, non unha fonte de frustración e estagnación. Se alguén toma, de forma inapropiada, por hábito pedir que as regras sexan reconsideradas cada vez que unha regra lle afecta, non sempre convén debater o tema con el&mdash;ás veces o silencio é a mellor táctica. Se outras persoas están de acordo coas queixas, a campá soou, e é obvio que será necesario mudar algo. Se ninguén está de acordo, entón a persoa non obterá demasiados froitos, e as regras manteranse como están.

source: Two good examples of project guidelines are the Subversion <filename>hacking.html</filename> file, at <ulink url="http://svn.collab.net/repos/svn/trunk/www/hacking.html"></ulink>, and the Apache Software Foundation governance documents, at <ulink url="http://www.apache.org/foundation/how-it-works.html"></ulink> and <ulink url="http://www.apache.org/foundation/voting.html"></ulink>. The ASF is really a collection of software projects, legally organized as a nonprofit corporation, so its documents tend to describe governance procedures more than development conventions. They're still worth reading, though, because they represent the accumulated experience of a lot of open source projects.
es: Dos buenos ejemplos de una guía para un proyecto es Subversion <filename>hacking.html</filename> en <ulink url="http://svn.collab.net/repos/svn/trunk/www/hacking.html"></ulink>, y los documentos de gobierno de la Fundación de Software Apache, en <ulink url="http://www.apache.org/foundation/how-it-works.html"></ulink> y <ulink url="http://www.apache.org/foundation/voting.html"></ulink>. La Fundación de Software Apache es de hecho una colección de proyectos de software, organizada legalmente como una corporación sin fines de lucro, de modo que sus documentos tienden a describir los procedimientos de gobierno más que las convenciones de desarrollo. Vale la pena leerlas, porque representan una experiencia acumulada en muchos proyectos de fuente abierta.
gl: Dous bos exemplos de directrices dun proxecto son o arquivo de Subversion <filename>hacking.html</filename> en <ulink url="http://svn.collab.net/repos/svn/trunk/www/hacking.html"></ulink>, e os documentos de xestión da Apache Software Foundation, en <ulink url="http://www.apache.org/foundation/how-it-works.html"></ulink> e <ulink url="http://www.apache.org/foundation/voting.html"></ulink>. A ASF é, realmente, unha colección de proxectos de software, organizada legalmente como unha corporación sen fins de lucro, de modo que os seus documentos tenden a describir os procedementos de goberno máis que as convencións de desenvolvemento. De todos os xeitos, paga a pena lelos, porque representan a experiencia acumulada de moitos proxectos de código aberto.
