Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: Point 1 implies that the FAQ should be available in some sort of textual format. Points 2 and 3 imply that the FAQ should be available as an HTML page, with point 2 additionally indicating that the HTML should be designed for readability (i.e., you'll want some control over its look and feel), and should have a table of contents. Point 4 means that each individual entry in the FAQ should be assigned an HTML <firstterm>named anchor</firstterm>, a tag that allows people to reach a particular location on the page. Point 5 means the source files for the FAQ should be available in a convenient way (see <xref linkend="version-everything"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>), in a format that's easy to edit.
es: Named Anchors y atributos ID
gl: O punto 1 implica que as FAQ deberían estar dispoñibles nalgún tipo de formato de texto. Os puntos 2 e 3 implican que as FAQ deberían estar dispoñibles como unha páxina HTML, coa indicación adicional por parte do punto 2 de que o HTML debería estar deseñado para aumentar a lexibilidade (p.ex. vas querer ter algún control sobre o seu modo de visualización), e debería contar cunha táboa de contidos. O punto 4 indica que cada entrada individual da FAQ debería ter asignada unha etiqueta HTML <firstterm>named anchor</firstterm>, indicando que se lle permite a xente chegar a calquera localización concreta na páxina. O punto 5 significa que os ficheiros fonte para a FAQ deberían estar dispoñibles dunha maneira axeitada (ver <xref linkend="version-everything"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>), nun formato que sexa sinxelo de editar.

source: Named Anchors and ID Attributes
es: Hay dos maneras para que un navegador vaya a un sitio específico dentro de una página web: anclas con nombre y atributos id.
gl: Named Anchors (áncoras nomeadas) e atributos ID

source: There are two ways to get a browser to jump to a specific location within a web page: named anchors and id attributes.
es: Un <firstterm>ancla con nombre</firstterm> es simplemente un elemento HTML de ancla (<literal>&lt;a&gt;...&lt;/a&gt;</literal>), pero con un atributo "name":
gl: Hai dúas maneiras para lograr que un navegador salte a un sitio específico dentro dunha páxina web: áncoras con nome e atributos id.

source: A <firstterm>named anchor</firstterm> is just a normal HTML anchor element (<literal>&lt;a&gt;...&lt;/a&gt;</literal>), but with a "name" attribute:
es: &lt;a&nbsp;name="mylabel"&gt;...&lt;/a&gt;
gl: Unha <firstterm>áncora con nome</firstterm> é simplemente un elemento HTML de áncora (<literal>&lt;a&gt;...&lt;/a&gt;</literal>), mais cun atributo "name":

source: &lt;a&nbsp;name="mylabel"&gt;...&lt;/a&gt;
es: Versiones más recientes de HTML soportan un <firstterm>atributo id </firstterm> genérico, el cual puede adjuntarse a cualquier elemento HTML, y no sólo a <literal>&lt;a&gt;</literal>. Por ejemplo:
gl: &lt;a&nbsp;name="jack-shephard-label"&gt;...&lt;/a&gt;

source: More recent versions of HTML support a generic <firstterm>id attribute</firstterm>, which can be attached to any HTML element, not just to <literal>&lt;a&gt;</literal>. For example:
es: &lt;p&nbsp;id="mylabel"&gt;...&lt;/p&gt;
gl: Versións máis recentes de HTML soportan un <firstterm>atributo id </firstterm> xenérico, o cal pode achegarse conxuntamente con calquera elemento HTML, non só con <literal>&lt;a&gt;</literal>. Por exemplo:

source: &lt;p&nbsp;id="mylabel"&gt;...&lt;/p&gt;
es: Ambos, anclas con nombre y atributos id son usados de la misma manera. Uno añade una marca hash y la etiqueta a una URL, y hacer así al navegador que salte directo a dicho punto de la página:
gl: &lt;p&nbsp;id="hugo-reyes-label"&gt;...&lt;/p&gt;

source: Both named anchors and id attributes are used in the same way. One appends a hash mark and the label to a URL, to cause the browser to jump straight to that spot in the page:
es: http://myproject.example.com/faq.html#mylabel
gl: Ambos, tanto áncoras con nome como atributos id, empréganse do mesmo xeito. Un engade unha marca hash e etiquétaa a unha URL, para provocar que o navegador salte directo ao devandito punto da páxina:

source: http://myproject.example.com/faq.html#mylabel
es: Virtualmente todos los navegadores soportan las anclas con nombre; los navegadores más modernos soportan el atributo id. Para asegurarnos, recomendaría utilizar tanto anclas con nombre únicamente, o anclas con nombre<emphasis>y</emphasis> atributos id attributes juntos (con la misma etiqueta para ambos en un mismo par, por supuesto). Las anclas con nombre no pueden ser self-closing&mdash;incluso aunque no haya texto dentro del elemento, aún así deberas escribirlo en la forma two-sided:
gl: http://ghandalf-loves-lost.org/faq.html#david-faraday-label

source: Virtually all browsers support named anchors; most modern browsers support the id attribute. To play it safe, I would recommend using either named anchors alone, or named anchors <emphasis>and</emphasis> id attributes together (with the same label for both in a given pair, of course). Named anchors cannot be self-closing&mdash;even if there's no text inside the element, you must still write it in two-sided form:
es: &lt;a&nbsp;name="mylabel"&gt;&lt;/a&gt;
gl: Virtualmente todos os navegadores Web teñen soporte para áncoras con nome; a maior parte dos navegadores modernos teñen soporte para atributos id. Para ir sobre seguro, recomendaría empregar tanto áncoras con nome en solitario, como áncoras con nome <emphasis>e</emphasis> atributos id conxuntamente (coa mesma etiqueta para ambos nun par concreto, por suposto). As áncoras con nome non poden ser autopechantes&mdash; embora non exista texto dentro do elemento, contodo, debes escribilo na forma dupla:

source: &lt;a&nbsp;name="mylabel"&gt;&lt;/a&gt;
es: ...aunque normalmente habrá algún texto, como el título de una sección.
gl: &lt;a&nbsp;name="sayid-label"&gt;&lt;/a&gt;

source: ...though normally there would be some text, such as the title of a section.
es: Allá donde utilices un ancla de nombre, o un atributo id, o ambos, recuerda que la etiqueta no será visible a nadie que navegue a esa ubicación sin usar la etiqueta. Pero una persona podrá querer descubrir la etiqueta de un sitio en particular, para que puedan enviar un mail con la URL de la respuesta a una FAQ enviada a un amigo, por ejemplo. Para ayudar en eto, añade un <firstterm>atributo de título</firstterm> en el mismo elemento(s) donde has añadido el "name" y/o el atributo "id", por ejemplo:
gl: ...aínda que normalmente haberá algún texto, como o título dunha sección.

source: Whether you use a named anchor, or an id attribute, or both, remember that the label will not be visible to someone who browses to that location without using the label. But such a person might want to discover the label for a particular location, so they can mail the URL for a FAQ answer to a friend, for example. To help them do this, add a <firstterm>title attribute</firstterm> to the same element(s) where you added the "name" and/or "id" attribute, for example:
es: &lt;a&nbsp;name="mylabel"&nbsp;title="#mylabel"&gt;...&lt;/a&gt;
gl: En calquera lugar no que empregues unha áncora con nome, ou un atributo id, ou ambos, recorda que a etiqueta non vai ser visible por ninguén que navegue ata esa localización sen empregar a etiqueta. Mais unha persoa podería querer saber a etiqueta que identifica unha localización concreta, para poder enviar un correo coa URL da resposta na FAQ a un amigo, por exemplo. Para axudalo a facer isto, engade un <firstterm>atributo título</firstterm> ao mesmo elemento(s) ao que lle engadiches o "nome" e/ou o atributo "id", por exemplo:

source: &lt;a&nbsp;name="mylabel"&nbsp;title="#mylabel"&gt;...&lt;/a&gt;
es: Cuando el ratón se situe sobre el texto dentro del elemento con el atributo del título, la mayoría de los navegadores mostraran una pequeña caja con el título. Normalmente, incluyo el signo hash para recordar al usuario que esto es lo que pondrá al final de la URL para ir directo a esta ubicación la próxima vez.
gl: &lt;a&nbsp;name="kate-austen-label"&nbsp;title="kate-austen-label"&gt;...&lt;/a&gt;

source: When the mouse pointer is held over the text inside the title-attributed element, most browsers will pop up a tiny box showing the title. I usually include the hash-sign, to remind the user that this is what she would put at the end of the URL to jump straight to this location next time.
es: Formatenado la FAQ de esta manera es sólo un ejemplo de como crear un recurso presentable. Las mismas propiedades&mdash;busqueda directa, disponibilidad en la mayoría de buscadores de Internet, navegación, estabilidad referencial, y (donde se aplique) edición&mdash;son aplicables a otras páginas web, el arbol del código fuente, el seguimiento de bugs, etc. Simplemente ocurre que la mayoría del software de archivado de listas de correo hace tiempo que reconocen la importancia de estas propiedades, y es por lo que las listas de correo tienden a tener estas funcionalidades de manera nativa, mientras otros formatos requieren de un esfuerzo extra en la parte de mantenimiento(<xref linkend="managing-volunteers"/> discute como difundir esta carga de mantenimiento a través de miles de voluntarios).
gl: Deste xeito, cando o rato se sitúe sobre o texto dentro do elemento co atributo de título, a maioría dos navegadores van mostrar unha pequena caixiña co título. Acostumo incluír a sinatura hash, para lembrarlle ao usuario que isto é o que debe poñer ao final da URL para saltar directamente a esta localización a próxima vez.

source: Formatting the FAQ like this is just one example of how to make a resource presentable. The same properties&mdash;direct searchability, availability to major Internet search engines, browsability, referential stability, and (where applicable) editability&mdash;apply to other web pages, the source code tree, the bug tracker, etc. It just happens that most mailing list archiving software long ago recognized the importance of these properties, which is why mailing lists tend to have this functionality natively, while other formats may require some extra effort on the maintainer's part (<xref linkend="managing-volunteers"/> discusses how to spread that maintenance burden across many volunteers).
es: Tradición en la organización del contenido
gl: Formatar a FAQ deste xeito só é un exemplo de como facer que un recurso sexa presentable. As mesmas propiedades&mdash;localización directa, dispoñibilidade para a maioría dos motores de procura en Internet, navegabilidade, estabilidade referencial, e (onde corresponder) editabilidade&mdash; correspóndense con outras páxinas web, coa árbore co código fonte, co bug tracker, etc. Debido a que a maioría do software de arquivamento de listas de correo xa desde hai moito tempo ten recoñecida a importancia destas propiedades, é polo que a listas de correo tenden a contar nativamente con estas funcionalidades, mentres que outros formatos poden requirir algún esforzo extra por parte do mantedor (<xref linkend="managing-volunteers"/> analiza como repartir esta carga de mantemento entre varios voluntarios).

source: Codifying Tradition
es: Conforme un proyecto gana en complejidad y adquiere historia, la cantidad de datos que cada participante debe absorber incrementa. Aquellos que llevan en el proyecto mucho tiempo serán capaces de aprender, e inventar las convenciones del proyecto conforme avanza. A menudo no serán conscientes del gran cuerpo de tradición que se ha ido acumulando, y puede sorprender todos los pequeños fallos que los nuevos participantes del proyecto puedan hacer. Por supuesto, el tema no es que los recién llegados tengan una menor calidad que los de antes; sino que se enfrentan a una carga de cultura heredada mayor de la que tenían los recien llegados en el pasado.
gl: Tradición na codificación

source: As a project acquires history and complexity, the amount of data each incoming participant must absorb increases. Those who have been with the project a long time were able to learn, and invent, the project's conventions as they went along. They will often not be consciously aware of what a huge body of tradition has accumulated, and may be surprised at how many missteps recent newcomers seem to make. Of course, the issue is not that the newcomers are of any lower quality than before; it's that they face a bigger acculturation burden than newcomers did in the past.
es: Las tradiciones que un proyecto acumula son del tipo cómo comunicar y mantener información y sobre estándares de codificación y otros temas técnicos. Ya hemos repasado ambas clases de estándares, en <xref linkend="developer-documentation"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase> y <xref linkend="written-rules"/><phrase output="printed"> en <xref linkend="social-infrastructure"/></phrase> respectivamente, y se han mostrado ejemplos. Sobre lo que trata esta sección es de como mantener esas pautas actualizadas conforme el proyecto avanza, especialmente pautas sobre cómo se administran las comunicaciones, porque estas son las únicas que cambian la mayoría conforme el proyecto crece en tamaño y complejidad.
gl: A medida que un proxecto vai adquirindo historia e complexidade, a cantidade de datos que cada participante incorporado debe absorber vese incrementada. Aqueles que levan no proxecto dende fai moito tempo foron capaces de aprender, e inventar, as convencións do proxecto. A miúdo non son conscientes do enorme corpo de tradición que foron acumulando, e sorpréndense de cantos pequenos erros van cometendo os novatos. Por suposto, a cuestión non está en que as novas incorporación sexan de menor calidade que as anteriores; a cuestión está en que se teñen que enfrontar a unha maior cultura herdada, que aquela á que se enfrontaron os novatos de tempo atrás.

source: The traditions a project accumulates are as much about how to communicate and preserve information as they are about coding standards and other technical minutae. We've already looked at both sorts of standards, in <xref linkend="developer-documentation"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase> and <xref linkend="written-rules"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase> respectively, and examples are given there. What this section is about is how to keep such guidelines up-to-date as the project evolves, especially guidelines about how communications are managed, because those are the ones that change the most as the project grows in size and complexity.
es: Primero, busca patrones de cómo la gente se equivoca. Si observas las mismas situaciones una y otra vez, especialmente con participantes nuevos, se presenta una oportunidad en forma de pauta que necesita ser documentada pero no lo está. Segundo, no te canses de decir las mismas cosas una y otra vez, y que no <emphasis>parezca</emphasis> que estás cansado de repetirlas. Tú y otros veteranos del proyecto tendréis que repetirlas entre vosotros mismos a menudo; este es un efecto inevitable de la llegada de nuevos participantes.
gl: As tradicións que un proxecto vai acumulando atinxen sobre todo a como comunicar e preservar a información, estándares de codificación, e outras cuestións de índole técnica. Xa repasamos ambos tipos de estándares en <xref linkend="developer-documentation"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase> e <xref linkend="written-rules"/><phrase output="printed"> en <xref linkend="social-infrastructure"/></phrase> respectivamente, mostrando exemplos. En lugar diso, esta sección trata sobre como manter estas guías e pautas actualizadas a medida que o proxecto evolúe, especialmente as pautas e guías sobre como xestionar as comunicacións, dado que estas son as que máis mudanzas sofren a medida que o proxecto medra en tamaño e complexidade.

source: First, watch for patterns in how people get confused. If you see the same situations coming up over and over, especially with new participants, chances are there is a guideline that needs to be documented but isn't. Second, don't get tired of saying the same things over and over again, and don't <emphasis>sound</emphasis> like you're tired of saying them. You and other project veterans will have to repeat yourselves often; this is an inevitable side effect of the arrival of newcomers.
es: Cada página web, cada mensaje de lista de correo, y cada canal del IRC, deberá ser considerado como un espacio de publicidad per no de anuncios comerciales, sino de anuncios sobre los recursos propios de tu proyecto. Lo que pongas en este espacio dependerá de la procedencia de los que lo vayan a leer. Un canal IRC para cuestiones de usuario, por ejemplo, atraerá gente que nunca habrá interactuado con el proyecto antes, a menudo alguien que ha instalado el software, y tiene alguna pregunta que le gustaría que le respondieran al momento (después de todo, si puediera esperar, hubiera enviado un mail a la lista de correo la cual probablemente usa menos de su tiempo total, aunque tardaría más en recibir respuesta). La gente normalmente no realiza una inversión permanente en el canal de IRC, aparecerán, lanzarán su pregunta y se irán.
gl: Primeiro, busca padróns sobre como a xente se confunde. Se ves as mesmas situacións producíndose unha e outra vez, especialmente cos novos participantes, entón preséntase unha oportunidade en forma de guía ou pauta que necesita ser documentada mais aínda non o está. Segundo, non te canses de dicir as mesmas cousas unha e outra vez, e que non <emphasis>sone</emphasis> como se estiveses cansado de repetilo. Ti e outros veteranos do proxecto teredes que repetírvolo entre vos a miúdo; este é un efecto colateral inevitable derivado da chegada de novos participantes.

source: Every web page, every mailing list message, and every IRC channel should be considered advertising space&mdash;not for commercial advertisements, but for ads about your project's own resources. What you put in that space depends on the demographics of those likely to read it. An IRC channel for user questions, for example, is likely to get people who have never interacted with the project before&mdash;often someone who has just installed the software, and has a question he'd like answered immediately (after all, if it could wait, he'd have sent it to a mailing list instead, which would probably use less of his total time, although it would take longer for an answer to come back). People usually don't make a permanent investment in the IRC channel; they'll show up, ask their question, and leave.
es: De ahí, el tema del canal debería apuntar a gente buscando respuestas técnicas en <emphasis>ese momento</emphasis>, en vez de, gente que quiera involucrarse con el proyecto de una manera permanente y para los cuales unas pautas de interaccion serían más apropiadas. Aquí es donde un canal verdaderamente ocupado lo maneja (comparalo con el ejemplo anterior en <xref linkend="irc"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>):
gl: Cada páxina web, cada mensaxe na lista de correo e cada canal IRC debería ser considerado como un espazo publicitario&mdash;non para anuncios comerciais, mais si para anuncios sobre os recursos do teu propio proxecto. O que poñas neses espazos debe depender da procedencia e cultura dos que os vaian ler. Un canal IRC para preguntas dos usuarios, por exemplo, parece o sitio ideal para obter xente que nunca antes tivera contacto co proxecto&mdash;habitualmente alguén que simplemente instalou o software e ten unha pregunta que precisa ser respondida o máis axiña posible (despois de todo, se puidera esperar, tería enviado a pregunta á lista de correo, o que probablemente lle custase menos tempo total, aínda que tardaría máis en recibir resposta). A xente normalmente non fai un investimento permanente no canal IRC; aparecen, lanzan a súa pregunta e vanse.

source: Therefore, the channel topic should be aimed at people looking for technical answers about the software <emphasis>right now</emphasis>, rather than at, say, people who might get involved with the project in a long term way and for whom community interaction guidelines might be more appropriate. Here's how a really busy channel handles it (compare this with the earlier example in <xref linkend="irc"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>):
gl: Deste xeito, o tópico e mailo tema do canal deberían dirixirse a xente que está a buscar por respostas técnicas sobre o software <emphasis>o máis axiña posible</emphasis>, en lugar de dirixirse a xente que podería querer participar no proxecto a longo prazo e para os cales unhas guías de interacción serían máis apropiadas. Aquí é onde un canal IRC realmente ocupado xestiona a cuestión (compáraa co exemplo anterior en <xref linkend="irc"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>):

source: You are now talking on #linuxhelp Topic for #linuxhelp is Please READ http://www.catb.org/~esr/faqs/smart-questions.html &amp;&amp; http://www.tldp.org/docs.html#howto BEFORE asking questions | Channel rules are at http://www.nerdfest.org/lh_rules.html | Please consult http://kerneltrap.org/node/view/799 before asking about upgrading to a 2.6.x kernel | memory read possible: http://tinyurl.com/4s6mc -&gt; update to 2.6.8.1 or 2.4.27 | hash algo disaster: http://tinyurl.com/6w8rf | reiser4 out
es: Con las listas de correo, el "espacio de AD" es un ligero pie de página añadido a cada mensaje. La mayoría de los proyectos ponen ahí instrucciones de suscripción/borrado, y quizás un enlace a la página principal del proyecto o también a la FAQ. Puedes pensar que cualquiera que esté suscrito a la lista sabrá donde encontrar esa información, y probablemente entonces lo hagan, pero mucha más gente que únicamente los subscriptores verán esos correos de la lista. Un post archivado se puede enlazar desde diversos lugares; de hecho, algunos posts se vuelven tan famosos que eventualmente son leidos por más lectores fuera de la lista que de ella.
gl: Estás falando en #linuxhelp O tema para #linuxhelp é: Por favor, LE http://www.catb.org/~esr/faqs/smart-questions.html &amp;&amp; http://www.tldp.org/docs.html#howto ANTES DE faceres preguntas | As normas do canal atópanse en http://www.nerdfest.org/lh_rules.html | Por favor, consulta http://kerneltrap.org/node/view/799 antes de preguntares sobre actualizacións á versión 2.6.x do kernel | memory read possible: http://tinyurl.com/4s6mc -&gt; update to 2.6.8.1 or 2.4.27 | hash algo disaster: http://tinyurl.com/6w8rf | reiser4 out
