Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: When including screen output, snippets of code, or other preformatted text, offset it clearly, so that even a lazy eye can easily see the boundaries between your prose and the material you're quoting. (I never expected to write that advice when I started this book, but on a number of open source mailing lists lately, I've seen people mix texts from different sources without making it clear which is which. The effect is very frustrating. It makes their posts significantly harder to understand, and frankly makes those people look a little bit disorganized.)
es: Cuando incluyas salida de pantalla, trozos de código u otro texto preformateado, desplázalo claramente, de forma que a simple vista se pueda fácilmente ver los límites entre tu texto y el material que estés incluyendo. (Nunca esperé escribir este consejo cuando comencé el libro, pero en un número de listas de correo de código abierto posterior, he visto gente mezclando textos de diferentes fuentes sin dejar claro qué es qué. El efecto es muy frustante. Hacen los correos bastante difíciles de entender y, francamente, hace que esas personas parezcan un poco desorganizadas).
gl: Cando inclúas saídas de pantalla, fragmentos de código, ou outro texto preformatado, compénsao de forma que mesmo un ollo vago poida ver claramente os límites entre a túa prosa e o material que citas. (Nunca pensei escribir este consello ao comezar este libro, pero ultimamente, nun número extenso de listas de correo fonte abertas, vin cantidade de mesturas de textos de distintas fontes sen que quedase claro cal era cal. O efecto é frustrante. Fai que as súas mensaxes sexan difíciles de entender, e francamente, fai que esa xente pareza desorganizada).

source: When quoting someone else's mail, insert your responses where they're most appropriate, at several different places if necessary, and trim off the parts of their mail you didn't use. If you're writing a quick comment that applies to their entire post, it's okay to <firstterm>top-post</firstterm> (that is, to put your response above the quoted text of their mail); otherwise, you should quote the relevant portion of the original text first, followed by your response.
es: Cuando cites el correo de alguien, inserta tus repuestas donde sea más apropiado, en diferentes lugares si es necesario, y elimina las partes de su correo que no utilices. Si estás escribiendo un comentario rápido con referencia a todo el correo, es correcto hacerlo <firstterm>top-post</firstterm> (Es decir, poner tu respuesta encima del texto citado; de lo contrario, deberías citar primero la parte relevante del texto original, seguido de tu respuesta.
gl: Cando cites o correo doutra persoa, insire as túas respostas onde sexa máis apropiado; en distintos lugares se é necesario, e corta as partes do correo que non fagan falta. Se escribes un comentario rápido que responde ao correo en conxunto, non está mal un top-post (isto é, situar a túa resposta sobre o texto citado do seu correo), doutra forma, deberías citar a parte relevante do texto orixinal, seguido da túa resposta.

source: Construct the subject lines of new mails carefully. It's the most important line in your mail, because it allows each other person in the project to decide whether or not to read more. Modern mail reading software organizes groups of related messages into threads, which can be defined not only by a common subject, but by various other headers (which are sometimes not displayed). It follows that if a thread starts to drift to a new topic, you can&mdash;and should&mdash;adjust the subject line accordingly when replying. The thread's integrity will be preserved, due to those other headers, but the new subject will help people looking at an overview of the thread know that the topic has drifted. Likewise, if you really want to start a new topic, do it by posting a fresh mail, not by replying to an existing mail and changing the subject. Otherwise, your mail would still be grouped in to the same thread as what you're replying to, and thus fool people into thinking it's about something it's not. Again, the penalty would not only be the waste of their time, but the slight dent in your credibility as someone fluent in using communications tools.
es: Construye el asunto de los nuevos correos con cuidado. Es la línea más importante de un correo, ya que permite a cualquier otra persona del proyecto decidir si leer más o no. Los lectores de correo modernos organizan los grupos de mensajes relacionados en hilos, que pueden no solo definirse por un asunto común sino por otras cabeceras (que a menudo no se muestran). Entienden que si un hilo comienza a derivar hacia un nuevo tema, puedes y debes ajustar el asunto adecuadamente cuando respondas. La integridad del hilo persistirá, debido a aquellas otras cabeceras, pero el nuevo asunto ayudará a la gente que mira un resumen del hilo a saber que el tema ha derivado. Asimismo, si realmente quieres comenzar un nuevo tema, hazlo creando un nuevo mensaje y no respondiendo uno ya existente y cambiándole el asunto. De esta forma, tu correo podría estar agrupado en el mismo hilo del correo que estás respondiendo y así volver loca a la gente pensando sobre algo que no es. Recuerda: la penalización no será la pérdida de tiempo, sino la pequeña hendidura en tu credibilidad como alguien fluido en el uso de las herramientas de comunicación.
gl: Constrúe as liñas do asunto dos novos correos coidadosamente. É a liña máis importante do teu correo, porque permite que todas as persoas do proxecto decidan se queren ler máis ou non. O software de lectura moderno organiza grupos de mensaxes relacionados en fíos, que poden estar definidos non só polo asunto común, senón por outras cabeceiras (que normalmente non se mostran). É lóxico que se un fío comeza a desembocar nun novo tema, podes (e deberías) axustar o asunto de acordo coa resposta. A integridade dos fíos conservarase, debido aos outros encabezamentos, pero o novo asunto axudaralle á xente a ter unha visión xeral do fío agora que o tema foi desviado. Así, se é que queres comezar un novo tema, faino cun novo correo, non respondendo un que xa existe cambiándolle o asunto, senón, o teu correo estará clasificado no mesmo fío ao que respondes, e fará que a xente crea que trata sobre o mesmo, cando non é así. De novo, a consecuencia non só será a perda de tempo, senón que afectará levemente á túa credibilidade como persoa con habilidade en utilizar ferramentas de comunicación.

source: Content
es: Contenido
gl: Contido

source: Well-formatted mails attract readers, but content keeps them. No set of fixed rules can guarantee good content, of course, but there are some principles that make it more likely.
es: Correos electrónicos bien formateados atraen a los lectores, pero el contenido los mantiene. Ningún conjunto fijo de reglas puede garantizar el buen contenido, por supuesto, hay algunos principios que lo hacen más prometedor.
gl: Os correos cun formato apropiado captan a atención do lector, pero é o contido a que a mantén. Non hai normas fixas que poidan garantir un bo contido, claro está, pero existen algúns principios que o fan máis probable.

source: Make things easy for your readers. There's a ton of information floating around in any active open source project, and readers cannot be expected to be familiar with most of it&mdash;indeed, they cannot always be expected to know how to become familiar. Wherever possible, your posts should provide information in the form most convenient for readers. If you have to spend an extra two minutes to dig up the URL to a particular thread in the mailing list archives, in order to save your readers the trouble of doing so, it's worth it. If you have to spend an extra 5 or 10 minutes summarizing the conclusions so far of a complex thread, in order to give people context in which to understand your post, then do so. Think of it this way: the more successful a project, the higher the reader-to-writer ratio in any given forum. If every post you make is seen by <emphasis>n</emphasis> people, then as <emphasis>n</emphasis> rises, the worthwhileness of expending extra effort to save those people time rises with it. And as people see you imposing this standard on yourself, they will work to match it in their own communications. The result is, ideally, an increase in the global efficiency of the project: when there is a choice between <emphasis>n</emphasis> people making an effort and one person doing so, the project prefers the latter.
es: Hacer las cosas fáciles para tus lectores. Hay una tonelada de información flotando alrededor en cualquier proyecto activo de software libre, y los lectores no pueden esperar estar al corriente de la mayor parte de ella, de hecho, no siempre pueden esperar familiarizarse. En lo posible, tus correos deben sumunistrar información en la forma más conveniente para los lectores. Si tienes que pasar unos dos minutos extra buscando el URL de un hilo particular en los archivos de la lista de correo, atendiendo al objetivo de librar a tus lectores de hacerlo, vale la pena. Si tienes que pasar unos 5 o 10 minutos extra resumiendo las conclusiones de un hilo complejo, con la intención de brindarle a las personas el contexto en el cual comprederán tu correo, entonces hazlo. Piénsalo de esta manera: el mayor éxito en un proyecto, es aumentar el cociente lector-a-escritor en cualquier foro dado. Si cada correo tuyo es visto por <emphasis>n</emphasis> personas, entonces como <emphasis>n</emphasis> aumenta, la utilidad de realizar un esfuerzo adicional para ayudar a aquellas personas aumenta con el tiempo. Y como las personas te verán imponer este estándar, trabajarán imitándolo en sus propias comunicaciones. El resultado es, idealmente, un incremento en la eficiencia global del proyecto: cuando hay una elección entre <emphasis>n</emphasis> personas realizando un esfuerzo y una persona haciendolo, el proyecto prefiere el segundo.
gl: Facilítalles a cousa aos lectores. Hai un montón de datos en cada proxecto fonte, e o lector non pode esperar que todo lle sexa familiar; de feito, non pode esperar saber como lle pode chegar a ser familiar. Dentro do posible, as túas mensaxes deberían proporcionarlle información ao lector da forma máis conveniente. Pasar dous minutos extra para investigar a URL para un fío particular nos arquivos da lista de correo para aforrarlle o traballo ao teu lector, paga a pena. Se tes que pasar de cinco a dez minutos resumindo a conclusión dun fío complexo para darlle á xente un contexto e que así entendan a túa mensaxe, entón faino. Pensa desta forma: canto máis éxito teña o proxecto, maior será o número de lectores en calquera foro. Se cada mensaxe que mandas é vista por n persoas, entón canto máis incremente n, máis pagará a pena calquera esforzo para aforrarlles o traballo a esa xente. E cando a xente ve que te estás impoñendo isto, traballarán para igualar as súas propias mensaxes. O resultado é, idealmente, un aumento na eficiencia mundial do proxecto: cando hai que elixir entre n persoas facendo un esforzo e unha persoa facéndoo, pois o mellor para o proxecto é este último caso.

source: Don't engage in hyperbole. Exaggerating in online posts is a classic arms race. For example, a person reporting a bug may worry that the developers will not pay sufficient attention, so he'll describe it as a severe, showstopper problem that is preventing him (and all his friends/coworkers/cousins) from using the software productively, when it's actually only a mild annoyance. But exaggeration is not limited to users&mdash;programmers often do the same thing during technical debates, particularly when the disagreement is over a matter of taste rather than correctness:
es: No acostumbrarse a la hipérbole. La exageración de correos online es una clásica competencia de armamento. Por ejemplo, a una persona que reporta un fallo puede preocuparle que los desarrolladores no le presten la suficiente atención, así que lo describirá como grave, gran problema que es prevenirle (y a todos sus amigos/compañeros de trabajo/primos) de la utilización del software productivamente, cuando es solamente una molestia leve. Pero la exageración no está limitada a los usuarios; los programadores frecuentemente hacen lo mismo durante debates técnicos, especialmente cuando el desacuerdo es una cuestión de gustos más que de corección:
gl: Non utilices hipérboles. É común e esaxerar nas mensaxes en Internet. Por exemplo, pode que a unha persoa que envía un informe de erros non lle chame suficiente a atención, así que o describirá de forma seria e como un problema crítico que o prevén (e aos seus amigos/compañeiros de traballo/curmáns) de utilizar o software produtivamente, cando en realidade non é máis ca un problema leve. Esaxerar non se limita aos usuarios; os programadores fan o mesmo acotío nos os debates técnicos, particularmente cando discuten sobre gusto máis ca sobre corrección:

source: <blockquote> <para>"Doing it that way would make the code totally unreadable. It'd be a maintenance nightmare, compared to J. Random's proposal..."</para> </blockquote> <para>The same sentiment actually becomes <emphasis>stronger</emphasis> when phrased less sharply:</para> <blockquote> <para>"That works, but it's less than ideal in terms of readability and maintainability, I think. J. Random's proposal avoids those problems because it..."</para> </blockquote>
es: <blockquote> <para>"Hacerlo de esa manera haría el código totalmente ilegible. Sería una pesadilla para el mantenimiento, comparado a la propuesta de J. Random..."</para> </blockquote> <para>El mismo sentimiento se vuelve más <emphasis>fuerte</emphasis> cuando está expresado de una forma menos brusca:</para> <blockquote> <para>"Pienso que eso funciona, pero menos de lo ideal en términos de legibilidad y mantenimiento. La propuesta de J. Random evita esos problemas ya que..."</para> </blockquote>
gl: <blockquote> <para>«Ao facelo así, faría que o código fose ilexible. Sería un pesadelo de mantemento, comparado co propósito de J. Random...»</para> </blockquote><para>A mesma opinión faise máis forte cando se expresa con menos dureza: </para> <blockquote> <para>«Isto funciona, pero é menos ca un ideal no relativo a lexibilidade e mantemento, penso. A proposta de J. Random evitaría estes problemas porque…»</para> </blockquote>

source: You will not be able to get rid of hyperbole completely, and in general it's not necessary to do so. Compared to other forms of miscommunication, hyperbole is not globally damaging&mdash;it hurts mainly the perpetrator. The recipients can compensate, it's just that the sender loses a little more credibility each time. Therefore, for the sake of your own influence in the project, try to err on the side of moderation. That way, when you <emphasis>do</emphasis> need to make a strong point, people will take you seriously.
es: No podrás librarte completamente de la hipérbole, y en general no es necesario hacerlo. Comparada con otras formas retóricas, la hipérbole no es globalmente dañina y perjudica principalmente al autor. Los destinatarios pueden comprender, solamente que el remitente pierde un poco más de credibilidad cada vez. Por lo tanto, para bien de tu influencia en el proyecto, intenta proceder con moderación. De esa manera, cuando <emphasis>necesitas</emphasis> presentar un punto fuerte, las personas te tomarán con seriedad.
gl: Non seredes quen de desfacervos das hipérboles completamente, e, en xeral, non é necesario facelo. Comparado con outras formas de erros de comunicación, a hipérbole non é moi grave; prexudica só ao que escribe a mensaxe. Os receptores poden compensala, mais o emisor perde cada vez máis credibilidade. Polo tanto, polo ben da túa influencia no proxecto, tenta tirar cara a moderación. Desa forma, cando si que precises recalcar algo, a xente tomarate en serio.

source: Edit twice. For any message longer than a medium-sized paragraph, reread it from top to bottom before sending it but after you think it's done the first time. This is familiar advice to anyone who's taken a composition class, but it's especially important in online discussion. Because the process of online composition tends to be highly discontinuous (in the course of writing a message, you may need to go back and check other mails, visit certain web pages, run a command to capture its debugging output, etc.), it's especially easy to lose your sense of narrative place. Messages that were composed discontinuously and not checked before being sent are often recognizable as such, much to the chagrin (or so one would hope) of their authors. Take the time to review what you send. The more your posts hold together structurally, the more they will be read.
es: Corregir dos veces. Para cualquier mensaje más largo que el tamaño medio de un párrafo, se recomienda volver a leerlo de arriba a abajo antes de enviarlo pero después de que lo tengas listo. Éste es un conocido consejo para cualquiera que haya tomado una clase de composición, pero es especialmente importante para las discusiones en línea. Ya que el proceso de composición en línea tiende a ser altamente discontinuo (en el transcurso de escritura de un mensaje, podrías necesitar retroceder y revisar otros correos, visitar ciertas páginas web, ejecutar un comando para capturar su salida de depuración, etc.), es especialmente fácil perder el sentido de tu papel narrativo. Mensajes que fueron escritos discontinuamente y no fueron revisados antes de ser enviados son frecuentemente reconocibles como tal, mucho el disgusto (o uno esperaría) de sus autores. Tómate el tiempo para examinar lo que envías. Cuanto más estructurados sean tus mensajes, más leidos serán.
gl: Edita dúas veces. Le calquera mensaxe que ocupe máis de medio parágrafo de arriba a abaixo antes de envialo, mesmo despois de lelo unha primeira vez. Este consello élles familiar a aqueles que tiveron clase de redacción, pero é que especialmente importante na discusión online. Como o proceso da redacción online tende a ser altamente descontinuo (no curso no que escribes unha mensaxe pode que teñas que volver e ler outras mensaxes, visitar páxinas e escribir un comando para capturar unha saída de depuración, entre outras cousas), é especialmente sinxelo perder o fío. As mensaxes compostas de forma descontinua e que non se revisaron antes de envialas, son recoñecidas moitas veces, para o desgusto (ou polo menos é o que se espera) dos seus autores. Toma o tempo preciso para revisar o que envías. Canto máis xuntas estean as túas mensaxes estruturalmente, máis serán lidas.

source: Tone
es: Tono
gl: Tono

source: After writing thousands of messages, you will probably find your style tending toward the terse. This seems to be the norm in most technical forums, and there's nothing wrong with it per se. A degree of terseness that would be unacceptable in normal social interactions is simply the default for free software hackers. Here's a response I once drew on a mailing list about some free content management software, quoted in full:
es: Después de escribir miles de mensajes, probablemente notarás que tu estilo tiende a ser extremadamente conciso. Esto parece ser la norma en la mayoría de los foros técnicos, y no hay nada malo con ello. Un nivel de brevedad que sería inaceptable en interacciones sociales normales es sencillamente el común para los hackers de software libre. Aquí está una respuesta a la que yo recurrí una vez en una lista de correo acerca de cierto software gratuito de administración de contenido, citado en su totalidad:
gl: Despois de escribir milleiros de mesaxes, o teu estilo converterase en cada vez máis seco. Isto parece se-la norma na maioría dos foros técnicos, e non hai nada malo en que así sexa. Un punto de brevedade e rudeza que sería inaceptable nas iteracións sociais cotias é a norma para os hackers do software libre. Poño a continuación algunhas respostas que obtiven nunha rolda de correo sobre xestores libres de contidos, van entrecomilladas:

source: Can you possibly elaborate a bit more on exactly what problems you ran into, etc? Also: What version of Slash are you using? I couldn't tell from your original message. Exactly how did you build the apache/mod_perl source? Did you try the Apache 2.0 patch that was posted about on slashcode.com? Shane
gl: Podes elaborar máis exactamente qué problemas estás sufrindo? Tamén: Qué versión de Slash usas? Non puiden obtelo da mesaxe orixinal. Cómo tes construido o código do apache/mod_perl? Probaches o parche para Apache 2.0 que foi publicado en slashcode.com? -- Shane \n

source: Now <emphasis>that's</emphasis> terse! No greeting, no sign-off other than his name, and the message itself is just a series of questions phrased as compactly as possible. His one declarative sentence was an implicit criticism of my original message. And yet, I was happy to see Shane's mail, and didn't take his terseness as a sign of anything other than him being a busy person. The mere fact that he was asking questions, instead of ignoring my post, meant that he was willing to spend some time on my problem.
es: <emphasis>Eso</emphasis> es ser conciso! No tiene bienvenida, ni despedida con excepción de su nombre, y el mensaje en sí es solamente una serie de preguntas expresadas de la forma más compacta. Su oración declarativa fue una crítica implícita de mi mensaje original. Aunque, me alegra ver el correo de Shane, y no tomar su brevedad como un producto de cualquier otro motivo que no sea el de ser una persona ocupada. El mero hecho de que él haga preguntas, en vez de ignorar mi mensaje, significa que él es esta dispuesto a dedicarle cierto tiempo a mi problema.
gl: Iso é sequedade! Sen un saúdo previo, sen firma máis alá do seu nome e o mesaxe mesmo sendo únicamente unha serie de preguntas tan compactas como sexa posible. Cada pregunta en si mesma era unha crítica implícita ó meu orixinal mesaxe. A pesar disto, alegroume recibir a mensaxe de Shane, e non tomei a resposta como un signo de rudeza, senón de que era unha persoa ocupada. O mero feito de que me estivese preguntando, en vez de ignora-la miña mensaxe, quería dicir que estaba disposto a dedicar un pouco do seu tempo no problema.
