Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: If your vulnerability meets the CVE criteria, you may wish to acquire it a CAN number. The process for doing so is deliberately gated: basically, you have to know someone, or know someone who knows someone. This is not as crazy as it might sound. In order for the CVE Editorial Board to avoid being overwhelmed with spurious or poorly written submissions, they take submissions only from sources they already know and trust. In order to get your vulnerability listed, therefore, you need to find a path of acquaintance from your project to the CVE Editorial Board. Ask around among your developers; one of them will probably know someone else who has either done the CAN process before, or knows someone who has, etc. The advantage of doing it this way is also that somewhere along the chain, someone may know enough to tell you that a) it wouldn't count as a vulnerability or exposure according to MITRE's criteria, so there is no point submitting it, or b) the vulnerability already <emphasis>has</emphasis> a CAN or CVE number. The latter can happen if the bug has already been published on another security advisory list, for example at <ulink url="http://www.cert.org/"></ulink> or on the BugTraq mailing list at <ulink url="http://www.securityfocus.com/"></ulink>. (If that happened without your project hearing about it, then you should worry what else might be going on that you don't know about.)
es: Si después de todo consigues un número CAN/CVE, normalmente querrás conseguirlo en la primera etapa de la investigación del bug, para que todas las comunicaciones consiguientes puedan referirse con ese número. Las entradas CAN están embargadas hasta la fecha de publicación; la entrada existirá como una reserva vacía (para que no pierdas el nombre), pero no revelará ninguna información sobre la vulnerabilidad hasta la fecha en la cual anunciarás el bug y la solución.
gl: Se a túa vulnerabilidade concordar cos criterios CVE, podes obter un número CAN para a mesma. O proceso para levar isto a cabo é deliberadamente tutelado: basicamente, tes que coñecer alguén, ou alguén que coñecer alguén. Isto non é tan tolo como poida parecer. Co obxectivo de evitar a saturación da Xunta Editorial CVE debido a solicitudes espúreas ou pobremente escritas, unicamente aceptan solicitudes provenientes de fontes que xa coñecen e nas que confían. Para conseguires que a túa vulnerabilidade se incorpore á lista, primeiramente debes atopar un camiño desde o teu proxecto ata a Xunta Editorial CVE. Pregúntalle aos teus desenvolvedores; probablemente algún dos mesmos coñeza a alguén que tivera percorrido o proceso CAN con anterioridade, ou que coñeza alguén que o fixera. A vantaxe de facelo deste xeito tamén se atopa en que ao longo da cadea pode que alguén teña o suficiente coñecemento para dicirche que a) non vai concibirse como unha vulnerabilidade ou risco baixo os criterios MITRE, polo que non ten sentido enviarlla, ou b)a vulnerabilidade <emphasis>xa</emphasis> ten un número CAN ou CVE. A última posibilidade pode xurdir se o erro de seguridade xa foi previamente publicada noutra lista de seguridade, como pode ser por exemplo <ulink url="http://www.cert.org/"></ulink>, ou na lista de correo BugTraq dispoñible en <ulink url="http://www.securityfocus.com/"></ulink> (Se isto acontecer sen que o teu proxecto o saiba, deberías preocuparte sobre que outras cousas poden saber outros e que ti non saibas).

source: If you get a CAN/CVE number at all, you usually want to get it in the early stages of your bug investigation, so that all further communications can refer to that number. CAN entries are embargoed until the go-public date; the entry will exist as an empty placeholder (so you don't lose the name), but it won't reveal any information about the vulnerability until the date on which you will be announcing the bug and the fix.
es: Más información sobre el proceso CAN/CVE puede encontrase en <ulink url="http://cve.mitre.org/about/candidates.html"></ulink>, y una exposición particularmente clara de el uso de los números CAN/CVE de un proyecto open source en <ulink url="http://www.debian.org/security/cve-compatibility"></ulink>.
gl: Se finalmente acadas un número CAN/CVE, o normal é que desexes conseguilo nas primeiras fases de investigación do teu erro, de xeito que todo o resto da comunicación poida referirse a ese número. As entradas CAN están embargadas ata a data de publicación; a entrada unicamente existe como unha reserva vacía (para que non perdas o nome), mais sen capacidade de revelar ningunha información sobre a vulnerabilidade ata que se chegar á data na que se anuncia a solución do erro.

source: More information about the CAN/CVE process may be found at <ulink url="http://cve.mitre.org/cve/identifiers/candidates_explained.html"></ulink>, and a particularly clear exposition of one open source project's use of CAN/CVE numbers is at <ulink url="http://www.debian.org/security/cve-compatibility"></ulink>.
es: Pre-notificacion
gl: Máis información sobre o proceso CAN/CVE pode atoparse en <ulink url="http://cve.mitre.org/cve/identifiers/candidates_explained.html"></ulink>, e unha exposición particularmente clara de como se empregan os números CNA/CVE nos proxectos de software libre está dispoñible en <ulink url="http://www.debian.org/security/cve-compatibility"></ulink>.

source: Pre-notification
es: Una vez que tu equipo de respuesta a seguridad (este es, aquellos desarrolladores que están en la lista de correo de seguridad, o quien ha estado involucrado con un informe particular) tienen un arreglo listo, necesitas decidir como distribuirlo.
gl: Pre-notificación

source: Once your security response team (that is, those developers who are on the security mailing list, or who have been brought in to deal with a particular report) has a fix ready, you need to decide how to distribute it.
es: Si simplemente realizas un commit con el arreglo en tu repositorio, o de lo contrario lo anuncias al mundo, efectivamente estarás forzando a todo el mundo que use tu software a actualizarse inmediatamente o estarán en riesgo de ser hackeados. A veces es apropiado, por lo tanto, hacer <firstterm>pre-notificaciones</firstterm> para ciertos usuarios importantes. Esto es particularmente cierto con software cliente/servidor , donde puede haber servidores bien conocidos que serán objetivos tentadores para atacantes. Los administradores de estos servidores apreciarán el tener un día o dos extra para realizar la actualización, de tal manera que ya estén protegidos una vez que el exploit sea de conocimiento público.
gl: Unha vez que o teu equipo de resposta ante problemas de seguridade (isto é, aqueles desenvolvedores incluídos na lista de correo de seguridade ou involucrados na resolución dun informe concreto) tiver a solución lista, debes decidir como distribuíla.

source: If you simply commit the fix to your repository, or otherwise announce it to the world, you effectively force everyone using your software to upgrade immediately or risk being hacked. It is sometimes appropriate, therefore, to do <firstterm>pre-notification</firstterm> for certain important users. This is particularly true with client/server software, where there may be well-known servers that are tempting targets for attackers. Those servers' administrators would appreciate having an extra day or two to do the upgrade, so that they are already protected by the time the exploit becomes public knowledge.
es: La Pre-notificación simplemente significa enviar correos a esos administradores antes de la fecha de publicación, avisándoles de la vulnerabilidad y de cómo solucionarla. Deberías enviar pre-notificaciones sólo a gente en la que confíes que serán discretos con la información. Esto es, la cualificación para recibir pre-notificaciones es doble: el destinatario debe administrar un gran e importante servidor donde un compromiso sería un asunto serio, <emphasis>y</emphasis> el emisor debe saber que no cotorreará sobre el problema de seguridad antes de la fecha de publicación.
gl: Se simplemente fas commit da solución no teu repositorio, ou se pola contra llo anuncias ao mundo, estás forzando calquera que usar o teu software a actualizarse inmediatamente baixo o risco de ser hackeado. Ás veces o máis axeitado, en liña co anterior, é levar a cabo unha <firstterm>pre-notificación</firstterm> no caso de certos usuarios importantes. Isto é particularmente preciso en software cliente/servidor, onde pode haber servidores ben coñecidos que son obxectivos tentadores para atacantes. Os administradores destes servidores van apreciar poder contar cun día extra ou dous para faceren a actualización, de tal xeito que xa estean protexidos unha vez que o exploit da vulnerabilidade sexa publicamente coñecido.

source: Pre-notification simply means sending mails to those administrators before the go-public date, telling them of the vulnerability and how to fix it. You should send pre-notification only to people you trust to be discreet with the information. That is, the qualification for receiving pre-notification is twofold: the recipient must run a large, important server where a compromise would be a serious matter, <emphasis>and</emphasis> the recipient must be known to be someone who won't blab about the security problem before the go-public date.
es: Envía cada correo de pre-notificación individualmente (de uno en uno) a cada receptor. <emphasis>No</emphasis> envíes a la lista completa de receptores de una vez, porque podrán verse los nombres de cada uno; lo que significa que esencialmente estás alertando a cada receptor con el hecho de que cada uno de los <emphasis>otros</emphasis> receptores pueden tener un agujero de seguridad en su servidor. Enviarselo a todos vía CC ciegas (BCC) tampoco es una buena solución, porque algunos administradores protegen sus bandejas con filtros de spam tanto bloquean como reducen la prioridad de los correos con BCC, ya que mucho spam es enviado vía BCC actualmente.
gl: A pre-notificación quere dicir unicamente enviarlle correos electrónicos aos administradores anteriores antes da data de publicación da vulnerabilidade, facéndoos partícipes da existencia da vulnerabilidade e do xeito de solucionala. Debes facerlle estas pre-notificacións unicamente aquela xente na que confiares e for discreta coa información. Deste xeito, a cualificación para recibir pre-notificacións ten dúas compoñentes: o receptor debe administrar un servidor importante e grande onde un incidente de seguridade poida ser un tema serio, <emphasis>e</emphasis> o receptor debe ser recoñecido como alguén que non se vaia da lingua antes da publicación da vulnerabilidade.

source: Send each pre-notification mail individually (one at a time) to each recipient. Do <emphasis>not</emphasis> send to the entire list of recipients at once, because then they would see each others' names&mdash;meaning that you would essentially be alerting each recipient to the fact that each <emphasis>other</emphasis> recipient may have a security hole in her server. Sending it to them all via blind CC (BCC) isn't a good solution either, because some admins protect their inboxes with spam filters that either block or reduce the priority of BCC'd mail, since so much spam is sent via BCC these days.
es: Este es un correo de ejemplo de pre-notificación:
gl: Envía cada correo electrónico de pre-notificación individualmente (un de cada vez) a cada receptor. <emphasis>Non</emphasis> llo envíes á lista enteira de destinatarios dunha tacada, dado que nese caso verían o nome do resto de destinatarios&mdash;dando a entender que esencialmente están alertando cada receptor do feito de que <emphasis>cada</emphasis> destinatario pode ter un burato de seguridade no seu servidor. Enviárllelo mediante o uso do campo BCC (copia oculta) tampouco é unha boa solución, dado que algúns administradores protexen as súas bandexas de entrada con filtros anti-spam que adoitan bloquear ou reducir a prioridade dos correos electrónicos enviados en copia oculta, dado que moito spam envíase en copia oculta.

source: Here's a sample pre-notification mail:
gl: Aquí vai unha mostra de correo electrónico de pre-notificación:

source: From: Your Name Here To: admin@large-famous-server.com Reply-to: Your Name Here (not the security list's address) Subject: Confidential Scanley vulnerability notification. This email is a confidential pre-notification of a security alert in the Scanley server. Please *do not forward* any part of this mail to anyone. The public announcement is not until May 19th, and we'd like to keep the information embargoed until then. You are receiving this mail because (we think) you run a Scanley server, and would want to have it patched before this security hole is made public on May 19th. References: =========== CAN-2004-1771: Scanley stack overflow in queries Vulnerability: ============== The server can be made to run arbitrary commands if the server's locale is misconfigured and the client sends a malformed query. Severity: ========= Very severe, can involve arbitrary code execution on the server. Workarounds: ============ Setting the 'natural-language-processing' option to 'off' in scanley.conf closes this vulnerability. Patch: ====== The patch below applies to Scanley 3.0, 3.1, and 3.2. A new public release (Scanley 3.2.1) will be made on or just before May 19th, so that it is available at the same time as this vulnerability is made public. You can patch now, or just wait for the public release. The only difference between 3.2 and 3.2.1 will be this patch. [...patch goes here...]
es: Si tienes un número CAN, inclúyelo en la pre-notificación (cómo se muestra arriba), incluso aunque la información esté todavía oculta y de ahí que la página de MITRE no mostrará nada. Incluyendo el número CAN permite al receptor conocer con certeza que el bug con el que han sido pre-notificados es el mismo que luego oirán hablar en los canales públicos, por lo que no tendrán que preocuparse si es necesario realizar alguna acción, qué es precisamente el objetivo de los números CAN/CVE.
gl: De: Aquí vai o teu nome Para: admin@chachi-famoso-servidor.com Responder a: Aquí vai o teu nome (e non o enderezo da lista de seguridade) Asunto: Notificación Confidencial de vulnerabilidade en Ghandalf. Este correo electrónico é unha pre-notificación confidencial dunha alerta de seguridade no servidor Ghandalf. Por favor *non reenvíes* ningunha parte deste correo a ninguén.. O anuncio público non se vai facer ata o 23 de xaneiro, e gustaríanos manter a información oculta ata esa data. Recibiches este correo porque (pensamos que) empregas un servidor Ghandalf, e queremos que o parchees antes de que o burato de seguridade se faga público o o vindeiro 23 de xaneiro. Referencias: =========== CAN-2004-1771: Stack overflow de Ghandalf baixo consultas de Balrogs Vulnerabilidade: ============== O servidor pode executar comandos arbitrarios se o 'locale' do servidor está mal configurado e o cliente envía consultas mal formadas. Severidade: ========= Moi severa, pode involucrar execución de código arbitrario no servidor. Rodeos: ============ Establecer a opción de "procesado-de-linguaxe-natural" a 'apagado' no ficheiro ghandalf.conf péchalle a porta a esta vulnerabilidade. Remendo: ====== O remendo que se fornece a continuación pode empregarse en Ghandalf 3.0, 3.1, e 3.2. Unha nova versión pública (Ghandalf 3.2.1) vai ser lanzada xusto despois do 23 de xaneiro, para que estea dispoñible ao mesmo tempo que a vulnerabilidade se fai pública. Podes remendar agora, ou esperar pola publicación. A única diferencia entre Ghandalf 3.2 e Ghandalf 3.2.1 vai ser este remendo. [...O remendo anéxase aquí...]

source: If you have a CAN number, include it in the pre-notification (as shown above), even though the information is still embargoed and therefore the MITRE page will show nothing. Including the CAN number allows the recipient to know with certainty that the bug they were pre-notified about is the same one they later hear about through public channels, so they don't have to worry whether further action is necessary or not, which is precisely the point of CAN/CVE numbers.
es: Distribuyendo la solución públicamente
gl: Se tiveres un número CAN, achégao na pre-notificación (como se mostrou arriba) aínda que a información aínda estiver oculta e aínda que a páxina MITRE non mostrar nada. Incluír o número CAN permítelle ao destinatario coñecer con certeza que o erro que se lle pre-notificou é o mesmo do que máis tarde escoitou falar nos canais públicos, polo que non vai ter que preocuparse sobre se é preciso levar a cabo algunha acción máis ou non, dado que este é precisamente o obxectivo do números CAN/CVE.

source: Distribute the fix publicly
es: El último paso en el manejo de un bug de seguridad es distribuir la solución públicamente. En un único y comprensivo anuncio, deberías describir el problema, dar los números CAN/CVE si los tiene, describir alguna solución temporal, y cómo solucionarlo permanentemente. Normalmente "fix" significa actualizar a una nueva versión del software, aunque algunas veces puede significar aplicar un parche, particularmente si el software normalmente es ejecutado desde las fuentes. Si creas una nueva versión disponible, debe diferenciarse de las versiones existentes en únicamente el parche de seguridad. De esta manera, admins conservadores podrán actualizar sin preocuparse sobre a que más puede afectarle; tampoco tendrán que preocuparse de futuras actualizaciones, porque la solución del fallo de seguridad vendrá integrado en todas las futuras versiones (Detalles de procedimientos de liberación de versiones discutidos en <xref linkend="security-releases"/><phrase output="printed"> en <xref linkend="development-cycle"/></phrase>.)
gl: Distribúe publicamente a solución

source: The last step in handling a security bug is to distribute the fix publicly. In a single, comprehensive announcement, you should describe the problem, give the CAN/CVE number if any, describe how to work around it, and how to permanently fix it. Usually "fix" means upgrading to a new version of the software, though sometimes it can mean applying a patch, particularly if the software is normally run in source form anyway. If you do make a new release, it should differ from some existing release by exactly the security patch. That way, conservative admins can upgrade without worrying about what else they might be affecting; they also don't have to worry about future upgrades, because the security fix will be in all future releases as a matter of course. (Details of release procedures are discussed in <xref linkend="security-releases"/><phrase output="printed"> in <xref linkend="development-cycle"/></phrase>.)
es: Al margen de que la solución pública al bug de seguridad conlleve una nueva versión, haz el anuncio con aproximadamente con la misma prioridad con la que harías una nueva liberación de versión: envía un mail a la lista de <literal>anuncios</literal> del proyecto, crea una nueva nota de prensa de la liberación, actualiza la entreada de Freshmeat, etc. Mientras tú nunca deberías restar importancia a la existencia de un bug de seguridad por asuntos de la reputación del proyecto, ciertamente puedes definir un tono de la importancia del anuncio de seguridad que coincida con la severidad actual del problema. Si el agujero de seguridad es simplemente una exposición de información menor, y no existe un exploit que permita tomar un control total de la computadora del usuario, entonces no puede justificar mucha preocupación. Puedes incluso decidir el no distraer a la lista de <literal>anuncios</literal> con él. Después de todo, si el proyecto empieza con este tipo de anuncios cada cierto tiempo, los usuarios pueden empezar a pensar que el software es menos seguro de lo que actualmente es, y también pueden dejar de creerte cuando exista un problema realmente grave que deba anunciarse. Mira <ulink url="http://cve.mitre.org/about/terminology.html"></ulink> cómo una buena introducción al problema de judgar la severidad.
gl: O último paso na xestión dun erro de seguridade é a distribución pública da solución. Deberías describir o problema nun anuncio sinxelo e comprensible, dando o número CAN/CVE se estiver dispoñible, e describindo como solucionar o erro tanto dun xeito temporal como dun xeito definitivo. Normalmente "solucionar (fix)" quere dicir levar a cabo unha actualización a unha nova versión do software, embora ás veces poida significar levar a cabo o remendo, particularmente no caso de que o software normalmente se execute en forma de código fonte. Se fas unha nova versión, esta debería diferir da versión previa unicamente no remendo de seguridade. Deste xeito os administradores conservadores poden levar a cabo a actualización sen se preocupar sobre que outras cousas poden resultar afectadas; a maiores tampouco terán que se preocupar no caso de futuras actualizacións, dado que a solución ao erro de seguridade vai estar incluída en todas as versión futuras como parte do seu ADN. (Os detalles dos procesos de publicación discútense en <xref linkend="security-releases"/><phrase output="printed"> in <xref linkend="development-cycle"/></phrase>.)

source: Whether or not the public fix involves a new release, do the announcement with roughly the same priority as you would a new release: send a mail to the project's <literal>announce</literal> list, make a new press release, update the Freshmeat entry, etc. While you should never try to play down the existence of a security bug out of concern for the project's reputation, you may certainly set the tone and prominence of a security announcement to match the actual severity of the problem. If the security hole is just a minor information exposure, not an exploit that allows the user's entire computer to be taken over, then it may not warrant a lot of fuss. You may even decide not to distract the <literal>announce</literal> list with it. After all, if the project cries wolf every time, users might end up thinking the software is less secure than it actually is, and also might not believe you when you have a really big problem to announce. See <ulink url="http://cve.mitre.org/about/terminology.html"></ulink> for a good introduction to the problem of judging severity.
es: En general, si no estás seguro en como tratar un problema de seguridad, encuentra a alguien con experiencia y habla con él sobre ello. Evaluar y manejar vulnerabilidades es en gran parte una destreza adquirida, y es fácil cometer fallos las primeras veces.
gl: Tanto se a solución publicada ao erro de seguridade leva aparellada unha nova versión do software, como se non, fai o anuncio coa mesma intensidade coa que farías a publicación dunha nova versión: envía un correo electrónico á lista <literal>announce</literal> do proxecto, fai unha nova nota de prensa, actualiza a entrada en Freshmeat, etc. Aínda que nunca deberías restarlle importancia, de cara ao exterior, á existencia dun erro de seguridade para manteres a reputación do proxecto, evidentemente debes empregar un ton e actitude durante o anuncio do problema de seguridade acorde coa severidade real do problema. Se o buraco de seguridade acarreta unicamente unha exposición menor de información, e non permite a existencia de exploits que permitan que o ordenador sexa controlado por terceiros, mellor evitar un montón de ruído. Mesmo podes decidir non distraer a lista <literal>announce</literal> con este erro menor. Despois de todo, se o proxecto constantemente di que ven o lobo, pode que os usuarios acaben pensando que o software é menos seguro do que realmente é, e mesmo que non te crean cando teñas que anunciar un problema realmente grande. Bótalle unha ollada a <ulink url="http://cve.mitre.org/about/terminology.html"></ulink> para unha boa introdución ao problema de asignar severidade.
