Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: (His complete post is very much worth reading, too. See <xref linkend="bikeshed-full"/>; see also <ulink url="http://bikeshed.com"></ulink>.)
es: (Su post completo es una lectura de mucho valor. Miralo.<xref linkend="bikeshed-full"/>; see also <ulink url="http://bikeshed.com"></ulink>.)
gl: (A súa mensaxe completa é unha lectura de motivo valor. Podes vela en <xref linkend="bikeshed-full"/>; bótalle tamén unha ollada a <ulink url="http://bikeshed.com"></ulink>.)

source: Anyone who's ever taken regular part in group decision-making will recognize what Kamp is talking about. However, it is usually impossible to persuade <emphasis>everyone</emphasis> to avoid painting bikesheds. The best you can do is point out that the phenomenon exists, when you see it happening, and persuade the senior developers&mdash;the people whose posts carry the most weight&mdash;to drop their paintbrushes early, so at least they're not contributing to the noise. Bikeshed painting parties will never go away entirely, but you can make them shorter and less frequent by spreading an awareness of the phenomenon in the project's culture.
es: Cualquiera que regularmente tome parte en decisiones hechas en grupo reconocera sobre que es lo que esta hablando Kamp. Sin embargo, normalmente es imposible persuadir a <emphasis>todo el mundo</emphasis> a evitar pintar un cobijo de bicis. Lo mejor que puedes hacer es señalar que el fenomeno existe, y cuando veas que esta ocurriendo, persuadir al desarrollador senior; las personas cuyos mails llevan todo el peso; a soltar sus brochas pronto, asi al menos no contribuiran al ruido. Las fiestas para pintar bicis nunca se esfumaran enteramente, pero puedes hacerlas mas cortas y menos frecuentes extendiendo una concienciacion del fenomeno en la cultura del proyecto.
gl: Calquera que algunha vez participase de xeito frecuente nun grupo con capacidade de toma de decisións, pode recoñecer perfectamente isto do que fala Kamp. Porén, adoita ser imposible persuadir <emphasis>todo o mundo</emphasis> para que non pinte o garaxe da bicicleta. O mellor que podes facer é recoñeceres que este fenómeno existe, cando vires que está a suceder, e persuadir os desenvolvedores experimentados&mdash;a xente cuxas mensaxes cargan coa maior parte do peso&mdash;para que abandonen as súas brochas o máis axiña posible, e cando menos non contribúan ao ruído. As festas para pintar garaxes de bicicletas nunca desaparecen de todo, mais podes conseguir que sexan máis curtas e menos frecuentes mediante a concienciación sobre este fenómeno, e a súa contribución á cultura do proxecto.

source: Avoid Holy Wars
es: Evitando las Guerras Santas
gl: Evitar as guerras santas

source: A <firstterm>holy war</firstterm> is a dispute, often but not always over a relatively minor issue, which is not resolvable on the merits of the arguments, but where people feel passionate enough to continue arguing anyway in the hope that their side will prevail. Holy wars are not quite the same as bikeshed paintings. People painting bikesheds are usually quick to jump in with an opinion (because they can), but they won't necessarily feel strongly about it, and indeed will sometimes express other, incompatible opinions, to show that they understand all sides of the issue. In a holy war, on the other hand, understanding the other sides is a sign of weakness. In a holy war, everyone knows there is One Right Answer; they just don't agree on what it is.
es: Una<firstterm> Guerra Santa</firstterm> es una disputa, a menudo pero no siempre sobre un tema relativamente menor el cual no se puede resolver con los meritos de los argumentos, pero donde la gente se siente demasiado apasionada para continuar discutiendo de cualquier manera con la esperanza de que su lado prevalecera. Las Guerras Santas no son lo mismo que la pintura de un garaje de bicicletas. La gente de la pintura de bicicletas normalmente salen rapido con una opinion (porque pueden), pero ellos, necesariamente no se sentiran demasiado apasionados sobre ello, y por lo tanto, otras veces, expresaran opiniones incompatibles para mostrar que ellos comprenden todas las caras del tema tratado. Por otra parte, en una Guerra Santa, comprender a las otras partes es un signo de debilidad. En una Guerra Santa, todo el mundo sabe que hay UNA Respuesta Correcta; Per ellos no estan de acuerdo con esta.
gl: Unha <firstterm>"guerra santa"</firstterm> é unha disputa, normalmente sobre un tema non menor, que non é solucionable a través dos méritos dos argumentos, senón na que a xente se apaixona suficientemente como para seguir discutindo de todos os xeitos na esperanza de que a súa postura prevaleza. As guerras santas no son o mesmo que as sesións de pintado de garaxes de bicicletas. A xente que pinta garaxes de bicicletas adoita cambiar de postura facilmente (dado que poden), mais sen sentirse especialmente turbados por isto, e mesmo a veces poden expresar opinións incompatibles para mostraren que entenden todas as facetas da cuestión. Nunha guerra santa, pola outra banda, entender o resto de facetas é un sinal de debilidade. Nunha guerra santa, todo o mundo sabe que existe unha "única resposta correcta"; simplemente non están de acordo en cal é.

source: Once a holy war has started, it generally cannot be resolved to everyone's satisfaction. It does no good to point out, in the midst of a holy war, that a holy war is going on. Everyone knows that already. Unfortunately, a common feature of holy wars is disagreement on the very question of <emphasis>whether</emphasis> the dispute is resolvable by continued discussion. Viewed from outside, it is clear that neither side is changing the other's mind. Viewed from inside, the other side is being obtuse and not thinking clearly, but they might come around if browbeaten enough. Now, I am <emphasis>not</emphasis> saying there's never a right side in a holy war. Sometimes there is&mdash;in the holy wars I've participated in, it's always been my side, of course. But it doesn't matter, because there's no algorithm for convincingly demonstrating that one side or the other is right.
es: Una vez que una Guerra Santa ha empezado, generalmente no se puede resolver con la satisfaccion de todo el mundo. No es bueno mostrar, en el medio de una Guerra Santa, que esta esta teniendo lugar. Todo el mundo ya lo sabe. Desafortunadamente una caracteristica comun de las Guerra Santa es el desacuerdo en cada cuestion <emphasis>si</emphasis> la disputa se puede resolver continuando la discusion. Visto desde fuera, esta claro que ninguna parte va a cambiar la opinion de los otros. Visto desde dentro, la otra parte esta siendo obtusa y no esta pensando claramente, pero pueden cambiar de opinion si las cosas se vuelven feas. Ahora,<emphasis>no</emphasis> estoy diciendo que no haya una parte con razon en una guerra santa. A veces la hay en las Guerras Santas que yo he participado, siempre ha sido mi bando, por supuesto. Pero no importa porque no hay algoritmo para demostrar convencidamente que una parte o la otra estan en lo cierto.
gl: Unha vez que unha guerra santa comezou, xeralmente non se pode resolver dun xeito satisfactorio para todo o mundo. Non é bo mostrar, no medio dunha guerra santa, que esta está tendo lugar. Isto xa é sabido por todo o mundo. Desafortunadamente, un patrón común nas guerras santas adoita ser o desacordo sobre <emphasis>se</emphasis> a disputa é resoluble continuando a discusión. Visto desde fóra, está claro que ningunha parte está mudando a forma de pensar da outra parte. Visto desde dentro, a outra parte está sendo obtusa e non está a pensar con claridade, mais poden vir ao rego se son suficientemente intimidados. Iso si, <emphasis>non</emphasis> estou a dicir que non haxa unha parte con razón nunha guerra santa. Ás veces hainas, e as guerras santas nas que eu participei sempre estivo do meu lado, por suposto. Mais isto non importa, dado que non hai algoritmos para demostrar convincentemente que un lado ou o outro teñen a razón.

source: A common, but unsatisfactory, way people try to resolve holy wars is to say "We've already spent far more time and energy discussing this than it's worth! Can we please just drop it?" There are two problems with this. First, that time and energy has already been spent and can never be recovered&mdash;the only question now is, how much <emphasis>more</emphasis> effort remains? If some people feel that just a little more discussion will bring the issue to a close, then it still makes sense (from their point of view) to continue.
es: Un comun, pero insatisfactorio modo de intentar solucinar una Guerra Santa es decir "Ya hemos gastado bastante tiempo y energia de lo que vale discutiendo esto! Por favor, ¿podemos dejarlo? Hay dos problemas en esto. Primero, que el tiempo y la energia ya se han gastado y ya no se pueden recuperar; la unica cuestion ahora es, cuanto esfuerzo <emphasis>mas</emphasis> permanecera? Si todavia alguno siente que un poco mas de discusion resolvera la cuestion pronto, entonces todavia tiene sentido (desde su punto de vista) continuar.
gl: Un camiño común, mais insatisfactorio, que a xente emprega para resolver as guerras santas pasa por dicir "xa esbanxamos máis tempo é enerxía discutindo isto da que realmente nos pode aportar! Por favor, podemos deixalo?" Hai dous problemas con isto. Primeiro, ese tempo e enerxía xa foron gastados e nunca van poder ser recuperados&mdash; a única cuestión agora é canto <emphasis>máis</emphasis> esforzo resta? Se alguén sente que algo máis de discusión vai conseguir pechar a discusión, entón (desde o seu punto de vista) aínda se pode continuar.

source: The other problem with asking for the matter to be dropped is that this is often equivalent to allowing one side, the status quo, to declare victory by inaction. And in some cases, the status quo is known to be unacceptable anyway: everyone agrees that some decision must be made, some action taken. Dropping the subject would be worse for everyone than simply giving up the argument would be for anyone. But since that dilemma applies to all equally, it's still possible to end up arguing forever about what to do.
es: El otro problema en preguntar para que la cuestion sea zanjada es que esto es a menudo equivalente a permitir a una parte el status quo, a declarar la victoria por inaccion. Y en algunos casos, el status quo es conocido por ser de cualquier forma inaceptable: todo el mundo esta de acuerdo en que se debe llegar a una decision, se debe tomar alguna accion. Dejar el tema seria peor para todo el mundo que simplemente apoyando el argumento que daria alguien. Pero dado que el dilema se aplica igualmente a todo el mundo, todavia es posible terminar discutiendo por siempre sobre que hacer.
gl: O outro problema de pedir que a cuestión sexa abandonada reside en que, a miúdo, esta actitude considérase equivalente a unha vitoria de unha das partes, podendo declarar a vitoria por inacción da outra. E nalgúns casos, o status quo é inaceptable en calquera dos casos: todo o mundo está de acordo en que se debe tomar algunha decisión, e levar a cabo algunha acción. Deixar o asunto pode ser peor para todo o mundo que simplemente renderse. Mais dado que este dilema é aplicable a todas as partes por igual, aínda é posible continuar eternamente coa discusión sobre o que hai que facer.

source: So how should you handle holy wars?
es: ¿Como deberias manejar una Guerra Santa?
gl: Como deberías manexar unha guerra santa?

source: The first answer is, try to set things up so they don't happen. This is not as hopeless as it sounds:
es: Puedes anticipar ciertas Guerras Santa estandar: tienden a tratar sobre lenguajes de programacion, licencias (mira <xref linkend="license-compatibility"/><phrase output="printed"> in <xref linkend="legal"/></phrase>), en respuesta a munging (mira <xref linkend="reply-to"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>), y algunos otros topicos. Normalmente cada proyecto tiene una o dos Guerras Santas, tambien, las cuales los desarrolladores mas experimentados estaran ya familiarizados. Las tecnicas para frenar las Guerras Santas, o al menos limitar su daño, son casi las mismas en cualquier lugar. Incluso si eres positivo y tu parte es correcta, intenta encontrar <emphasis>alguna</emphasis> manera de expresar simpatia y comprension hacia los puntos de vista que los otros hacen. A menudo el problema en una Guerra Santa es porque cada parte ha construido sus muros lo mas alto posible, y dejan claro que cualquier otra opinion es totalmente idiota, el acto de rendirse o cambiar el pensamiento de alguien se hace psicologicamente insostenible: sería un reconocimiento no solamente siendo erróneo, pero habiendo sido <emphasis>ciertamente</emphasis>y todavia siendo erróneo. La manera en que puedes hacer este reconocimiento aceptable por la otra parte es expresar alguna duda tu mismo; precisamente mostrando que comprendes sus argumentos y al menos eres sensible a ellos, si no persuasivo finalmente. Haz un gesto que proporcione espacio para un gesto recíproco, y normalmente la situación mejorará. No es ni más ni menos probable que consigas el resultado técnico que querías, pero al menos puedes evitar el daño colateral innecesario a la moral del proyecto.
gl: A primeira resposta é tentar configurar as cousas para que non se declaren guerras santas. Isto non é tan inútil como soa:

source: You can anticipate certain standard holy wars: they tend to come up over programming languages, licenses (see <xref linkend="license-compatibility"/><phrase output="printed"> in <xref linkend="legal"/></phrase>), reply-to munging (see <xref linkend="reply-to"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>), and a few other topics. Each project usually has a holy war or two all its own, as well, which longtime developers will quickly become familiar with. The techniques for stopping holy wars, or at least limiting their damage, are pretty much the same everywhere. Even if you are positive your side is right, try to find <emphasis>some</emphasis> way to express sympathy and understanding for the points the other side is making. Often the problem in a holy war is that because each side has built its walls as high as possible, and made it clear that any other opinion is sheer foolishness, the act of surrendering or changing one's mind becomes psychologically unbearable: it would be an admission not just of being wrong, but of having been <emphasis>certain</emphasis> and still being wrong. The way you can make this admission palatable for the other side is to express some uncertainty yourself&mdash;precisely by showing that you understand the arguments they are making and find them at least sensible, if not finally persuasive. Make a gesture that provides space for a reciprocal gesture, and usually the situation will improve. You are no more or less likely to get the technical result you wanted, but at least you can avoid unnecessary collateral damage to the project's morale.
es: Cuando una Guerra Santa no se puede evitar, decide pronto cuanto la apoyas, y entonces estáte dispuesto públicamente a ceder. Cuando hagas esto, puedes decir que no estás respaldándola porque la Guerra Santa no lo vale, pero no expreses ningún rencor y <emphasis>no</emphasis> tomes la oportunidad para una despedida disparando contra los argumentos de la otra parte. Darse por vencido es efectivo sólo cuando se hace con elegancia.
gl: Podes anticiparte a determinadas guerras santas máis ou menos estándar: tenden a versar sobre linguaxes de programación, licenzas (bótalle unha ollada a <xref linkend="license-compatibility"/><phrase output="printed"> en <xref linkend="legal"/></phrase>), responderlle aos desconformes (ver <xref linkend="reply-to"/><phrase output="printed"> ne <xref linkend="technical-infrastructure"/></phrase>), e uns poucos temas máis. Ademais, cada proxecto adoita ter unha ou dúas guerras santas da súa propia colleita, coas que os desenvolvedores de longo percorrido vanse familiarizar con prontitude. As técnicas para parares guerras santas, ou para limitares os seus danos, son máis ou menos as mesmas en calquera lugar. Mesmo se estiveres seguro de que o teu lado é o que ten a razón, tenta atopar <emphasis>algún</emphasis> xeito de expresares simpatía e comprensión polas cuestións que o outro lado está a facer. Moitas veces o problema de base nunha guerra santa atópase en que cada parte construíu os seus muros o máis altos que puido, e deixou claro que calquera outra opinión é unha unha parvada. O acto de rendéreste ou mudares de idea tórnase en algo psicoloxicamente insoportable: podería ser un recoñecemento non só de estares equivocado, senón tamén de saberes que o estabas e non telo admitido. O xeito no que podes facer que esta admisión sexa aceptable para o outro bando é expresando algunha inseguridade en ti mesmo, precisamente explicando de que entendes algúns dos seus argumentos, e visualizando que os tes en consideración, se definitivamente non te persuadiron. Fai xestos que fornezan un espazo para que haxa outros xestos recíprocos, e normalmente a situación vai mellorar. Ti non vas estar nin mellor nin peor posicionado para alcanzares os resultados técnicos que buscas, mais cando menos vas poder eliminar danos colaterais (totalmente innecesarios) na moral do proxecto.

source: When a holy war can't be avoided, decide early how much you care, and then be willing to publicly give up. When you do so, you can say that you're backing out because the holy war isn't worth it, but don't express any bitterness and <emphasis>don't</emphasis> take the opportunity for a last parting shot at the opposing side's arguments. Giving up is effective only when done gracefully.
es: Las Guerras Santas de lenguajes de programación son un caso especial, porque a menudo son mayormente técnicas, todavía mucha gente se siente cualificada para tomar parte en ellas, y el interes es muy alto, ya que el resultado puede determinar en gran medida en que lenguaje se va a escribir el proyecto. La mejor solución es elegir el lenguaje pronto, con la influencia de los desarrolladores iniciales, y entonces defenderlo en los terrenos en los que eres comfortable escribiendo, <emphasis>no</emphasis> en el terreno que sería mejor en el que otro lenguaje se pudiera utilizar. Nunca dejes que la conversación en una comparación académica de lenguajes de programación (esto parece ocurrir especialmente cuando alguien menciona Perl, por alguna razón); éste es un tópico muerto en el que simplemente debes evitar caer.
gl: Cando unha guerra santa non pode ser evitada, decide o máis axiña que poidas canto che importa, e prepárate para renderte publicamente. Cando fagas isto, podes dicir que non estás apoiándoa porque a guerra santa non o merece, mais non expreses ningún rancor e <emphasis>non</emphasis> te aproveites da oportunidade para unha despedida disparando contra os argumentos da outra parte. Darse por vencido é efectivo só cando se fai con elegancia.

source: Programming language holy wars are a bit of a special case, because they are often highly technical, yet many people feel qualified to take part in them, and the stakes are very high, since the result may determine what language a good portion of the project's code is written in. The best solution is to choose the language early, with buy-in from influential initial developers, and then defend it on the grounds that it's what you are all comfortable writing in, <emphasis>not</emphasis> on the grounds that it's better than some other language that could have been used instead. Never let the conversation degenerate into an academic comparison of programming languages (this seems to happen especially often when someone brings up Perl, for some reason); that's a death topic that you must simply refuse to be drawn into.
es: Para consultar más fondo histórico de las Guerras Santas, mira <ulink url="http://catb.org/~esr/jargon/html/H/holy-wars.html"></ulink>, y el artículo de Danny Cohen que popularizó el término, <ulink url="http://www.ietf.org/rfc/ien/ien137.txt"></ulink>.
gl: As guerras santas sobre linguaxes de programación son un caso especial, porque a miúdo son altamente técnicas, habendo moita xente que se sente cualificada para tomar parte nelas, e contando cun interese moi alto, xa que o resultado pode determinar en gran medida en que linguaxe se vai a desenvolver o proxecto. A mellor solución é escoller a linguaxe logo, coa participación dos desenvolvedores iniciais influíntes, e entón defender esta solución nos terreos nos que todos esteades cómodos escribindo nesa linguaxe, <emphasis>non</emphasis> nos terreos nos que estea linguaxe sexa mellor que outras linguaxes que poderían ser empregadas no seu lugar. Nunca deixes que a conversa dexenere nunha comparación académica de linguaxes de programación (isto parece ocorrer especialmente cando alguén menciona Perl, por algunha razón); este é un tema morto no que simplemente debes evitar caer.

source: For more historical background on holy wars, see <ulink url="http://catb.org/~esr/jargon/html/H/holy-wars.html"></ulink>, and the paper by Danny Cohen that popularized the term, <ulink url="http://www.ietf.org/rfc/ien/ien137.txt"></ulink>.
es: El efecto "Ruido Minoritario"
gl: Para un maior coñecemento histórico sobre as guerras santas, mira <ulink url="http://catb.org/~esr/jargon/html/H/holy-wars.html"></ulink>, e mailo artigo de Danny Cohen, no que se popularizou o termo, <ulink url="http://www.ietf.org/rfc/ien/ien137.txt"></ulink>.

source: The "Noisy Minority" Effect
es: En cualquier discusion de una lista de correo, es fácil para una pequeña minoría dar la impresión de que hay un gran acuerdo de contrariead, esto es inundando la lista con numerosos y largos emails. Es igual a hacer una maniobra obstruccionista, excepto que la ilusión de la disensión general es incluso más poderosa, porque está dividida entre un número arbitrario de posts discretos y a la mayoría de la gente no le importa seguir la pista de quién ha dicho que, cuando. Sólo tienen una impresión instintiva de que el tema es muy controvertido, y esperan a que el escándalo disminuya.
gl: O efecto "minoría ruidosa"
