Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: Send a mail to your project's announcement mailing list. This list's name should actually be "announce", that is, <literal>announce@yourprojectdomain.org</literal>, because that's a fairly standard convention now, and the list's charter should make it clear that it is very low-traffic, reserved for major project announcements. Most of those announcements will be about new releases of the software, but occasionally other events, such as a fundraising drive, the discovery of a security vulnerability (see <xref linkend="security"/>)<phrase output="printed"> later in this chapter</phrase>, or a major shift in project direction may be posted there as well. Because it is low traffic and used only for important things, the <literal>announce</literal> list typically has the highest subscribership of any mailing list in the project (of course, this means you shouldn't abuse it&mdash;consider carefully before posting). To avoid random people making announcements, or worse, spam getting through, the <literal>announce</literal> list must always be moderated.
es: Intenta realizar los anuncios en todos esos sitios al mismo tiempo , tanto como sea posible. A la gente puede confundirle si ven un anuncio en la lista de correo pero no lo ven reflejado en la página principal del proyecto o en su área de anuncios de prensa. Si tienes los diversos cambios (correos, ediciones de página web, etc.) encolados y preparados para enviarlos de una vez, podrás mantener la ventana de inconsistencia al mínimo.
gl: Envía un correo á lista de correo de anuncios do teu proxecto. O nome desta lista debería ser "announce", é dicir, <literal>announce@dominio-do-teu-proxecto.org</literal> xa que é unha convención estándar a día de hoxe; na definición da lista deberías deixar claro que é unha lista de moi baixo tráfego, reservada para anuncios importantes do proxecto. A maioría destes anuncios van ser sobre novas versións do software, mais ocasionalmente outros eventos, como os de colecta de fondos, o descubrimento dunha vulnerabilidade de seguridade (ver <xref linkend="security"/>)<phrase output="printed"> máis adiante neste capítulo</phrase>), ou unha mudanza importante na dirección do proxecto tamén poden ser enviados a esta lista. Dado que é de baixo tráfego e empregada unicamente para cousas importantes, a lista <literal>announce</literal> adoita ser a de maior grao de subscrición de todo o proxecto (o cal, por suposto, significa que non debes abusar dela; así que pénsao coidadosamente antes de publicares na mesma). Para evitar que a xente aleatoriamente poida facer anuncios na mesma, ou peor, que chegue spam a través dela, a lista <literal>announce</literal> sempre debe estar moderada.

source: Try to make the announcements in all these places at the same time, as nearly as possible. People might get confused if they see an announcement on the mailing list but then don't see it reflected on the project's home page or in its press releases area. If you get the various changes (emails, web page edits, etc.) queued up and then send them all in a row, you can keep the window of inconsistency very small.
es: Para un evento poco importante, puedes prescindir de alguno o todos los consejos de arriba. El evento todavía será conocido por el mundo exterior en proporción directa a su importancia. Por ejemplo, cuando una nueva liberación de software es un gran evento, marcar meramente la fecha de la siguiente liberación también debe tenerse en cuenta, aunque no sea tan importante como la liberación del software. Marcar la fecha merece un correo a la lista de correo diario (no a la lista de anuncios), y una actualización en la ruta del proyecto o del estado en la página web, pero no más.
gl: Tenta facer os anuncios en todos estes lugares ao mesmo tempo, o máis proximamente posible. A xente pode obter unha sensación de confusión se ven un anuncio na lista de correo mais non o ven reflectido na páxina web do proxecto ou na súa área de notas de prensa. Se acumulares todas as fontes (emails, edición da páxina web, etc) e lanzares todo ao mesmo tempo, entón seguramente acadarás un nivel de incoherencia moi baixo.

source: For a less important event, you can eliminate some or all of the above outlets. The event will still be noticed by the outside world in direct proportion to its importance. For example, while a new release of the software is a major event, merely setting the date of the next release, while still somewhat newsworthy, is not nearly as important as the release itself. Setting a date is worth an email to the daily mailing lists (not the announce list), and an update of the project's timeline or status web page, but no more.
es: Sin embargo, todavía puedes ver que las fechas aparecen en otros sitios de Internet, donde hay gente interesada en el proyecto. La gente suele actuar como lurkers en tus listas de correo, simplmente escuchando y sin decir nunca nada, no son necesariamente silenciosos en otros sitios. El boca a boca da una amplia distribución; deberías contar con ello, y construir incluso los anuncios menores de tal manera para la transmisión informal exacta. Específicamente, posts, que esperas que sean citados deberían tener una parte tiene-que-ser-citada, así como tú escribiste el anuncio formal. Por ejemplo:
gl: Para un evento menos importante, podes prescindir dalgún dos medios explicados. O evento vai ficar igualmente notificado ao mundo exterior, mais vaino facer en proporción á súa importancia. Por exemplo, embora unha nova versión sexa un evento de importancia, simplemente marcar a data da seguinte versión, embora sexa aproximada, non é tan importante como o lanzamento en si mesmo. Marcar a data é merecedor dun correo electrónico ás listas de correo diarias (non á de anuncios) así como unha actualización da planificación temporal ou do status na páxina web, mais non é merecedora de máis.

source: However, you might still see that date appearing in discussions elsewhere on the Internet, wherever there are people interested in the project. People who are lurkers on your mailing lists, just listening and never saying anything, are not necessarily silent elsewhere. Word of mouth gives very broad distribution; you should count on it, and construct even minor announcements in such a way as to encourage accurate informal transmission. Specifically, posts that you expect to be quoted should have a clearly meant-to-be-quoted portion, just as though you were writing a formal press release. For example:
es: Simplemente una actualización de progreso: estamos planeando liberar una versión 2.0 de Scanley a mediados de agosto de 2005. Siempre puedes revisar http://www.scanley.org/status.html en busca de actualizaciones. La principal nueva característica será búsquedas con expresiones regulares.
gl: A pesar disto, podes chegar a ver a data en cuestión aparecendo en discusións por calquera lugar en Internet no que houber xente interesada no proxecto. A xente que simplemente é receptora nas listas de correo, só escoitando e nunca dicindo nada, non é necesariamente silenciosa en todos lados. O boca a boca aporta unha distribución moi grande; debes telo en conta e mesmo construír os anuncios menores dun xeito que fomente a transmisión informal. Especificamente, os correos que esperas que sexan citados deberían contar cun anaco que diga "cita esta parte", como se estiveses escribindo unha nota de prensa formal. Por exemplo:

source: Just a progress update: we're planning to release version 2.0 of Scanley in mid-August 2005. You can always check http://www.scanley.org/status.html for updates. The major new feature will be regular-expression searches.
es: Otras nuevas características incluyen:&nbsp;... También habrá varias correciones de bugs, incluyendo:&nbsp;...
gl: Actualización de progreso: estamos planificando a versión 2.0 de Ghandalf para mediados de Agosto do 2010. Sempre podes revisar http://www.ghandalf.org/status.html para ver actualización. A nova funcionalidade de maior calado vai ser as procuras mediante expresións regulares.

source: Other new features include:&nbsp;... There will also be various bugfixes, including:&nbsp;...
es: El primer párrafo es corto, da las dos piezas más importantes de información (la fecha de liberación y las principales nuevas características), y una URL para visitar en busca de más noticias. Sí este párrafo es la única cosa que se muestra en la pantalla de alguien, todavía lo estas haciendo muy bien. El resto del correo podría perderse sin afectar a la esencia del contenido. Por supuesto, en ocasiones la gente enlazará al correo completo, pero a menudo, citarán sólamente una parte. Dado que esto es una posibilidad, querrás poder hacerlo fácil para ellos, y conseguir alguna influencia sobre lo que se citará.
gl: Outras novas funcionalidades inclúen:&nbsp;... Para alén diso tamén vai haber varias correccións de erros, incluíndo :&nbsp;...

source: The first paragraph is short, gives the two most important pieces of information (the release date and the major new feature), and a URL to visit for further news. If that paragraph is the only thing that crosses someone's screen, you're still doing pretty well. The rest of the mail could be lost without affecting the gist of the content. Of course, sometimes people will link to the entire mail anyway, but just as often, they'll quote only a small part. Given that the latter is a possibility, you might as well make it easy for them, and in the bargain get some influence over what gets quoted.
es: Anunciando Vulnerabilidades de Seguridad
gl: O primeiro parágrafo é curto, aporta as dúas pezas máis importantes de información (a data de lanzamento e a nova funcionalidade de maior calado), e máis unha URL a visitar para ver máis novas. Se este parágrafo é a única cousa que vai cruzar pola pantalla de alguén, estariámolo facendo bastante ben. O resto do correo-e podería perderse sen afectarlle á esencia do correo. Por suposto, algunhas veces a xente enlazará o correo enteiro, mais en xeral o normal é que citen unicamente unha parte pequena. Dado que isto é unha posibilidade, de todos xeitos seguramente queiras facerllo fácil, e no mesmo pacote tamén contar con influencia sobre o que se citar.

source: Announcing Security Vulnerabilities
es: Manejar una vulnerabilidad de seguridad es diferente del manejo de cualquier otro tipo de reporte de error. En el software libre, hacer las cosas de manera abierta y transparente es normalmente casi como un credo religioso. Cada paso del proceso estándar de manejo de errores es visible a todo aquel que le preocupe verlo: la llegada del informe inicial, la consiguiente discusión, y la correción eventual.
gl: Anunciando vulnerabilidades de seguridade

source: Handling a security vulnerability is different from handling any other kind of bug report. In free software, doing things openly and transparently is normally almost a religious credo. Every step of the standard bug-handling process is visible to all who care to watch: the arrival of the initial report, the ensuing discussion, and the eventual fix.
es: Los errores de Seguridad son diferentes. Estos pueden comprometer datos de usuarios, y posiblemente ordenadores completos de usuarios. Para discutir tales problemas de manera abierta tiene que anunciarse su existencia a todo el mundo&mdash;incluyendo a todas las partes que pueden hacer un uso malicioso de la vulnerabilidad. Incluso realizando meramente el commit de una solución se anuncia efectivamente la existencia de la vulnerabilidad (existen atacantes potenciales que pueden buscar los logs de commits en proyectos públicos, buscando sistemáticamente cambios que indiquen problemas de seguridad en el código antes del cambio). La mayoría de proyectos open source han resuelto aproximadamente de la misma manera estos conflictos entre el secretismo y la abertura, basándose en estas guías básicas:
gl: Manexar as vulnerabilidades de seguridade é diferente de manexar calquera outro tipo de informe de erros. No software libre, facer as cousas aberta e transparentemente adoita ser case un credo relixioso. Cada paso do proceso estándar de manexo de erros é visible para calquera que o quixer ver: a chegada da notificación inicial, a conseguinte discusión, e maila eventual solución.

source: Security bugs are different. They can compromise users' data, and possibly users' entire computers. To discuss such a problem openly would be to advertise its existence to the entire world&mdash;including to all the parties who might make malicious use of the bug. Even merely committing a fix effectively announces the bug's existence (there are potential attackers who watch the commit logs of public projects, systematically looking for changes that indicate security problems in the pre-change code). Most open source projects have settled on approximately the same set of steps to handle this conflict between openness and secrecy, based on the these basic guidelines:
es: No hables sobre la vulnerabilidad de manera pública hasta que una solución esté disponible; entonces proporciona la solución al mismo tiempo exactamente que anuncias la vulnerabilidad.
gl: Os erros de seguridade son diferentes. Poden comprometer os datos dos usuarios, ou mesmo os seus ordenadores dun xeito completo. Discutir ese problema dun xeito aberto podería amosar a súa existencia ao mundo enteiro&mdash; incluíndo todas as partes que poderían facer un uso malicioso do erro. Deste xeito, mesmo facer commit dunha solución pode anunciar a existencia do erro (hai potencias atacantes que vixían dun xeito sistemático os rexistros públicos de commits dos proxectos, buscando mudanzas que indiquen problemas de seguridade no código previo á mudanza). A maioría dos proxectos software libre teñen establecido aproximadamente o mesmo conxunto de pasos para manexar o conflito entre o aperturismo e o secretismo, baseado nestas directrices básicas:

source: Don't talk about the bug publicly until a fix is available; then supply the fix at exactly the same moment you announce the bug.
es: Busca una solución tan rápido como puedas&mdash; especialmente si alguien externo al proyecto informo de la vulnerabilidad, porque sabes entonces que hay al menos una persona de fuera del proyecto que es capaz de explotar esa vulnerabilidad.
gl: Non falar publicamente sobre o erro ata que haxa unha solución dispoñible; nese momento fornecer a solución exactamente no mesmo momento no que anuncias o erro.

source: Come up with that fix as fast as you can&mdash;especially if someone outside the project reported the bug, because then you know there's at least one person outside the project who is able to exploit the vulnerability.
es: En la práctica, estos principios nos llevan a una serie de principios bastante estandarizados, los cuales se describen en la siguiente sección.
gl: Acadar a solución o máis axiña que poidas&mdash;especialmente se alguén externo ao proxecto foi quen informou do erro, porque entón xa sabes que existe polo menos unha persoa allea ao proxecto que podería explotar a vulnerabilidade.

source: In practice, those principles lead to a fairly standardized series of steps, which are described in the sections below.
es: Recibiendo el informe
gl: Na práctica, estes principios lévannos a unha serie estandarizada de pasos, os cales se describen nas seguintes seccións.

source: Receive the report
es: Obviamente, un proyecto necesita la característica de que cualquiera pueda informar sobre un error de seguridad. Pero la dirección regular para informar de errores no será, porque también puede ser vista por cualquiera. Por ello, tendrá que haber una lista de correo separada para recibir informes de errores de seguridad. Esta lista de correo no debe tener los archivos de manera que se puedan leer públicamente, y debe controlarse estrictamente a los subscriptores de la misma&mdash; sólo los desarrolladores de confianza y que lleven tiempo en el proyecto, podrán estar en la lista. Si necesitas una definición formal de "confianza", puedes orientarte con "cualquiera que ha tenido acceso para realizar commits desde hace dos años o más" o algo similar, para evitar favoritismos. Este es el grupo que manejará los errores de seguridad.
gl: Recibir o informe

source: Obviously, a project needs the ability to receive security bug reports from anyone. But the regular bug reporting address won't do, because it can be watched by anyone too. Therefore, have a separate mailing list for receiving security bug reports. That mailing list must not have publicly readable archives, and its subscribership must be strictly controlled&mdash;only long-time, trusted developers can be on the list. If you need a formal definition of "trusted", you can use "anyone who has had commit access for two years or more" or something like that, to avoid favoritism. This is the group that will handle security bugs.
es: Idealmente, la lista de seguridad no debería estar moderada o protegida contra el spam, ya que no querremos que un informe importante pueda filtrarse o se retrase simplemente porque los moderadores no estuvieron online aquel fin de semana. Si usas software automática de protección de spam, intenta realizar una configuración con características de gran tolerancia; es mejor dejar pasar unos cuantos correos spam que perder un informe. Para que la lista sea efectiva, por supuesto que debes informar de su dirección; pero dado que no estará moderada, y en gran parte, ligeramente protegida de spam, intenta no publicar su dirección sin algun tipo de transformación y ocultación de la dirección, tal y como se describe en <xref linkend="address-hiding"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>. Afortunadamente, el ocultar la dirección de correo no significa que ésta sea ilegible; echa un vistazo a <ulink url="http://subversion.tigris.org/security.html"></ulink>, y mira el código HTML de esta página, para ver un ejemplo.
gl: Obviamente, un proxecto precisa a habilidade de recibir informes de erro de seguridade enviados por calquera. Mais o enderezo habitual de recepción de erros non é o mellor lugar, xa que pode estar vixiado por calquera. Debido a isto, ten unha lista de correo separada para recibir informes sobre erros de seguridade. Esta lista de correo non debe ser accesible para o público xeral, e a subscrición á mesma debe estar estritamente controlada&mdash;só os desenvolvedores de confianza e con longa participación no proxecto poden estar nesta lista. Se precisas unha definición formal de "confianza", podes empregar "todo aquel que teña privilexios de commit desde hai dous anos ou máis" ou algo semellante, para evitares favoritismos. Este é o grupo que vai manexar os erros de seguridade.

source: Ideally, the security list should not be spam-protected or moderated, since you don't want an important report to get filtered out or delayed just because no moderators happened to be online that weekend. If you do use automated spam-protection software, try to configure it with high-tolerance settings; it's better to let a few spams through than to miss a report. For the list to be effective, you must advertise its address, of course; but given that it will be unmoderated and, at most, lightly spam-protected, try to never to post its address without some sort of address hiding transformation, as described in <xref linkend="address-hiding"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>. Fortunately, address-hiding need not make the address illegible; see <ulink url="http://subversion.tigris.org/security.html"></ulink>, and view that page's HTML source, for an example.
es: Desarrolla la solución silenciosamente
gl: Idealmente, a lista de seguridade non debería estar protexida contra spam nin moderada, dado que non queres que un informe importante sexa descartado ou atrasado simplemente porque non houbo moderadores en liña esa semana. Se empregas software de protección automática contra spam, trata de configuralo cos parámetros de maior tolerancia; é mellor deixar entrar un poucos correos de spam que perder un informe de erros. Para que a lista sexa efectiva por suposto que debes publicitar o seu enderezo; mais dado que non vai estar moderada, e máis importante, pobremente protexida contra spam, tenta non dar nunca o seu enderezo sen algún tipo de transformación que oculte o seu enderezo real, tal como se describe en <xref linkend="address-hiding"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>. Afortunadamente, a ocultación de enderezo non fai que o enderezo sexa ilexible; bótalle unha ollada a <ulink url="http://subversion.tigris.org/security.html"></ulink>, e mira o HTML fonte da páxina, por exemplo.

source: Develop the fix quietly
es: ¿Qué hace la lista de seguridad cuando recibe un informe? La primera tarea es evaluar la urgencia y severidad del problema. :
gl: Desenvolve silenciosamente a solución ao erro

source: So what does the security list do when it receives a report? The first task is to evaluate the problem's severity and urgency:
es: ¿Cómo de seria es la vulnerabilidad? Permite que un atacante malicioso tome la computadora de alguien que utiliza tu sofware? o únicamente hay una fuga de información sobre el tamaño de algounos de sus archivos?
gl: Entón, que fai a lista de seguridade cando recibe un informe? A primeira tarefa é avaliar a severidade do problema e maila súa urxencia:

source: How serious is the vulnerability? Does it allow a malicious attacker to take over the computer of someone who uses your software? Or does it, say, merely leak information about the sizes of some of their files?
es: ¿Cómo de fácil es explotar la vulnerabilidad? Se puede realizar el ataque con scripts, o hacerlo requiere un conocimiento circunstancial, suposiciones y suerte?
gl: Como de seria é a vulnerabilidade? Permite que un atacante malicioso tome o control do ordenador de alguén que use o teu software? Ou simplemente pode haber algunha fuga de información sobre os tamaños dalgúns dos seus ficheiros?

source: How easy is it to exploit the vulnerability? Can an attack be scripted, or does it require circumstantial knowledge, educated guessing, and luck?
es: <emphasis>¿Quién</emphasis> te informó del problema? La respuesta a esta pregunta, por supuesto que no cambia la naturaleza de la vulnerabilidad, pero te da una idea de cómo otras personas pueden conocerla. Si el informe viene de uno de los desarrolladores del propio proyecto, puedes respirar algo tranquilo (pero sólo un poco), porque puedes confiar en que ellos no se lo dirán a nadie más. Por otra parte, si viene de una dirección de correo como <literal>anonymous14@globalhackerz.net</literal>, entonces lo mejor será que actúes tan rápido como puedas. Después de todo la persona te hizo un favor informando del problema, pero no tienes idea de a cuanta gente más se lo ha contado, o cuanto tiempo esperará antes de explotar la vulnerabilidad en instalaciones en producción.
gl: Como de fácil é explotar a vulnerabilidade? Pode realizarse o ataque con scripts, ou require coñecemento circunstancial, suposicións e sorte?
