Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: But exactly where in the process did something go wrong? Was it when the original person attached her solution to the issue&mdash;should she have posted it to the list instead? Or was it when the second person responded in the issue, instead of on the list?
es: No hay una respuesta correcta, pero hay un principio general: sí simplemente vas a añadir un apunte, hazlo en el tracker, pero si vas a empezar una <emphasis>conversacion</emphasis>, entonces hazlo en la lista de correo. Puede que a veces no seas capaz de saber cual es el caso, simplemente usa el juicio. Por ejemplo, cuando añadas un parche que contiene una solución potencialmente controvertida, puedes anticiparte de que la gente tendrá preguntas sobre ella. Así que aunque normalmente añadas el parche al ticket (asumiendo que no quieres o no puedas realizar el cambio directamente), en este caso puedes elegir enviarlo a la lista de correo. En todo caso, eventualmente vendrá un punto donde una parte o la otra indicarán sobre ir desde un simple añadido de datos a la conversación actual; en el ejemplo que iniciaba esta sección, este sería el segundo que responde, quién dándose cuenta de que había problemas con el parche, pudo predecir que iba a darse una conversación sobre ello, y de ahí que debiera hacerse en el medio apropiado.
gl: Mais, exactamente en que punto do proceso se fixo algo incorrecto? Foi no momento no que a persoa orixinal engadiu a súa solución ao erro&mdash; tería que telo enviado á lista en lugar de engadilo? Ou foi cando a segunda persoa respondeu á incidencia, en lugar de facelo na lista de correo?

source: There isn't one right answer, but there is a general principle: if you're just adding data to an issue, then do it in the tracker, but if you're starting a <emphasis>conversation</emphasis>, then do it on the mailing list. You may not always be able to tell which is the case, but just use your best judgement. For example, when attaching a patch that contains a potentially controversial solution, you might be able to anticipate that people are going to have questions about it. So even though you would normally attach the patch to the issue (assuming you don't want to or can't commit the change directly), in this case you might choose to post it to a mailing list instead. At any rate, there eventually will come a point in the exchange where one party or the other can tell that it is about to go from mere appending of data to an actual conversation&mdash;in the example that started this section, that would be the second respondent, who on realizing that there were problems with the patch, could predict that a real conversation is about to ensue, and therefore that it should be held in the appropriate medium.
es: Para usar una analogía matemática, si la información parece que será rápidamente convergente, entonces ponla directamente en el bug tracker; si parece que será divergente, entonces el mejor sitio serán una lista de correo o el canal de IRC.
gl: Non hai unha resposta correcta, mais si que hai un principio xeral: se simplemente estiveres engadindo datos a unha incidencia, entón faino no bug tracker, mais se estiveres comezando unha <emphasis>conversa</emphasis>, entón faino na lista de correo. Non sempre poderás identificar cada caso, simplemente emprega o teu xuízo o mellor que poidas. Por exemplo, cando forneceres un remendo cunha solución potencialmente controvertida, debes anticipar que posiblemente haxa xente que teña preguntas sobre a mesma. Así que aínda que normalmente fornezas o remendo conxuntamente coa notificación, (asumindo que non queres, ou non podes, facer a mudanza directamente), neste caso deberías escoller enviar a mensaxe á lista de correo en lugar de empregar o bug tracker. De tódolos xeitos, pode haber casos nos que for difícil En todo caso, eventualmente acontecerá un momento onde unha parte ou a outra indiquen que simplemente están engadindo datos á conversa actual&mdash;no exemplo que iniciaba esta sección, este sería o segundo actor, o cal responde, quen ao decatarse de que había problemas co remendo, puido predicir que ía iniciarse unha conversa sobre el, e de aí que debera facerse no canal apropiado.

source: To use a mathematical analogy, if the information looks like it will be quickly convergent, then put it directly in the bug tracker; if it looks like it will be divergent, then a mailing list or IRC channel would be a better place.
es: Esto no significa que nunca debe haber intercambios en el bug tracker. Preguntar sobre más detalles de la reproducción del fallo al informador original tiende a ser un proceso altamente convergente. Es poco probable que la respuesta de la persona genere nuevos tickets; simplemente rellenará información que ya ha sido añadida. No hay necesidad de distrare a la lista de correo con este proceso; esto significa que; tengas cuidado con una serie de comentarios en el tracker. Así mismo, si estás demasiado seguro de que el bug ha sido reportado erróneamente (por ejem., no es un bug), entonces simplemente puedes decirlo correctamente en el ticket. Incluso apuntandolo como un problema menor con una solución propuesta está bien, asumiendo que el problema no va a ser un problema a toda la solución.
gl: Empregando unha analoxía matemática, se a información parece como que vai ser rapidamente converxente, entón pona directamente no bug tracker; se parece como que vai haber diverxencias, entón unha lista de correo ou un canal IRC serían un lugar mellor.

source: This doesn't mean there should never be any exchanges in the bug tracker. Asking for more details of the reproduction recipe from the original reporter tends to be a highly convergent process, for instance. The person's response is unlikely to raise new issues; it's simply going to flesh out information already filed. There's no need to distract the mailing list with that process; by all means, take care of it with a series of comments in the tracker. Likewise, if you're fairly sure that the bug has been misreported (i.e., is not a bug), then you can simply say so right in the issue. Even pointing out a minor problem with a proposed solution is fine, assuming the problem is not a showstopper for the entire solution.
es: Por otra parte, si estás lanzando razones filosóficas sobre el alcance del bug o el comportamiento apropiado del software, puedes estar seguro de que otros desarrolladores querrán involucrarse. La discusión tenderá a discrepar por momentos antes de convergir, así que mejor hacerlo en la lista de correo.
gl: Isto non quere dicir que nunca deba haber ningún troco no bug tracker. Preguntar por máis detalles sobre a reprodución do erro por parte do informador orixinal adoita ser un proceso moi produtivo, por exemplo. A resposta do informador é pouco probable que lance novas incidencias; simplemente aumentará a información previamente fornecida. Non hai necesidade de crear distracción na lista de correo con este proceso. En resumo, todo isto significa que debes ter coidado cos comentarios no bug tracker. Do mesmo xeito, se estiveres completamente seguro de que o erro foi mal notificado (por exemplo, non é un erro), entón abonda con que o notifiques na propia incidencia. Mesmo notificar un problema menor cunha solución proposta é axeitado, asumindo que o problema non vai impedir toda a solución.

source: On the other hand, if you're raising philosophical issues about the bug's scope or the software's proper behavior, you can be pretty sure other developers will want to be involved. The discussion is likely to diverge for a while before it converges, so do it on the mailing list.
es: Cuando decidas hacerlo en la lista de correo, enlaza siempre al hilo de la lista del correo con el ticket. Todavía será importante para alguien que siga el ticket, ser capáz de alcanzar la discusión, aunque el ticket en si mismo no esté en el foro de discusión. La persona que empieza el hilo puede puede encontrar esto muy difícil, pero el open source es fundamentalmente una cultura de responsabilidad de escribir: es mucho más importante hacer las cosas fáciles para cientos de miles de personas que pueden leer el bug que para las tres o cinco personas que pueden escribir sobre él.
gl: Porén, se estiveres lanzando incidencias filosóficas sobre o alcance do erro ou sobre o comportamento perfecto para o software, podes estar seguro de que outros desenvolvedores van querer participar nunha discusión. Probablemente a discusión diverxa durante un tempo, ata converxer, así que faino na lista de correo.

source: Always link to the mailing list thread from the issue, when you choose to post to the mailing list. It's still important for someone following the issue to be able to reach the discussion, even if the issue itself isn't the forum of discussion. The person who starts the thread may find this laborious, but open source is fundamentally a writer-responsible culture: it's much more important to make things easy for the tens or hundreds of people who may read the bug than for the three or five people writing about it.
es: Es correcto tomar conclusiones importantes o sumarios de la lista de discusión y copiarlas en el ticket, si esto hace las cosas más faciles para los lectores. Un punto común es empezar una lista de discusión, poner un enlace al hilo en el ticket, y entonces cuando la discusión finalice, copiar el sumario final en el ticket (junto con un enlace al mensaje conteniendo el sumario), de tal manera que alguien que navegue por este ticket pueda fácilmente ver a que conclusiones se llegaron sin tener que hacer click en ningún otro sitio. Date cuenta de que el problema usual de duplicación de datos "dos maestros" no tiene lugar aquí, porque ambos archivos y comentarios de tickets son normalmente estáticos, datos intercambiables.
gl: Enlaza sempre ao fío da lista de correo adicado á incidencia, cando escollas mandar a notificación á lista de correo. Segue sendo moi importante, para alguén que siga a incidencia, poder ser capaz de trazar a discusión, mesmo se a incidencia en si mesma non é o foro da discusión. A persoa que comeza o fío pode atopar este traballo como algo incómodo, mais o software libre baséase fundamentalmente nunha cultura de escritor responsable: é moito máis importante facer sinxelas as cousas para ducias ou centos de persoas que poidan ler o informe de erros que para tres ou cinco persoas que escriban sobre o mesmo.

source: It's fine to take important conclusions or summaries from the list discussion and paste them into the issue, if that will make things convenient for readers. A common idiom is to start a list discussion, put a link to the thread in the issue, and then when the discussion finishes, paste the final summary into the issue (along with a link to the message containing that summary), so someone browsing the issue can easily see what conclusion was reached without having to click to somewhere else. Note that the usual "two masters" data duplication problem does not exist here, because both archives and issue comments are usually static, unchangeable data anyway.
es: Publicidad
gl: É correcto coller as conclusións importantes e mailos resumos desde a lista de discusión e pegalos na incidencia no bug tracker, se isto vai ser algo conveniente para os lectores. Un idioma común pode ser comezar nunha rolda de discusión, poñer unha ligazón ao fío concreto na incidencia no bug tracker, e cando a discusión rematar, pegar o resumo final na propia incidencia (conxuntamente cunha ligazón á mensaxe que conteña ese resumo), de tal xeito que calquera que navegue á incidencia poida dun xeito sinxelo ver que conclusión se alcanzou sen ter que premer en ningún outro lugar. Fíxate en que o problema habitual de duplicación proveniente da casuística das "dúas copias mestras" aquí non existe, dado que ambos arquivos e notificacións adoitan ser estáticos, co cal estamos a falar de datos inalterables.

source: Publicity
es: En el software libre, existe una continua barrera muy fina entre las discusiones púramente internas y las declaraciones de relaciones públicas. Esto es parcialmente así porque la audiencia objetivo no esta muy-definida: dado que la mayoría o todos los posts son accesibles públicamente, el proyecto no tiene control sobre la impresión que de él tiene la gente. Alguien; digamos, un <ulink url="slashdot.org"></ulink> editor; puede arrastrar la atencion de millones de lectores' a un post sobre el que nadie esperaba que fuera visto fuera del proyecto. Este es un hecho real con el que todos los proyectos open source viven, pero en la práctica, el riesgo es normalmente pequeño. En general, los anuncios que el proyecto más quiere publicitar serán los que más se publicitarán, asumiendo que usas los mecanismos correctos para indicar los valores más relativos al mundo exterior.
gl: Publicidade

source: In free software, there is a fairly smooth continuum between purely internal discussions and public relations statements. This is partly because the target audience is always ill-defined: given that most or all posts are publicly accessible, the project doesn't have full control over the impression the world gets. Someone&mdash;say, a <ulink url="http://slashdot.org/">slashdot.org</ulink> editor&mdash;may draw millions of readers' attention to a post that no one ever expected to be seen outside the project. This is a fact of life that all open source projects live with, but in practice, the risk is usually small. In general, the announcements that the project most wants publicized are the ones that will be most publicized, assuming you use the right mechanisms to indicate relative newsworthiness to the outside world.
es: Para grandes comunicados, suele haber cuatro o cinco canales principales de distribución, en cuales los anuncios deben ser hechos lo más simultáneamente posible.:
gl: No software libre existe unha barreira case inexistente entre as discusións puramente internas e mailas públicas. Isto en parte débese a que a audiencia obxectivo sempre está pouco definida: dado que a maioría ou todos os correos son publicamente accesibles, o proxecto non ten un control efectivo sobre a impresión que del ten o resto do mundo. Alguén, digamos un editor de <ulink url="http://slashdot.org/">mancomun.org</ulink>, pode atraer a atención de milleiros de lectores a un correo que ninguén esperaba que fose visto fóra do proxecto. Esta é unha realidade coa que viven todos os proxectos de software libre, mais na práctica o risco adoita ser pequeno. En xeral, os anuncios que o proxecto máis quere publicitar adoitan ser os que son máis publicitados, asumindo que empregues os mecanismos axeitados para indicarllo ao resto do mundo.

source: For major announcements, there tend to be four or five main channels of distribution, on which announcements should be made as nearly simultaneously as possible:
es: Probablemente la página principal de tu proyecto es la página más vista de tu proyecto. Si tienes un gran comunicado, pon la propaganda ahí. La propaganda debería ser un pequeño resumen que enlace a la noticia de prensa (ver abajo) para más información.
gl: Para grandes anuncios, adóitanse empregar catro ou cinco canais principais de distribución, nos cales os devanditos anuncios deberían facerse o máis simultaneamente posible:

source: Your project's front page is probably seen by more people than any other part of the project. If you have a really major announcement, put a blurb there. The blurb should be a very brief synopsis that links to the press release (see below) for more information.
es: Al mismo tiempo, debes tener una parte del sitio web denominada "Noticias" o "Notas de prensa" donde los anuncios se describan en detalle. Parte del propósito de las notas de prensa es proporcionar un simple objeto de anuncio canónico al que otros sitios puedan enlazar, por lo que hay que asegurarse que está correctamente estructurado: tanto con una nueva página por release, como una entrada discreta de blog, o cualquier otro tipo de entidad que pueda ser enlazada manteniéndose todavía a parte de otras notas de prensa en la misma área.
gl: A páxina de portada do teu proxecto probablemente sexa vista por máis xente que calquera outra parte do proxecto. Se tiveres un anuncio realmente grande que facer, fai propaganda aí. A propaganda debería estar composta por un breve resumo que enlace ao comunicado de prensa (ver a continuación) para máis información.

source: At the same time, you should also have a "News" or "Press Releases" area of the web site, where the announcement can be written up in detail. Part of the purpose of a press release is to provide a single, canonical "announcement object" that other sites can link to, so make sure it is structured accordingly: either as one web page per release, as a discrete blog entry, or as some other kind of entity that can be linked to while still being kept distinct from other press releases in the same area.
es: Si tu proyecto tiene un feed RSS, asegúrate de que el anuncio tambíen irá por él. Esto puede ocurrir automáticamente al crear la nota de prensa, dependiendo de como está configurado tu sitio web. (<firstterm>RSS</firstterm> es un mecanismo para distribuir sumarios de noticias a través de meta-datos-enriquecidos a subscriptores, esto es, a gente que ha indicado un interés en recibir esos sumarios. Mira <ulink url="http://www.xml.com/pub/a/2002/12/18/dive-into-xml.html"></ulink> para más información sobre RSS.)
gl: Ao mesmo tempo, deberías ter tamén unha área de "Novas" ou "Notas de prensa" no sitio web, onde o anuncio poida ser escrito en detalle. Parte do propósito dunha nota de prensa é fornecer un "obxecto de anuncio" simple e canónico que outros sitios web poidan enlazar, así que asegúrate de estruturalo correctamente: tanto unha páxina web por anuncio, como unha entrada concreta nun blog, como algún outro tipo de entidade que poida ser enlazada, mantenas distinguibles do resto de notas de prensa na mesma área.

source: If your project has an RSS feed (see <xref linkend="rss"/>), make sure the announcement goes out there too. This may happen automatically when you create the press release, depending on how things are set up at your site.
es: Si el anuncio va a ser sobre una nueva versión de el software, entonces actualiza la entrada de tu proyecto en <ulink url="http://freshmeat.net/"></ulink> (mira <xref linkend="announcing"/> sobre crear entradas en primer lugar). Cada vez que actualices una entrada de Freshmeat, esta entrada irá a la lista de cambios de Freshmeat del día. Esta lista de cambios se actualiza no sólo en el propio Freshmeat, sino también en varios sitios de portales (incluyendo <ulink url="slashdot.org"></ulink>) el cual es visto tempranamente por hordas de gente. Freshmeat también ofrece la misma vía de datos a través de feed RSS, de tal manera que la gente que no esté subscrita al RSS de tu proyecto todavía puede ver el anuncio vía el RSS de Freshmeat.
gl: Se o teu proxecto conta cun feed RSS (bótalle unha ollada a <xref linkend="rss"/>), asegúrate que o anuncio tamén se publique nel. Isto debería facerse automaticamente cando creas a nota de prensa, dependendo de como teñas configuradas as cousas no teu sitio web.

source: If the announcement is about a new release of the software, then update your project's entry on <ulink url="http://freshmeat.net/"></ulink> (see <xref linkend="announcing"/> about creating the entry in the first place). Every time you update a Freshmeat entry, that entry goes onto the Freshmeat change list for the day. The change list is updated not only on Freshmeat itself, but on various portal sites (including <ulink url="http://slashdot.org"></ulink>) which are watched eagerly by hordes of people. Freshmeat also offers the same data via RSS feed, so people who are not subscribed to your project's own RSS feed might still see the announcement via Freshmeat's.
es: Envía un mail a tú lista de correo de anuncios del proyecto. Este nombre de lista actualmente debe ser algo como "anuncios", esto es, <literal>announce@yourprojectdomain.org</literal>, ya que es una convención muy estándar actualmente, y en la definición de la lista debe indicarse claramente que se trata de una lista con un tráfico muy bajo, reservada para anuncios internos del proyecto. La mayoría de esos anuncios serán sobre nuevas releases de software, y ocasionalmente de otros eventos, tales como fundraising drive, o sobre descubrimientos de vulnerabilidades de seguridad (ver <xref linkend="security"/>)<phrase output="printed"> después en este capítulo</phrase>, también puede enviarse un cambio de rumbo en la dirección del proyecto. Al tratarse de una lista de tráfico bajo y usada sólo para cosas importantes, la lista de <literal>anuncios</literal> tiene típicamente el mayor número de subscriptores de cualquier lista de correo del proyecto (por supuesto, esto significa que no deberías abusar de ella- consideralo cuidadosamente antes de utilizarla). Para evitar que gente al azar envíe anuncios, o lo que es peor, que llegue spam a través de ella, la lista de <literal>anuncios</literal> debe ser siempre moderada.
gl: Se o anuncio trata sobre o lanzamento dunha nova versión do software, entón actualiza a entrada do teu proxecto en <ulink url="http://freshmeat.net/"></ulink> (ver <xref linkend="announcing"/> para creares a entrada en primeiro lugar). Cada vez que actualizas unha entrada en Freshmeat, esta introdúcese na lista de mudanzas do día de Freshmeat. A lista de mudanzas actualízase non só en Freshmeat, senón tamén en varios portais (incluíndo <ulink url="http://slashdot.org"></ulink>) que son vistos con avidez por hordas de xente. Freshmeat tamén ofrece a mesma información por sindicación RSS, polo que a xente que non estiver subscrita ao RSS do teu proxecto podería igualmente ver o anuncio vía Freshmeat.
