Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: Internet-based collaboration is therefore psychologically odd, because it involves tight cooperation between human beings who almost never get to identify each other by the most natural, intuitive methods: facial recognition first of all, but also sound of voice, posture, etc. To compensate for this, try to use a consistent <firstterm>screen name</firstterm> everywhere. It should be the front part of your email address (the part before the @-sign), your IRC username, your repository committer name, your issue tracker username, and so on. This name is your online "face": a short identifying string that serves some of the same purpose as your real face, although it does not, unfortunately, stimulate the same built-in hardware in the brain.
es: La colaboración basada en Internet es por ello psicologicamente curiosa porque implica una estrecha colaboración entre seres humanos que nunca se identificarían entre ellos por los más naturales e intuitivos métodos: reconocimiento facial el primero de todos, pero tambien por el sonido de la voz, postura, etc. Para compensar esto, intenta usar un consistente <firstterm>Nombre</firstterm> en todas partes. Debería ser la primera parte de tu dirección de email (la parte antes de el signo @), tu nombre del IRC, tu nombre para hacer commit en los repositorios, tu marca de nombre en cualquier lado y así. Este nombre es tu "cara" online : un tipo de cadena de identificación que sirve el mismo propósito que tu cara real, aunque no lo es, desafortunadamente, estimula el mismo hardware consitutido en el cerebro.
gl: A colaboración baseada en internet é asimesmo psicolóxicamente extraña, xa que ten que ver coa estreita cooperación entre seres humanos que casi nunca se recoñecerán uns a outros polos máis naturais, intuitivos métodos: recoñecemento facial, voz, postura, etc. Para compensar todo isto, trata de usar un nome consistente <firstterm>nick</firstterm> en todos lados. Iso debería ser a primeira parte do teu correo (antes de @servidor.com), o nome que tes no IRC, o do repositorio de código, etc. Este nome é a túa cara "online": un corto identificador que ten o mesmo propósito que a túa cara real, aínda que desafortunadamente non estimula o mesmo hardware embebido no cerebro.

source: The screen name should be some intuitive permutation of your real name (mine, for example, is "kfogel"). In some situations it will be accompanied by your full name anyway, for example in mail headers:
es: El nombre que muestras debería ser una permutación intuitiva de tu nombre real (el mío por ejemplo, es "kfogel"). En algunas situaciones estará acompañado de tu nombre completo, por ejemplo en las cabeceras del correo:
gl: O nick podería ser algunha permutación intuitiva do teu nome real (o meu, por exemplo, é "kfogel"). Nalgunhas situacións irá acompañado do teu nome completo, por exemplo nas cabeceiras dos correos:

source: From: "Karl Fogel" &lt;kfogel@whateverdomain.com&gt;
gl: De "Karl Fogel" &lt;kfogel@whateverdomain.com&gt;

source: Actually, there are two things going on in that example. As mentioned earlier, the screen name matches the real name in an intuitive way. But also, the real name is <emphasis>real</emphasis>. That is, it's not some made-up appellation like:
es: Actualmente, hay dos puntos a tener en cuenta en ese ejemplo. Como ya he mencionado anteriormente, el nombre que mostraremos coincidirá con el nombre real de una manera intuitiva. Pero tambien, el nombre real es <emphasis>real</emphasis>. Esto es, no se compone de una denominación como:
gl: No anterior exemplo pódense notar 2 cousas. O nick encaixa dalgún modo intuitivo co nome real. Pero tamén, o nome real é <emphasis>real</emphasis>. É dicir, non é un nome como:

source: From: "Wonder Hacker" &lt;wonderhacker@whateverdomain.com&gt;
gl: De: "Maravilloso hacker" &lt;wonderhacer@whateverdomain.com&gt;

source: There's a famous cartoon by Paul Steiner, from the July 5, 1993 issue of <citetitle>The New Yorker</citetitle>, that shows one dog logged into a computer terminal, looking down and telling another conspiratorially: "On the Internet, nobody knows you're a dog." This kind of thought probably lies behind a lot of the self-aggrandizing, meant-to-be-hip online identities people give themselves&mdash;as if calling oneself "Wonder Hacker" will actually cause people to believe one <emphasis>is</emphasis> a wonderful hacker. But the fact remains: even if no one knows you're a dog, you're still a dog. A fantastical online identity never impresses readers. Instead, it makes them think you're more into image than substance, or that you're simply insecure. Use your real name for all interactions, or if for some reason you require anonymity, then make up a name that sounds like a perfectly normal real name, and use it consistently.
es: Hay una famosa tira cómica de Paul Steiner, del 5 de Julio de 1993 publicada en <citetitle>The New Yorker</citetitle>, que muestra a un perro que ha iniciado sesión en un terminal de ordenador, menospreciando y contando a los demás de manera conspiratoria: "En Internet, nadie sabe que tú eres un perro." Este tipo de pensamiento es una mentira detrás de tanto ensalzamiento propio, significado de estar a la moda con las identidades online que la gente se atribuye a ellos mismos; como llamándose uno mismo "Wonder Hacker" causará que la gente piense que uno <emphasis>es</emphasis> un maravilloso hacker. Pero los hechos permanecen: incluso si nadie sabe que tu eres un perro, todavía seras un perro. Una fantástica identidad online nunca impresiona a los lectores. En vez de esto, les hace creer que eres más una imagen que una persona con fundamento, o que simplemente eres inseguro. Utiliza tu nombre real para todas las interacciones, o si por alguna razón necesitas un anónimo, entonces crea un nombre que se parezca perfectamente a un nombre real, y úsalo consistentemente.
gl: Paul Steiner, nunha viñeta cómica publicada no The New Yorker o 5 de xullo de 1993 amosa a un can usando unha computadora e decíndolle a outro cunha pose conspiranoica: "na internet, ninguén sabe que eres un can". Este tipo de crenzas descansan probablemente detrás dun feixe de auto-bombo e identidades online infladas que a xente se otorga a sí mesmas &mdash; como si chamarse a un mesmo "hacker maravilloso" fixese que a xente o crese. Mais os feitos son os feitos: aínda que ninguén sepa que eres un can, seguiralo sendo. Unha identidade online fantasiosa non impresiona ós lectores, senón todo o contrario, failles crer que eres máis imaxe que substancia ou que simplemente eres inseguro. Usa o teu nome real para tódalas interaccións, ou, si por algunha razón precisas usa-lo anonimato, entón invéntate un nome que soa como un real, e úsao consistentemente.

source: In addition to keeping your online face consistent, there are some things you can do to make it more attractive. If you have an official title (e.g., "doctor", "professor", "director"), don't flaunt it, nor even mention it except when it's directly relevant to the conversation. Hackerdom in general, and free software culture in particular, tends to view title displays as exclusionary and a sign of insecurity. It's okay if your title appears as part of a standard signature block at the end of every mail you send, just don't ever use it as a tool to bolster your position in a discussion&mdash;the attempt is guaranteed to backfire. You want folks to respect the person, not the title.
es: Además de mantener tu imagen online consistente, hay algunas cosas más que puedes hacer para que resulte más atractiva. Si posees un título oficial (ejem., "doctor", "profesor", "director"), no hagas obstentación de ello, no lo menciones a menos que sea directamente relevante a la conversación. El mundo hacker en general y la cultura del Software Libre en particular, tienden a ver la muestra de títulos como un signo de exclusión y de inseguridad. Esta bien si tu título aparece como parte de un bloque de firma standard al final de cada mail que envías, pero no lo utilices como una herramienta para reforzar tu posición en una discusión; al intentarlo está garantizado el fracaso. Tu quieres que la gente te respete como persona, no por el título.
gl: Ademáis de usa-la túa identidade dixital dun modo consistente, hai algunhas cousas que poden facela máis atractiva. Si tes un título oficial (e.g., "doutor", "professor", "director"), non alardees del, non o menciones a non ser que sexa relevante na conversa. O mundo hacker, e o do software libre en particular, tende a ve-las insignias e títulos como signos de inseguridade. Non pasa nada si desexas usa-lo como unha firma estándar en cada correo-e que envíes, mais non o uses como un arma que sacar en cada conversa para defende-la túa posición &mdash; pois terá o efecto contrario. Desexas que a comunidade che respete a ti, non ó título.

source: Speaking of signature blocks: keep them small and tasteful, or better yet, nonexistent. Avoid large legal disclaimers tacked on to the end of every mail, especially when they express sentiments incompatible with participation in a free software project. For example, the following classic of the genre appears at the end of every post a particular user makes to a public mailing list I'm on:
es: Hablando de bloques de firma: mantelos pequeños y con buen gusto, o mejor todavía, inexistentes. Evita largas responsabilidades legales fijadas al final de cada mail, especialmente cuando estos expresen sentimientos incompatibles con la participación en un proyecto de software libre. Por ejemplo, el siguiente clásico del género aparece al final de cada post que un usuario particular hace en una lista de mail pública donde yo estoy:
gl: Falando de firmas estándar: fai que sexan pequenas e con bo gusto, ou mellor, que non existan. Evita enviar longos disclaimers adxuntos a cada correo-e, especialmente cando expresan sentimentos incompatibles coa paricipación nunha comunidade de software libre. Por exemplo, o seguinte clásico do xénero aparece ó fin de cada post que un usuario envía a unha rolda de correo á que estou suscrito (Nota do tradutor: o seguinte texto reprodúcese no idioma orixinal xa que é un texto legal):

source: For someone who's just showing up to ask a question now and then, that huge disclaimer looks a bit silly but probably doesn't do any lasting harm. However, if this person wanted to participate actively in the project, that legal boilerplate would start to have a more insidious effect. It would send at least two potentially destructive signals: first, that this person doesn't have full control over his tools&mdash;he's trapped inside some corporate mailer that tacks an annoying message to the end of every email, and he hasn't got any way to route around it&mdash;and second, that he has little or no organizational support for his free software activities. True, the organization has clearly not banned him outright from posting to public lists, but it has made his posts look distinctly unwelcoming, as though the risk of letting out confidential information must trump all other priorities.
es: Para alguien que únicamente se quiere presentar para preguntar alguna cuestión ahora y entonces, esta gran "renuncia" parece un poco fuera de lugar pero probablemente no hace ningún daño. Sin embargo, si esta persona quería participar activamente en el proyecto, este formalismo-legal empezaría a tener un efecto más insidioso. Enviaría al menos dos señales potencialmente destructivas: primero, qué esta persona no tiene un control total sobre sus herramientas; está atrapado dentro de una cuenta de correo corporativa que acarrea un mensaje molesto al final de cada mail, y el no tiene ningúna manera de evitarlo; y segundo, que tiene poco o ningún apoyo de su organización para contribuir en las actividades del software libre. Cierto, que la organización claramente no le ha prohibido completamente de postear en listas públicas, pero hace que sus posts se distingan con un mensaje frío, ya que el riesgo de dejar información confidencial debe figurarse sobre las demás prioridades.
gl: Para alguén que simplemente envía algunha pregunta de vez en cando, o anterior disclaimer parece un pouco tonto mais probablemente non fai ningún mal. Porén, si a persoa desexase participar máis activamente no proxecto, esa plantilla legal comezaría a ter efectos insidiosos. Enviaría ó resto da comunidade alomenos 2 sinais: primeiro, que a persoa non ten un control total sobre as ferramentas que usa&mdash; está atrapado na maquinaria da compañía para a que traballa&mdash; e segundo, que ten pouco ou ningún soporte por parte da súa organización en canto ás súas actividades na comunidade. Sí, non lle impiden participar en roldas de correo públicas, mais con esa plantilla legal, fai que as súas mensaxes non sexan moi benvidas, enviando a mensaxe de que información confidencial debe imporse sobre calquera outra prioridade.

source: If you work for an organization that insists on adding such signature blocks to all outgoing mail, then consider getting a free email account from, for example, <ulink url="http://gmail.google.com/">gmail.google.com</ulink>, <ulink url="http://www.hotmail.com/">www.hotmail.com</ulink>, or <ulink url="http://www.yahoo.com/">www.yahoo.com</ulink>, and using that as your address for the project.
es: Si trabajas para una organización que insiste en añadir tales bloques de firma en todos los mail salientes, entonces considera tener una cuenta de correo gratuito de, por ejemplo, <ulink url="gmail.google.com"></ulink>, <ulink url="www.hotmail.com"></ulink>, or <ulink url="www.yahoo.com"></ulink>, y utilizar esta dirección para el proyecto.
gl: Si a túa organización insiste en usar tal final de firma para tódolos correo-e, podes considerar obter unha conta de correo-e gratuita como por exemplo algunha de <ulink url="http://gmail.google.com/">gmail.google.com</ulink>, <ulink url="http://www.hotmail.com/">www.hotmail.com</ulink>, ou <ulink url="http://www.yahoo.com/">www.yahoo.com</ulink>, usándoa para a túa participación no proxecto.

source: Avoiding Common Pitfalls
es: Evitando los obstáculos corrientes
gl: Evitando os obstáculos comúns

source: Don't Post Without a Purpose
es: No envíes un correo sin un propósito
gl: Non envíes correos sen un propósito

source: A common pitfall in online project participation is to think that you have to respond to everything. You don't. First of all, there will usually be more threads going on than you can keep track of, at least after the project is past its first few months. Second, even in the threads that you have decided to engage in, much of what people say will not require a response. Development forums in particular tend to be dominated by three kinds of messages:
es: Un obstáculo común en la participación de un proyecto online es pensar que tú tienes que responder a todo. No tienes que hacerlo. Lo primero de todo, normalmente se generarán más hilos de correo de los que tú puedas manejar, al menos después de que el proyecto ha pasado sus primeros meses. Segundo, incluso en los hilos de correo en los que has decidido tomar parte, mucho de lo que comenta la gente no requerirá una respuesta. Los foros de desarrollo en particular tiendes a ser dominados por tres tipos de mensajes:
gl: Un erro común que adoita xurdir durante a participación nun proxecto en liña é pensar que tes que responder a todo. Non o tes que facer. Primeiramente, adoita haber máis fíos activos dos que poder seguir en profundidade, cando menos despois dos primeiros meses. Segundo, mesmo nos fíos nos que decidiras participar, moito do que a xente di realmente non precisa dunha resposta. Os foros de desenvolvemento tenden a ser dominados por tres tipos de mensaxes:

source: Messages proposing something non-trivial
es: Mensajes proponiendo algo que -no es trivial-
gl: Mensaxes propoñendo algo que non é trivial

source: Messages expressing support or opposition to something someone else has said
es: Mensajes mostrando apoyo u oposición a algo o a lo que alguien ha dicho.
gl: Mensaxes expresando apoio ou oposición a algo que alguén dixo

source: Summing-up messages
es: Mensajes de recapitulación
gl: Mensaxes de recapitulación ou resumo

source: None of these <emphasis>inherently</emphasis> requires a response, particularly if you can be fairly sure, based on watching the thread so far, that someone else is likely to say what you would have said anyway. (If you're worried that you'll be caught in a wait-wait loop because all the others are using this tactic too, don't be; there's almost always <emphasis>someone</emphasis> out there who'll feel like jumping into the fray.) A response should be motivated by a definite purpose. Ask yourself first: do you know what you want to accomplish? And second: will it not get accomplished unless you say something?
es: Ninguno de esos<emphasis>de manera inherente</emphasis> requerirá una respuesta, particularmente si puedes ser justamente seguro, basándote en revisar el hilo desde el principio, que alguien más probablemente dirá lo que tu ibas a decir de cualquier manera. (Si te preocupa que te tomen en un bucle de esperar-esperar porque todos los demás están usando esta táctica tambien, no lo hagas; casi siempre habrá <emphasis>alguien</emphasis> por ahí que se tenderá a crisparse.) Una respuesta debería ser motivada por un propósito definitivo. Pregúntate a ti mismo primero: ¿Sabes que es lo que quieres conseguir? Y segundo: ¿no se conseguirá a menos que digas algo?
gl: Ningún deles, cando menos dun xeito <emphasis>inherente</emphasis>, require unha resposta, especialmente se estás bastante seguro (tras revisares o fío) de que alguén é probable que responda dicindo o que ti terías dito. (Se te preocupas de ser atrapado nun bucle de espera-espera porque todos os demais están empregando a mesma táctica, non te preocupes; sempre vai haber <emphasis>alguén</emphasis> aí fóra que entre ao trapo). Unha resposta debería estar motivada por un propósito definido. Antes de nada, pregúntate a ti mesmo: sabes que é o que queres conseguir? E en segundo lugar: non se vai conseguir salvo que ti digas algo?

source: Two good reasons to add your voice to a thread are a) when you see a flaw in a proposal and suspect that you're the only one who sees it, and b) when you see that miscommunication is happening between others, and know that you can fix it with a clarifying post. It's also generally fine to post just to thank someone for doing something, or to say "Me too!", because a reader can tell right away that such posts do not require any response or further action, and therefore the mental effort demanded by the post ends cleanly when the reader reaches the last line of the mail. But even then, think twice before saying something; it's always better to leave people wishing you'd post more than wishing you'd post less. (See the second half of <xref linkend="bikeshed-full"/> for more thoughts about how to behave on a busy mailing list.)
es: Dos buenas razones para añadir tu voz a un hilo de corre son a) cuando veas un movimiento de proposición y sospeches que tú eres el único que así lo percibe, y b) cuando veas que no hay entendimiento entre otros, y sepas que puedes solucionarlo con un correo clarificándolo todo. Tambien generalmente está bien escribir únicamente para dar las gracias a alguien por algo, o para decir "Yo tambien!", porque un lector puede decir en seguida que tal correo no requiere ninguna respuesta ni acción adicional, y por lo tanto el esfuerzo mental demnadado por el post termina limpliamente cuando el lector llega a la última línea de el correo. Pero incluso entonces, piensalo dos veces antes de decir algo; es siempre mejor dejar a la gente deseando que escribas más a menudo que deseando que escribas menos. (Consulta la segunda parte de <xref linkend="bikeshed-full"/> para ver más ideas sobre como portarse en una lista de correo muy concurrida.)
gl: Dúas boas razóns para engadires a túa voz a un fío son a) cando vires un defecto nunha proposta e sospeitares que es o único que o está a ver, e b) cando vires que está habendo falta de comunicación entre os demais, e souberes que a podes subsanar mediante unha mensaxe clarificadora. Tamén adoita estar xeralmente ben enviar mensaxes para darlle as grazas a alguén por agradecer algo, ou dicir "Eu tamén", para que un lector diga que esas mensaxes non requiren ningunha resposta nin acción adicional, e polo tanto o esforzo mental demandado pola mensaxe remata limpamente cando o lector alcanzar a última liña do correo electrónico. Mais mesmo nestes casos, pénsao dúas veces antes de dicires algo; sempre é mellor deixar que a xente desexe que envíes máis mensaxes, que deixar que a xente desexa que envíes menos (bótalle unha ollada á segunda parte de <xref linkend="bikeshed-full"/> para veres máis ideas sobre como comportarse nunha lista de correo moi concorrida.

source: Productive vs Unproductive Threads
es: Hilos productivos vs Hilos Improductivos
gl: Fíos produtivos versus fíos improdutivos

source: On a busy mailing list, you have two imperatives. One, obviously, is to figure out what you need to pay attention to and what you can ignore. The other is to behave in a way that avoids <emphasis>causing</emphasis> noise: not only do you want your own posts to have a high signal/noise ratio, you also want them to be the sorts of messages that stimulate <emphasis>other</emphasis> people to either post with a similarly high signal/noise ratio, or not post at all.
es: En una lista de correo muy concurrida, tienes dos imperativos. Uno, obviamente es comprender en que es lo que necesitas poner tu atención y que es lo que puedes ignorar. El otro es evitar de alguna manera el <emphasis>causar</emphasis> ruido: no sólo quieres que tus propios posts tengan un ratio de gran ruido/señal, sino que tambien quieres que sean el tipo de mensajes que estimulan a <emphasis>otra</emphasis> gente a escribir mails con un ratio similar de señal/ruido, o no escribir nada.
gl: Nunha lista de correo moi concorrida, hai dous imperativos: Un, obviamente, é comprenderes a que tes que prestarlle atención e que podes ignorar. O outro é comportáreste dun xeito que evite a aparición de ruído: ti non queres que unicamente as túas mensaxes teñan unha boa relación sinal/ruído, senón que tamén queres que sexan do tipo de mensaxes que estimulan <emphasis>o resto da xente</emphasis> a enviar mensaxes cunha relación similar de sinal/ruído, ou a non escribir nada.

source: To see how to do that, let's consider the context in which it is done. What are some of the hallmarks of an unproductive thread?
es: Para ver como hacer eso, vamos a considerar el contexto en el cual se hace. ¿Cuales son algunos de los sellos de un hilo improductivo?
gl: Para ver como facer isto, imos considerar o contexto no que se fai. Cales son algúns dos sinais que identifican un fío improdutivo?

source: Arguments that have been made already start being repeated, as though the poster thinks no one heard them the first time.
es: Argumentos que ya se han hecho antes se empiezan a repetir, porque el que los hace piensa que nadie le ha escuchado la primera vez.
gl: Empézanse a repetir argumentos xa empregados con anterioridade, debido a que o que os emprega pensa que ninguén os escoitou a primeira vez.

source: Increasing levels of hyperbole and involvement as the stakes get smaller and smaller.
es: Se incrementan los níveles de exageración y participación mientras el interés se hace cada vez más pequeño.
gl: A medida que as ideas se fan máis e máis pequenas, aumenta o nivel de esaxeración e participación.
