Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: A majority of comments coming from people who do little or nothing, while the people who tend to get things done are silent.
es: Una mayoría de comentarios que provienen de gente que hablan poco o nada, mientras que la gente que tiene a hacer las cosas permanece en silencio.
gl: A maior parte dos comentarios proveñen de xente que fai un traballo pequeno, ou mesmo que non fai ningún traballo, mentres que a xente que tende a facer as cousas fica calada.

source: Many ideas discussed without clear proposals ever being made. (Of course, any interesting idea starts out as an imprecise vision; the important question is what direction it goes from there. Does the thread seem to be turning the vision into something more concrete, or is it spinning off into sub-visions, side-visions, and ontological disputes?)
es: Muchas ideas se discuten sin un propósito claro de que hacer con ellas. Por supuesto, cualquier idea interesante empieza con una visión imprecisa; la cuestión importante es que dirección tomará a partir de ahí. Parece que el hilo empieza a convertir la visión en algo más concreto, o está derivando en sub-visiones y disputas ontológicas?)
gl: Discútense ideas que non teñen un propósito claro. (Por suposto, calquera idea interesante comeza counha visión imprecisa; a cuestión importante está na dirección que colle a partir dese inicio. Parece que o fío comeza a converterse en algo máis concreto, ou pola contra está divagando con sub-visións, visións laterais ou disputas ontolóxicas?

source: Just because a thread is not productive at first doesn't mean it's a waste of time. It might be about an important topic, in which case the fact that it's not making any headway is all the more troublesome.
es: Sólo porque un hilo de correo no sea productivo al principio no significa que sea una perdida de tiempo. Puede tratar sobre un tema importante, en cuyo caso el hecho de que no se está produciendo ningún progreseo es todo lo más molesto.
gl: Só porque un fío pareza non produtivo nos seus primeiro pasos non quere dicir que sexa unha perda de tempo. De feito, pode tratar sobre un tema importante, en cuxo caso o feito de non producir ningún avance sería o máis molesto.

source: Guiding a thread toward usefulness without being pushy is an art. It won't work to simply admonish people to stop wasting their time, or to ask them not to post unless they have something constructive to say. You may, of course, think these things privately, but if you say them out loud then you will be offensive. Instead, you have to suggest conditions for further progress&mdash;give people a route, a path to follow that leads to the results you want, yet without sounding like you're dictating conduct. The distinction is largely one of tone. For example, this is bad:
es: Guiar un hilo de correo hacia la utilidad sin ser agresivo es todo un arte. No funcionará simplemente amonestando a la gente para que pare de gastar su tiempo, o preguntándoles que no escriban a menos que tengan algo constructivo que decir. Por supuesto puedes pensar en esas cosas en privado, pero si lo dices en la lista de correo sonará ofensivo. En lugar de eso, tienes que sugerir condiciones para promover progresos; guía a la gente, un camino a seguir que lleve a los resultados que quieres, y todo ello sin que tu conducta parezca dictatoria. La distinción es en gran parte el tono. Por ejemplo, esto esta mal:
gl: Conducir un fío cara á utilidade sen ser agresivo é toda unha arte. Amoestar a xente para que deixe de perder o seu tempo non adoita ser suficiente nin funcionar, do mesmo xeito que tampouco o é contestarlle dicindo que non envíen mensaxes salvo que tiveren algo construtivo que aportar. Ti podes, só faltaría, pensar esas cousas en privado, mais se as expresares abertamente en voz alta entón vas ser ofensivo. En lugar disto, debes propoñer condicións para promoveres o progeso&mdash;dálle á xente unha ruta, un vieiro que seguir para alcanzar o resultado que queres, e todo isto sen que pareza que estás ditando a conduta a seguir. A distinción reflíctese en gran medida no ton. Por exemplo, isto non está ben:

source: <blockquote> <para><emphasis>This discussion is going nowhere. Can we please drop this topic until someone has a patch to implement one of these proposals? There's no reason to keep going around and around saying the same things. Code speaks louder than words, folks.</emphasis></para> </blockquote> <para>Whereas this is good:</para> <blockquote> <para><emphasis>Several proposals have been floated in this thread, but none have had all the details fleshed out, at least not enough for an up-or-down vote. Yet we're also not saying anything new now; we're just reiterating what has been said before. So the best thing at this point would probably be for further posts to contain either a complete specification for the proposed behavior, or a patch. Then at least we'd have a definite action to take (i.e., get consensus on the specification, or apply and test the patch).</emphasis></para> </blockquote>
es: <blockquote> <para><emphasis>Esta discusión no va a ningún lado. Por favor podemos dejar este tema hasta que alguien tenga un parche que implemente una de esas proposiciones? No hay razón para mantenernos en ello todo el rato diciendo las mismas cosas. El código hace más ruido que las palabras, chicos.</emphasis></para> </blockquote> <para>Donde esto esta bien:</para> <blockquote> <para><emphasis>Varias propuestas han estado flotando en este hilo, pero ninguno ha tenido todos los detalles completos, al menos no demasiados como para hacer una votación arriba-o-abajo. Y todavía no estamos diciendo nada nuevo; estamos simplemente reiterando lo que ya se ha dicho anteriormente. Así que lo mejor a partir de este punto será probablemente para posteriores correos contener tanto una especificación completa para la característica propuesta, o un parche. Entonces al menos tendríamos una acción definitiva que tomar (ejem, tener un consenso en la especificación, o aplicar el parche).</emphasis></para> </blockquote>
gl: <blockquote> <para><emphasis>Esta discusión non vai a ningures. Podemos, por favor, abandonar este tema ata que alguén teña un remendo que implemente unha desas propostas? Non hai razón para darlle máis voltas dicindo sempre o mesmo. O código fala máis alto que as palabras, rapaces.</emphasis></para> </blockquote> <para>Mentres que esta si que está ben:</para> <blockquote> <para><emphasis>Neste fío estiveron convivindo varias propostas, mais ningunha delas suficientemente detallada, ou cando menos sen os detalles suficientes para facer unha votación. E a maiores tampouco estamos dicindo nada novo; simplemente estamos reiterando o xa dito con anterioridade. Así que o mellor, a partir deste punto, probablemente sexa que os correos subseguintes conteñan ou ben unha especificación completa para a proposta, ou ben un remendo. Deste xeito, cando menos contaríamos con unha acción definitiva que acometermos (por exemplo, obtermos consenso na especificación, ou aplicarmos o remendo).</emphasis></para> </blockquote>

source: Contrast the second approach with the first. The second way does not draw a line between you and the others, or accuse them of taking the discussion into a spiral. It talks about "we", which is important whether or not you actually participated in the thread before now, because it reminds everyone that even those who have been silent thus far still have a stake in the thread's outcome. It describes why the thread is going nowhere, but does so without pejoratives or judgements&mdash;it just dispassionately states some facts. Most importantly, it offers a positive course of action, so that instead of people feeling like discussion is being closed off (a restriction against which they can only be tempted to rebel), they will feel as if they're being offered a way to take the conversation to a more constructive level. This is a standard people will naturally want to meet.
es: Compara la segunda propuesta con la primera. La segunda manera no traza una línea entre tú y los demás, ni les acusa de mantener la discusión en una espiral. Habla sobre "nosotros", que es lo importante hayas participado o no en el hilo de correo anteriormente, porque recuerada a todo el mundo que incluso aquellos que han estado en silencio hasta entonces en el hilo de correo todavía pueden participar en el resultado del hilo de correo. Describe porque el hilo no va a ninguna parte, pero lo hace sin peyorativas ni juicios; simplemente muestra el estado de algunos hechos sin sentimiento. Lo más importante, ofrece un curso de acción positivo, de manera que en vez de que la gente sienta que la discusión esta siendo cerrada (una restricción contra la cual ellos pueden sólo estar tentados a rebelar), se sentirán como si se les estuviera ofreciendo una manera de tomar parte en la conversación a un nivel más constructivo. Este es un estándar con el cual la gente querrá quedarse.
gl: Compara a segunda aproximación coa primeira. A segunda proposta non debuxa unha liña entre ti e os demais, nin os acusa de levar a discusión a unha espiral sen fin. Fala sobre "nós", o cal é importante tanto se realmente participaches na discusión antes como se non o fixeches, dado que lle lembra a todo o mundo que mesmo aqueles que gardaron silencio tamén poden contribuír co seu gran de area ao fío. Ademais, describe o motivo polo que o fío está encamiñado cara ningures, pero faino dun xeito non pexorativo, nin xulgando a ninguén&mdash;simplemente, e sen paixón, presenta algúns feitos. E, máis importante aínda, ofrece un rumbo de acción positivo, polo que permite que en lugar de que a xente sinta que a discusión se está pechando (unha restrición atractiva contra a que rebelarse), sinta que a discusión se está levando a un nivel máis construtivo. Este é un estándar coa que a xente vai querer quedar.

source: You won't always want a thread to make it to the next level of constructiveness&mdash;sometimes you'll want it to just go away. The purpose of your post, then, is to make it do one or the other. If you can tell from the way the thread has gone so far that no one is actually <emphasis>going</emphasis> to take the steps you suggested, then your post effectively shuts down the thread without seeming to do so. Of course, there isn't any foolproof way to shut down a thread, and even if there were, you wouldn't want to use it. But asking participants to either make visible progress or stop posting is perfectly defensible, if done diplomatically. Be wary of quashing threads prematurely, however. Some amount of speculative chatter can be productive, depending on the topic, and asking for it to be resolved too quickly will stifle the creative process, as well as make you look impatient.
es: Siempre no querrás convertir un hilo de correo en el siguiente nivel de construcción; otras veces querrás dejarlo pasar. El propósito de tu correo, entonces, es hacer una cosa o la otra. Si puedes decir el camino que deberá tomar el hilo de correo de manera que nadie lo está haciendo <emphasis>así</emphasis> para tomar los pasos que sugeriste, entonces tu correo ha cerrado el hilo sin aparentar hacerlo. Por supuesto, no hay una manera infalibe de cerrar un hilo, e incluso si la hubiera, no querrías usarla. Pero preguntando a los participantes a crear progresos visibles o parar de escrbiri correos es perfectamente defendible, si se hace diplomáticamente. Sin embargo, se cauteloso de anular los hilos de correo prematuramente. Alguna cantidad de charla especulativa puede llegar a ser productiva, dependiendo del tema, y preguntando para que se resuelva demasiado rápida apagará el proceso creativo, así como tambien te hara parecer impaciente.
gl: Non sempre vas queres elevar un fío ao seguinte nivel de construtividade&mdash;algunhas veces vas queres liquidalo. Neste caso, o propósito da túa mensaxe debe ser ou ben facer unha cousa ou ben facer a outra. Se podes amosar o camiño polo que andou o fío de xeito que ninguén realmente vaia poder seguir os pasos que propós para reconducilo, entón a túa mensaxe vai (efectivamente) pechar o fío sen que pareza facelo. Por suposto, non hai ningún xeito infalible de pechar un fío, e aínda que o houbese, seguramente non quererías empregalo. Aínda así, responderlle aos participantes dicíndolles que ou ben fagan progresos visibles ou ben deixen de enviar mensaxes, pode ser unha acción perfectamente defendible, de facerse diplomaticamente. A pesar disto debes ser cauteloso, e non liquidar fíos prematuramente. Algunhas charlas especulativas poden ser produtivas, dependo do tema, e pedir que se resolvan con demasiada prontitude poder afogar o proceso creativo, para alén de facerte ver como un impaciente.

source: Don't expect any thread to stop on a dime. There will probably still be a few posts after yours, either because mails got crossed in the pipe, or because people want to have the last word. This is nothing to worry about, and you don't need to post again. Just let the thread peter out, or not peter out, as the case may be. You can't have complete control; on the other hand, you can expect to have a statistically significant effect across many threads.
es: Don't expect any thread to stop on a dime. Probablemente habrá todavía unos pocos correos despues del tuyo, ya sea porque los mails se cruzan en la red, o porque la gente quiere tener la última palabra. Esto no es nada por lo que preocuparse, y no necesitas escribir otro correo otra vez. Simplemente deja que el hilo se vaya esfumando o que no se esfume como puede ser el caso. No puedes tener control completo; por otra parte, puedes esperar tener estadísticamente un efecto significativo a través de varios hilos de correo.
gl: Non esperes que ningún fío remate en seco. Probablemente aínda haxa algunhas mensaxes posteriores á túa, tanto porque os correos se cruzaran na rede, como porque haxa xente que queira ter a última palabra. Tan só debes deixar que o fío se esfume, ou non, segundo for o caso. Non podes ter un control completo, mais por outra banda si que podes esperar ter un efecto estatisticamente significativo a través dos varios fíos.

source: The Softer the Topic, the Longer the Debate
es: Cuanto más blando sea el tema, más largo será el debate
gl: Canto máis suave for o tema, máis longo vai ser o debate

source: Although discussion can meander in any topic, the probability of meandering goes up as the technical difficulty of the topic goes down. After all, the greater the technical difficulty, the fewer participants can really follow what's going on. Those who can are likely to be the most experienced developers, who have already taken part in such discussions thousands of times before, and know what sort of behavior is likely to lead to a consensus everyone can live with.
es: Aunque las discusiones pueden extenderse a cualquier topico, la probabilidad de que se vayan extendiendo va conforme la dificultad tecnica del tema disminuye. Despues de todo cuanta mas sea la dificultad tecnica, menor sera el numero de participantes que realmente podran seguirla. Aquellos quienes pueden ser los desarrolladores mas experimentados, quienes ya han tomado parte en esas discusiones antes cientos de veces, y conocen el tipo de comportamiento es el que va a llevar a un consenso con el cual todo el mundo este de acuerdo.
gl: Aínda que as discusións poden serpear entremedias de calquera tema, a probabilidade de que xurdan aumenta a medida que a dificultade técnica no tema descende. Despois de todo, cando maior for a dificultade técnica, menos participantes poden realmente seguir o que está a pasar. Aqueles que adoitan poder seguilas son os desenvolvedores máis experimentados, os mesmos que xa tomaron parte centos de veces nesas mesmas discusións, e coñecen os tipos de comportamento que levan a un consenso co que poida vivir todo o mundo.

source: Thus, consensus is hardest to achieve in technical questions that are simple to understand and easy to have an opinion about, and in "soft" topics such as organization, publicity, funding, etc. People can participate in those arguments forever, because there are no qualifications necessary for doing so, no clear ways to decide (even afterward) if a decision was right or wrong, and because simply outwaiting other discussants is sometimes a successful tactic.
es: De esta manera, en cuestiones tecnicas que son simples de comprender y faciles de tener una opinion sobre ellas, es dificil llegar a un consenso, y en temas "blandos" como organizacion, publicidad, ingresos, etc. La gente puede participar en aquellos argumentos siempre, porque no es necesario ninguna cualificacion para hacerlo, no hay un camino claro para decidir (incluso despues de todo) si una decision fue buena o mala, y porque simplemente esperar a que otros discutan es a veces una tactica correcta.
gl: Deste xeito, o consenso é máis difícil de alcanzar en cuestións técnicas sinxelas de entender e sobre as que é sinxelo ter unha opinión propia, así como en temas máis "suaves" como son a organización, a publicidade, o financiamento, etc. A xente pode participar nestas argumentacións para sempre, dado que non e preciso contar con unha cualificación determinada para poder facelo, non existen vieiros claros para decidir (mesmo a posteriori) se unha postura era correcta ou incorrecta, e simplemente porque discutir ás veces é unha táctica de éxito.

source: The principle that the amount of discussion is inversely proportional to the complexity of the topic has been around for a long time, and is known informally as the <firstterm>Bikeshed Effect</firstterm>. Here is Poul-Henning Kamp's explanation of it, from a now-famous post made to BSD developers:
es: El principio de que la cantidad de discusion es inversamente proporcional a la complejidad del tema tratado, ha estado ahi durante algun tiempo, y es conocido informalmente como el <firstterm>Efecto Bikeshed </firstterm>. Aqui esta la explicacion de Poul-Henning Kamp's, de un correo ahora famoso, hecho en la lista de desarrolladores de BSD:
gl: O principio de que a morea de discusión é inversamente proporcional á complexidade do tema ten estado dando voltas por aí desde hai moito tempo, e coñécese informalmente como o <firstterm>efecto garaxe da bicicleta</firstterm>. Aquí está a explicación do mesmo, aportada por Poul-Henning Kamp, proveniente dunha mensaxe famosa enviada aos desenvolvedores de BSD:

source: It's a long story, or rather it's an old story, but it is quite short actually. C. Northcote Parkinson wrote a book in the early 1960'ies, called "Parkinson's Law", which contains a lot of insight into the dynamics of management.
es: Es una larga historia o mas bien es una vieja historia, pero es bastante escasa actualmente. C. Northcote Parkinson escribio un libro en los comienzoa de 1960 titulado "La ley de Parkinson", la cual contenia mucho entendimiento sobre la dinamica de la gestion.
gl: É unha longa historia, ou máis ben unha vella historia, mais bastante curta na actualidade. C. Northcote Parkinson escribiu un libro nos comezos de 1960 titulado "A lei de Parkinson", o cal contiña moitos coñecementos sobre a dinámica da xestión.

source: In the specific example involving the bike shed, the other vital component is an atomic power-plant, I guess that illustrates the age of the book.
es: En el ejemplo especifico cubriendo el refugio de bicicletas, el otro componente vital es una planta de energia atomica, supongo que ilustra la epoca de el libro. .
gl: No exemplo específico sobre o garaxe da bicicleta, a outra compoñente vital é unha central de enerxía atómica, supoño que para ilustrar a época do libro.

source: Parkinson shows how you can go in to the board of directors and get approval for building a multi-million or even billion dollar atomic power plant, but if you want to build a bike shed you will be tangled up in endless discussions.
es: Parkinson nos muestra que puedes ir a un consejo de direccion y conseguir la aprobacion de un edificio multi millonario o incluso de billones de dolares de una planta de energia atomica, pero si quieres construir un refugio de bicicletas te veras implicado en discusiones sin fin.
gl: Parkinson amosa como podes acudir ao consello de dirección e conseguir a aprobación para construíres unha central de enerxía atómica por millóns, ou mesmo miles de millóns, mais tamén como se queres construír un garaxe para unha bicicleta posiblemente te vexas envolto en discusións sen fin.

source: Parkinson explains that this is because an atomic plant is so vast, so expensive and so complicated that people cannot grasp it, and rather than try, they fall back on the assumption that somebody else checked all the details before it got this far. Richard P. Feynmann gives a couple of interesting, and very much to the point, examples relating to Los Alamos in his books.
es: Parkinson explica que esto es porque una planta de energia atomica es tan enorme, tan cara y tan complicada que la gente no tendra conocimiento de ello, y en lugar de intentarlo, recurriran al supuesto de que alguien revisara todos los detalles antes de ir mas alla. Richard P. Feynmann dio un par de interesantes, y muy cercanos a esto ejemplos en relacion a los Alamos en sus libros.
gl: Parkinson explica que isto se debe a que unha central de enerxía atómica é algo tan enorme, tan caro e tan complexo que a xente non ten coñecementos sobre a mesma, e en lugar de obtelos, van aferrarse á asunción de que algún terceiro revisará os detalles, antes de ir máis alá. Richard P. Feynmann dá no seu libro un par de exemplos moi interesantes e próximos a este tema, relacionados con Los Alamos.

source: A bike shed on the other hand. Anyone can build one of those over a weekend, and still have time to watch the game on TV. So no matter how well prepared, no matter how reasonable you are with your proposal, somebody will seize the chance to show that he is doing his job, that he is paying attention, that he is <emphasis>here</emphasis>.
es: Por otra parte, un refugio para bicletas. Cualquiera puede construir uno de esos en un fin de semana, y todavia tendra tiempo para ver la TV. Asi que no importa lo bien preparado que estes, tampoco importa lo razonable que seas en tu proposicion, alguien se hara con la oportunidad para demostrar que esta haciendo su trabajo, que esta atento, que esta <emphasis>ahi</emphasis>.
gl: Pola contra, calquera pode construír un garaxe de bicicletas durante un fin de semana, e contar con tempo suficiente para ver a carreira de Fórmula 1 na televisión. Debido a isto non importa nin o ben preparado que estiveres, nin como de razoable for a túa proposta, dado que seguramente alguén vai aproveitar a oportunidade para amosar que está facendo o seu traballo, que está prestando atención, para demostrar (en definitiva) que está <emphasis>aí</emphasis>.

source: In Denmark we call it "setting your fingerprint". It is about personal pride and prestige, it is about being able to point somewhere and say "There! <emphasis>I</emphasis> did that." It is a strong trait in politicians, but present in most people given the chance. Just think about footsteps in wet cement.
es: En Dinamarca lo llamamos "deja tu huella". Trata sobre el orgullo personal y el prestigio, va sobre ser capaz de señalar en algun sitio y decir "Hay! esto lo hice <emphasis>Yo</emphasis>." Es fuerte, simplemente piensa en las pisadas del semento mojado.
gl: En Dinamarca chamámoslle "deixar a túa pegada". Trata sobre o orgullo persoal e mailo prestixio, trata sobre ser capaz de sinalar algún lugar e dicir "Aí! <emphasis>Eu</emphasis> fixen iso". É un trazo con gran presencia nos políticos, mais tamén presente na maioría da xente que ten a oportunidade de poñelo en práctica. Simplemente, pensa nas pegadas no cemento húmido.
