Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: With mailing lists, the "ad space" is a tiny footer appended to every message. Most projects put subscription/unsubscription instructions there, and perhaps a pointer to the project's home page or FAQ page as well. You might think that anyone subscribed to the list would know where to find those things, and they probably do&mdash;but many more people than just subscribers see those mailing list messages. An archived post may be linked to from many places; indeed, some posts become so widely known that they eventually have more readers off the list than on it.
es: El formateo puede crear una gran diferencia. Por ejemplo, en el proyecto, tuvimos un éxito limitado utilizando la técnica de filtrado de bugs descrita en <xref linkend="bug-filtering"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>. Muchos de los falsos bugs reportados estaban siendo todavía rellenados por gente sin experiencia, y ocurría cada vez, el informador tenía que ser educado de la misma manera que lo había sido con las 500 personas de antes. Un día, después de que a uno de nuestros desarrolladores finalmente se le agotara la paciencia y empezó a criticar y meterse con un pobre usuario por no haberse leído detenidamente la guía de uso del bug tracker, otro desarrollador decidió que este patrón había ido ya demasiado lejos. Sugirió que reformatearamos la página frontal del bug tracker de tal forma que lo más importante, los mandatos para discutir los bugs en la lista de correo o en los canales IRC antes de rellenarlos, serían letras muy grandes, en rojo resaltado sobre un fondo amarillo y resaltado claramente sobre todo los demás elementos de la página. Así lo hicimos (puedes ver los resultados en <ulink url="http://subversion.tigris.org/project_issues.html"></ulink>), y y el resultado fue un descenso notable en el ratio de falsos bugs relleandos. Por supuesto, todavía los tenemos, y siempre los tendremos, pero el ratio ha descendido considerablemente, incluso aunque el número de usuarios incrementa. El resultado no es solamente que la base de datos de bugs tiene menos basura, sino que aquellos que responden a los tickets de bugs lo hacen con buen carácter, y es más probable permanecer amistosamente cuando se responde a uno de los pocos bugs falsos. Esto mejora tanto la imagen del proyecto como la salud mental de sus voluntarios.
gl: Coas listas de correo, o "espazo publicitario" é un pequeno pé engadido a cada mensaxe. A maioría dos proxectos poñen as instrucións de subscrición e de-subscrición nese lugar, e ás veces unha indicación á páxina web do proxecto ou á páxina de FAQs. Poderías pensar que alguén subscrito á lista de correo sabería onde atopar estar cousas, e probablemente sexa así&mdash;mais moita máis xente que os propios subscritores conforma a audiencia destas mensaxes na lista de correo. Unha mensaxe arquivada pode enlazarse dende múltiples lugares; de feito, algunhas mensaxes poden volverse tan famosas que poden chegar a ter máis lectores fóra da lista que dentro da mesma.

source: Formatting can make a big difference. For example, in the Subversion project, we were having limited success using the bug-filtering technique described in <xref linkend="bug-filtering"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>. Many bogus bug reports were still being filed by inexperienced people, and each time it happened, the filer had to be educated in exactly the same way as the 500 people before him. One day, after one of our developers had finally gotten to the end of his rope and flamed some poor user who didn't read the issue tracker guidelines carefully enough, another developer decided this pattern had gone on long enough. He suggested that we reformat the issue tracker front page so that the most important part, the injunction to discuss the bug on the mailing lists or IRC channels before filing, would stand out in huge, bold red letters, on a bright yellow background, centered prominently above everything else on the page. We did so (you can see the results at <ulink url="http://subversion.tigris.org/project_issues.html"></ulink>), and the result was a noticeable drop in the rate of bogus issue filings. We still get them, of course&mdash;we always will&mdash;but the rate has slowed considerably, even as the number of users increases. The outcome is not only that the bug database contains less junk, but that those who respond to issue filings stay in a better mood, and are more likely to remain friendly when responding to one of the now-rare bogus filings. This improves both the project's image and the mental health of its volunteers.
es: La leccion para nosotros fue que únicamente escribiendo unas guías de uso no era demsiado. También tuvimos que colocarlas allá donde más se vieran por la gente que más las iba a necesitar, y formatearlas de tal manera que su estado y material introductorio estuviese inmediatamente claro para la gente que no estuviera familiarizada con el proyecto.
gl: O formatado pode supor unha gran diferenza. Por exemplo, no proxecto Subversion, tivemos un éxito limitado empregando a técnica de filtraxe de erros descrita en <xref linkend="bug-filtering"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>. Moitos dos falsos informes de erros seguían sendo preenchidos por xente sen experiencia, e cada vez que isto pasaba, o usuario tiña que ser educado exactamente do mesmo xeito que as 500 persoas anteriores. Un día, despois de que a un dos nosos desenvolvedores finalmente se lle esgotara a paciencia e empezase a criticar e a meterse cun pobre usuario por non ler detidamente a guía de uso do bug tracker, outro desenvolvedor decidiu que este padrón tíñase reproducido demasiadas veces. Suxeriu que reformatáramos a páxina de portada do bug tracker de xeito que o máis importante da mesma, a norma de discutir previamente os bugs na lista de correo ou nos canais IRC antes de envialos polo bug tracker, estivese formatado en letras moi grandes, en vermello resaltado sobre un fondo amarelo e resaltado claramente sobre todos os demais elementos da páxina. Así se fixo (podes ver os resultados en <ulink url="http://subversion.tigris.org/project_issues.html"></ulink>), e o resultado foi un descenso notable no número de falsos informes notificados. Por suposto, aínda os temos hoxe en día, e sempre os teremos, mais o número descendeu notablemente, embora o número de usuarios se vise incrementado. O resultado non se restrinxe unicamente a que a base de datos de bugs teña menos lixo, senón que aqueles desenvolvedores que responden aos tickets de informes de erros fano con bo humor, e aumentou a probabilidade de manteren o bo humor, dado que teñen que lidar con poucos erros falsos. Isto mellora tanto a imaxe do proxecto como a saúde mental dos seus voluntarios.

source: The lesson for us was that merely writing up the guidelines was not enough. We also had to put them where they'd be seen by those who need them most, and format them in such a way that their status as introductory material would be immediately clear to people unfamiliar with the project.
es: Las páginas web estáticas no son el único lugar para publicar las características del proyecto. Una cierta cantidad de políticas interactivas (en el sentido de recordatorio-amigable , no en el sentido de enjaular y atar) también son requeridas. Todas las revisiones por pares, incluso las revisiones de commits descritas en <xref linkend="code-review"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>, deberían incluir revisiones de conformidad o no-conformidad con las normas del proyecto, especialmente en relación a las convenciones de las comunicaciones.
gl: A lección que nós tiramos foi que simplemente con escribir as normas non fas abondo. Tamén tivemos que poñelas onde fosen vistas por aqueles que máis as necesitan, e formatalas de tal xeito que o seus status de material introdutorio fose inmediatamente claro para a xente que non estaba familiarizada co proxecto.

source: Static web pages are not the only venue for advertising the project's customs. A certain amount of interactive policing (in the friendly-reminder sense, not the handcuffs-and-jail sense) is also required. All peer review, even the commit reviews described in <xref linkend="code-review"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>, should include review of people's conformance or non-conformance with project norms, especially with regard to communications conventions.
es: Otro ejemplo del proyecto Subversion: fijamos una convención de "r12908" qué significaba "revision 12908 en el repositorio de control de versiones". El prefijo "r" es facil de escribir, y porque es la mitad de peso que los dígitos, lo hace un bloque de texto fácilmente reconocible combinado con digitos. Por supuesto, fijándolo así en la convención no significaba que todo el mundo lo empezara a usar consistentemente de la manera correcta. Hasta ahora, cuando un mail de commit viene con un log como este:
gl: As páxinas web estáticas non son o único lugar para publicitar os costumes do proxecto. Unha certa cantidade de políticas interactivas (no sentido de recordatorio amable, non no sentido de ataduras e sensación de encarceramento) tamén son precisas. Toda revisión entre iguais, mesmo as revisións de commits descritas en <xref linkend="code-review"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>, deberían incluír revisións sobre a conformidade ou non conformidade da xente coas normas do proxecto, especialmente en relación coas convencións relativas ás comunicacións.

source: Another example from the Subversion project: we settled on a convention of "r12908" to mean "revision 12908 in the version control repository." The lower-case "r" prefix is easy to type, and because it's half the height of the digits, it makes an easily-recognizable block of text when combined with the digits. Of course, settling on the convention doesn't mean that everyone will begin using it consistently right away. Thus, when a commit mail comes in with a log message like this:
gl: Outro exemplo extraido do proxecto Subversion: establecemos nunha convención que "r12908" significaría "revisión 12908 no repositorio de control de versións". O prefixo en minúsculas "r" é sinxelo de escribir, e dado que ten a metade de altura que os díxitos, convérteo nun bloque de texto facilmente recoñecible ao combinalo con díxitos. Por suposto, establecelo deste xeito na convención non quixo dicir que todo o mundo comezara a empregalo con coherencia do xeito correcto. Así, cando un correo de commit ven cun log coma este:

source: ------------------------------------------------------------------------ r12908 | qsimon | 2005-02-02 14:15:06 -0600 (Wed, 02 Feb 2005) | 4 lines Patch from J. Random Contributor &lt;jrcontrib@gmail.com&gt; * trunk/contrib/client-side/psvn/psvn.el: Fixed some typos from revision 12828. ------------------------------------------------------------------------
es: ...parte de la revisión de este comit es decir "A partir de ahora, por favor usa 'r12828', en vez de 'revision 12828' cuando te refieras a cambios del pasado." Esto no es pedante; es importante tanto para el parseo automático como para los lectores humanos.
gl: ------------------------------------------------------------------------ r12908 | dhume | 2010-05-24 08:05:06 -0600 (Mon, 24 May 2010) | 4 lines Patch from James Ford (Sawyer) &lt;sawyer@ghandalf-loves-lost.org&gt; * trunk/contrib/client-side/psvn/psvn.el: Fixed some typos from revision 12828. ------------------------------------------------------------------------

source: ...part of reviewing that commit is to say "By the way, please use 'r12828', not 'revision 12828' when referring to past changes." This isn't just pedantry; it's important as much for automatic parsability as for human readership.
es: Siguiendo los principios generales, de seguir métodos canonicos de referencia, y que estos métodos de referencia debieran ser usados consistentemente en todos los sitios, el proyecto en efecto exporta ciertos estándares. Estos estándares hacen que la gente escriba herramientas que presenten las comunicaciones del proyecto de una manera más útil; por ejemplo, una revisión formateada como "r12828" podría transformarse en un enlace vivo dentro del sistema de navegación del repositorio. Esto sería muy difícil de realizar si la revisión se hubiera escrito como "revision 12828", tanto porque la forma podría dividirse a través de un salto de línea, y porque es menos distintiva (la palabra "revision", a menudo aparecerá sola, y los grupos de números también apareceran solos, allí donde la combinación "r12828" puede significar únicamente un número de revisión). Asuntos similares se aplican tambien a temas con números, FAQs (truco: utiliza una URL con un named anchor, como se describe en <xref linkend="html-named-anchors-and-ids"/>), etc.
gl: ...parte da revisión deste commit consiste en dicir "A partir de agora, por favor emprega 'r12828', en lugar de 'revisión 12828' cando te referires a mudanzas feitas no pasado." Isto non é pedantería; é importante tanto para o parseo automático como para os lectores humanos.

source: By following the general principle that there should be canonical referral methods for common entities, and that these referral methods should be used consistently everywhere, the project in effect exports certain standards. Those standards enable people to write tools that present the project's communications in more useable ways&mdash;for example, a revision formatted as "r12828" could be transformed into a live link into the repository browsing system. This would be harder to do if the revision were written as "revision 12828", both because that form could be divided across a line break, and because it's less distinct (the word "revision" will often appear alone, and groups of numbers will often appear alone, whereas the combination "r12828" can only mean a revision number). Similar concerns apply to issue numbers, FAQ items (hint: use a URL with a named anchor, as described in <xref linkend="html-named-anchors-and-ids"/>), etc.
es: Incluso para las entidades en las cuales no hay una manera obvia, la forma canónica, se debería recomendar a la gente el proporcionar piezas clave de información consistente. Por ejemplo, en lo que se refiere a un mensaje de lista de correo, no facilites simplemente el destinatario y el asunto; facilita tambien la URL del archivo <emphasis>y</emphasis> la cabecera Message-ID. Esto último permitirá a la gente que tenga su propia copia de la lista de correo (la gente a veces copias offline, por ejemplo para utilizarlas en el portátil mientras viajan) indentificar de manera inequivoca el mensaje correcto incluso aunque no tengan acceso a los archivos. El destinatario y asunto tampoco serían demasiado, porque la misma persona podría crear diversos posts en el mismo hilo, incluso en el mismo día.
gl: Seguindo o principio xeral de que debe haber métodos canónicos de referencia para entidades comúns, e que estes métodos de referencia deben empregarse con coherencia en todos os sitios, o proxecto en efecto exporta certos estándares. Estes estándares permiten que a xente escriba ferramentas que presenten as comunicacións do proxecto dun xeito máis útil&mdash;por exemplo, unha revisión formatada como "r12828" podería transformarse nunha ligazón viva dentro do sistema de navegación do repositorio. Isto sería moi difícil de facer se a revisión fose escrita como "revisión 12828", tanto porque esta segunda forma podería dividirse a través dun salto de liña, como porque é menos distintiva (a palabra "revisión", a miúdo aparecerá soa, e os grupos de números tamén aparecen sós, mentres que a combinación "r12828" é unívoca, tendo como significado un número de revisión). Consideracións similares valen tamén para temas con números, FAQs (truco: emprega unha URL cunha áncora con nome, como se describe en <xref linkend="html-named-anchors-and-ids"/>), etc.

source: Even for entities where there is not an obvious short, canonical form, people should still be encouraged to provide key pieces of information consistently. For example, when referring to a mailing list message, don't just give the sender and subject; also give the archive URL <emphasis>and</emphasis> the Message-ID header. The last allows people who have their own copy of the mailing list (people sometimes keep offline copies, for example to use on a laptop while traveling) to unambiguously identify the right message even if they don't have access to the archives. The sender and subject wouldn't be enough, because the same person might make several posts in the same thread, even on the same day.
es: Cuanto más crece un proyecto, más importante es este tipo de consistencia. Consitencia signfica que allá donde todo el mundo mire, verán que se siguen los mismos patrones, así que ellos tambíen sabran seguir por ellos mismos los patrones. Esto también reduce el número de cuestiones que necesitarán preguntar. La carga de tener un millon de lectores no es más grande que el tener sólo uno; los problemas de escalabilidad empiezan a surgir solo cuando un cierto porcentage de estos lectores hacen preguntas. Conforme el proyecto crece, por tanto, se debe reducir aquel porcentage incrementando la densidad y accesibilidad de la información, de tal manera que una persona dada pueda encontrar la información que necesite sin necesidad de preguntar.
gl: Mesmo para entidades nas que non existe un modelo obvio de forma canónica, a xente debería estar igualmente disposta a fornecer pezas clave de información dun xeito coherente. Por exemplo, cando te referires a unha mensaxe nunha lista de correo, non fornezas unicamente a identidade da persoa que enviou o correo e mailo asunto do mesmo; achega tamén a URL do arquivo <emphasis>e</emphasis> o cabezallo co message-ID. Isto último permite que a xente que teña a súa propia copia das listas de correo (hai xente que ás veces mantén copias offline, por exemplo para empregalas nun portátil mentres viaxa) poida identificar univocamente a mensaxe correcta embora non teñan acceso aos arquivos. O remitente e mailo asunto non serían suficientes, dado que a mesma persoa pode enviar varias mensaxes no mesmo fío, mesmo no mesmo día.

source: The more a project grows, the more important this sort of consistency becomes. Consistency means that everywhere people look, they see the same patterns being followed, so they know to follow those patterns themselves. This, in turn, reduces the number of questions they need to ask. The burden of having a million readers is no greater than that of having one; scalability problems start to arise only when a certain percentage of those readers ask questions. As a project grows, therefore, it must reduce that percentage by increasing the density and accessibility of information, so that any given person is more likely to find what he needs without having to ask.
es: Sin conversaciones en el bug tracker
gl: Canto máis medra un proxecto, máis importante se torna este tipo de coherencia. Coherencia quere dicir que todas as persoas observan os mesmos padróns e que estes son seguidos, o cal obriga a cada persoa individual a seguilos. Isto, ademais, reduce o número de cuestións que precisan ser preguntadas. A carga de ter un millón de lectores non é a mesma que a de ter un; os problemas de escalabilidade comezan a xurdir unicamente cando un determinado porcentaxe deses lectores fai preguntas. A medida que un proxecto medra, por tanto, debe reducir estas porcentaxes mediante o incremento da densidade e da accesibilidade da información, de tal xeito que a xente sexa máis propensa a atopar o que precisa sen ter a necesidade de preguntalo.

source: No Conversations in the Bug Tracker
es: En cualquier proyecto que haga un uso activo del Bug Tracker (sistema de seguimiento de errores), siempre existe peligro de que este sistema se convierta en un foro de discusión en sí mismo, incluso aunque las listas de correo sean mejor para ello. Normalmente empieza de una manera demasiado inocente, alguien anota un tema con, digamos, una propuesta de solución, o un parche parcial. Otro ve esto, y se da cuenta de que existen problemas en esa solución, y añade otro punto anotando los problemas. La primera persona entonces responde otra vez añadiéndolo al tema, y así sucesivamente...
gl: Prohibidas as conversas no bug tracker

source: In any project that's making active use of its bug tracker, there is always a danger of the tracker turning into a discussion forum itself, even though the mailing lists would really be better. Usually it starts off innocently enough: someone annotates an issue with, say, a proposed solution, or a partial patch. Someone else sees this, realizes there are problems with the solution, and attaches another annotation pointing out the problems. The first person responds, again by appending to the issue...and so it goes.
es: El problema con esto es, primero que el bug tracker es un lugar bastante pesado para tener una discusión, y segundo, que otras personas pueden no estar prestando atención, después de todo, se espera que la discusión sobre desarrollo ocurra en la lista de correo de desarrollo, por lo que será ahí donde buscarán. Puede que la gente no esté subscrita a la lista de cambios de tickets despues de todo, y aunque lo estén, puede que no la sigan muy de cerca.
gl: En calquera proxecto que faga un uso activo do bug tracker (lembremos que é o sistema de notificación de informes de erros), sempre existe o risco de que o mesmo acabe tornándose nun foro de discusión en si mesmo, embora as listas de correo sexan un lugar mellor para facelo. Usualmente comeza dun xeito suficientemente inocente: alguén anota un informe de erro con, di el, unha proposta de solución, ou un remendo parcial. Outra persoa o ve, observa que hai problemas coa solución, e inclúe outra anotación mostrndo os problemas. A primeira persoa responde unha vez máis,... e así sucesivamente.

source: The problem with this is, first, that the bug tracker is a pretty cumbersome place to have a discussion, and second, that other people may not be paying attention&mdash;after all, they expect development discussion to happen on the development mailing list, so that's where they look for it. They may not be subscribed to the issue changes list at all, and even if they are, they may not follow it very closely.
es: Pero exactamente, ¿en que parte del proceso se cometió el error? ¿Fue cuando la persona original envío su solución al tema?, ¿debería haberla enviado a la lista de correo mejor? ¿O quizá fue cuando la segunda persona respondió al tema, en vez de a la lista?
gl: O problema con esta operativa reside, primeiramente, en que o bug tracker é un lugar demasiado pesado e torpe para manter unha discusión, e en segundo lugar en que outra xente probablemente non estea prestando atención&mdash;despois de todo, esperan que as discusións de desenvolvemento se leven a cabo na lista de correo de desenvolvemento, polo que ese é o lugar ao que están mirando. Probablemente non estean subscritos á lista de notificacións, e mesmo se o estiveren, pode que non a sigan con demasiada atención.
