Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: In general, if you're unsure how to treat a security problem, find someone with experience and talk to them about it. Assessing and handling vulnerabilities is very much an acquired skill, and it's easy to make missteps the first few times.
gl: En xeral, se non estiveres seguro de como tratar un problema de seguridade, atopa a alguén con experiencia e cóntallo. Avaliar e xestionar vulnerabilidades é unha destreza que se vai adquirindo, e adoita ser habitual cometer erros as primeiras veces.
