Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: Making sure there are many automated sources of information available, and that they are kept organized, up-to-date, and easy to find.
es: La estrategia (1) normalmente no es muy dura. La mayoría de los proyectos empiezan con un foro principal: y una lista de correo para discusiones generales, en las cuales las ideas de características, cuestiones de diseño y problemas de codificación puedan ser discutidos. Todo el mundo involucrado en el proyecto está en la lista. Despues de un tiempo, se comprueba que la lista ha evolucionado en varias sublistas basadas en diferentes temáticas. Por ejemplo, algunos hilos son claramente sobre desarrollo y diseño; otros son dudad de usuarios del tipo ¿"Cómo hago tal cosa"?; quizá exista una tercera temática centrada en el registro de procesar los informes de bugs y peticiones de mejora; y así. Un individuo dado, por supuesto puede participar en varios tipos diferentes de hilos, pero lo más importante de todo es que no hay mucho solapamiento entre los diferentes tipos mismos. Pueden ser divididos en listas separadas sin causar ningún perjuicio en el proyecto, porque los hilos se mantienen repartidos por temáticas.
gl: Asegurar que están accesibles varias fontes automatizadas de información, e que as mesmas están organizadas, actualizadas e facilmente accesibles.

source: Strategy (1) is usually not too hard. Most projects start out with one main forum: a general discussion mailing list, on which feature ideas, design questions, and coding problems can all be hashed out. Everyone involved with the project is on the list. After a while, it usually becomes clear that the list has evolved into several distinct topic-based sublists. For example, some threads are clearly about development and design; others are user questions of the "How do I do X?" variety; maybe there's a third topic family centered around processing bug reports and enhancement requests; and so on. A given individual, of course, might participate in many different thread types, but the important thing is that there is not a lot of overlap between the types themselves. They could be divided into separate lists without causing any harmful balkanization, because the threads rarely cross topic boundaries.
es: Actualmente, realizar esta división es un proceso de dos pasos. Creas la nueva lista (o el canal IRC, o lo que vaya a ser), y entonces gastas el tiempo necesario de manera educada pero insistiendo y recordando a la gente a <emphasis>usar</emphasis> los nuevos foros apropiadamente. Este paso puede llevar semanas pero finalmente la gente captará la idea. Simplemente tienes que hacer ver a alguien que envía un post al destino equivocado, cual es el nuevo camino y hacerlo de manera visible, animando a que otras personas ayuden tambien en los nuevos usuos. Es tambien muy útil tener una página web proporcionando una guía hacía todas las listas disponibles; tus respuestas simplemente pueden referenciar esta página y, como gratificación, el destinatario puede aprender sobre las pautas a seguir antes de escribir un correo.
gl: A estratexia (1) non adoita ser demasiado dura. Moitos proxectos arrincan cun foro principal: unha lista de correo xeral de discusión, na cal tanto funcionalidades, como ideas, cuestións de desenvolvemento, problemas de implementación, etc poden ser todos eles discutidos. Todo o mundo que participa no proxecto está na lista. Despois dun tempo, adoita amosarse con claridade que a lista precisa evoluír en varias sublistas, relacionadas cada unha delas cun tópico específico. Por exemplo, algúns fíos teñen a ver claramente co desenvolvemento e co deseño; outros son de preguntas de usuarios do estilo "Como fago X?"; ás veces tamén existe unha terceira familia típica de fíos centrada no procesamento de notificacións de erros e peticións de melloras; e así. Un individuo concreto, como non pode ser doutro xeito, pode participar en fíos de moi diferente natureza, mais a importancia atópase en que non adoita haber moito solapamento entre os distintos tipos. Debido ao anterior, pode facerse unha división en diferentes listas de correo sen iniciar perniciosos ataques de orcos, dado que os fíos en moi raras ocasións transgriden as fronteiras do tema no que se enmarcan.

source: Actually doing this division is a two-step process. You create the new list (or IRC channel, or whatever it is to be), and then you spend whatever time is necessary gently nagging and reminding people to <emphasis>use</emphasis> the new forums appropriately. That latter step can last for weeks, but eventually people will get the idea. You simply have to make a point of always telling the sender when a post is sent to the wrong destination, and do so visibly, so that other people are encouraged to help out with routing. It's also useful to have a web page providing a guide to all the lists available; your responses can simply reference that web page and, as a bonus, the recipient may learn something about looking for guidelines before posting.
es: La estrategia (2) es un proceso en curso, dura durante todo el tiempo de vida del proyecto e involucra a muchos participantes. Por supuesto es en parte cuestión de tener una documentación actualizada (mira <xref linkend="documentation"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>) y asegurándote que la gente vaya ahí. Pero es tambien mucho más que eso; las secciones que siguen discuten esta estrategia en detalle.
gl: Realmente, a execución desta división é un proceso de dous pasos. Por unha banda creas a nova lista de correo (ou canal de IRC, ou o que for), e por outra invistes o tempo que for necesario para dun xeito educado ir instando a xente a <emphasis>empregar</emphasis> os novos foros dun xeito apropiado. O segundo paso pode levar semanas, mais normalmente a xente acaba captando a idea. Simplemente tes que facer ver, cando unha persoa enviar unha mensaxe a un destino equivocado, cal é o destino correcto, e facelo dun xeito visible e animando a xente a que axude neste proceso didáctico. Tamén adoita ser útil contar cunha páxina web na que se forneza unha guía para todas as listas dispoñibles; deste xeito as túas respostas poden, simplemente, referenciar a esa páxina web e, como regalo, o receptor tamén vai aprender que debe pesquisar nas guías antes de preguntar.

source: Strategy (2) is an ongoing process, lasting the lifetime of the project and involving many participants. Of course it is partly a matter of having up-to-date documentation (see <xref linkend="documentation"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>) and making sure to point people there. But it is also much more than that; the sections that follow discuss this strategy in detail.
es: Sobresaliente uso de los archivos
gl: A estratexia (2) é un proceso en curso, permanecendo en proceso durante toda a vida do proxecto e envolvendo moitos participantes. Por suposto, trátase en parte da recorrente cuestión de manter documentación actualizada (bótalle unha ollada a <xref linkend="documentation"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>), mais tamén se trata se asegurarte de dirixir a xente cara onde esta se atopa, e en última instancia é moito máis que todo o anterior, tal como se vai discutir e amosar nas sección que seguen, nas cales se vai ver esta estratexia en detalle.

source: Conspicuous Use of Archives
es: Tipicamente, todas las comunicaciones de un proyecto Open Source (excepto algunas veces conversaciones en el IRC), son archivadas. Los archivos son públicos y se pueden buscar, y tienen una estabilidad referencial: que significa, una vez que una pieza de información se ha grabado en una dirección particular, permanece en esa dirección para siempre.
gl: Uso manifesto dos arquivos

source: Typically, all communications in an open source project (except sometimes IRC conversations) are archived. The archives are public and searchable, and have referential stability: that is, once a given piece of information is recorded at a particular address, it stays at that address forever.
es: Usa estos archivos tanto como puedas, y tan visiblemente como sea posible. Incluso cuando sepas la respuesta a alguna pregunta, si piensas que existe una referencia en los archivos que contiene la respuestas, gasta el tiempo necesario para buscarla y presentarla. Cada vez que hagas esto de una manera públicamente visible, algunas personas aprenderan la primera vez que significan esos archivos, y que buscando en ellos pueden encontrar respuestas. Tambien, refiriéndose a los archivos en vez de reescribir la respuesta, refuerzas la norma social contra la duplicación de información. ¿Por qué obtenemos la misma respuesta en dos sitios diferentes? Cuando el número de sitios que se puede encontrar es mantenido a un mínimo, la gente que lo ha encontrado antes están más predispuestos a recordar qué y donde buscarlo para las próximas veces. Las referencias bien situadas tambien contribuyen a la calidad de los resultados de búsqueda en general, porque ellos refuerzan los recursos del objetivo en los rankings de los motores de búsqueda en Internet.
gl: Tipicamente, todas as comunicacións nun proxecto de software libre (excepto, ás veces, as conversas por IRC) son arquivadas. Os arquivos son públicos e consultables, e teñen estabilidade referencial: isto é, unha vez que unha peza de información é gravada nun enderezo particular, permanece nese enderezo para sempre.

source: Use those archives as much as possible, and as conspicuously as possible. Even when you know the answer to some question off the top of your head, if you think there's a reference in the archives that contains the answer, spend the time to dig it up and present it. Every time you do that in a publicly visible way, some people learn for the first time that the archives are there, and that searching in them can produce answers. Also, by referring to the archives instead of rewriting the advice, you reinforce the social norm against duplicating information. Why have the same answer in two different places? When the number of places it can be found is kept to a minimum, people who have found it before are more likely to remember what to search for to find it again. Well-placed references also contribute to the quality of search results in general, because they strengthen the targeted resource's ranking in Internet search engines.
es: Sin embargo, hay veces en las que duplicar la información tiene sentido. Por ejemplo, supon que hay una respuesta en los archivos, que no es de tí, diciendo:
gl: Emprega estes arquivos tanto como puideres, e dun xeito tan manifesto como che for posible. Embora saibas a resposta a unha cuestión, se pensas que existe unha referencia nos arquivos que conteña a resposta, emprega o tempo preciso para buscárela e emprégaa. Cada vez que fas isto dun xeito publicamente visible, algunha xente vai aprender para que valen estes arquivos e vaise decatar de que están aí á súa disposición, e que buscar as cousas neles pódelles dar respostas. Así, mesmo referenciares aos arquivos, en lugar de reescribires unha resposta dada con anterioridade, reforza a norma social de evitar a duplicación de información. Para que ter a mesma resposta en dous lugares diferentes? Cando o número de lugares nos que se pode atopar a resposta é mínimo, a xente que a atopase con anterioridade é máis propensa a lembrar que pesquisar para atopala novamente. As referencias ben situadas tamén contribúen á calidade dos resultados das procuras, dado que reforzan o ranking nas ferramentas de procura de Internet do recurso apuntado.

source: There are times when duplicating information makes sense, however. For example, suppose there's a response already in the archives, not from you, saying:
gl: Contodo, hai veces nas que duplicares a información si que ten sentido. Por exemplo, imaxina que existe unha resposta nos arquivos, non aportada por ti, dicindo:

source: It appears that your Scanley indexes have become frobnicated. To unfrobnicate them, run these steps: 1. Shut down the Scanley server. 2. Run the 'defrobnicate' program that ships with Scanley. 3. Start up the server.
es: Entonces, meses después, ves otro mail indicando que algunos indices han sido corrompidos. Buscas los archivos y presentas la vieja respuesta anterior, pero te das cuenta que faltan algunos pasos (quizás por error, o quizá porque el software ha cambiado desde que se escribió ese post). La clásica manera para manejar esto, es escribir un nuevo mail, con un conjunto de instrucciones más completo, y explicitamente dar como obsoleto el anterior post mencionándolo así:
gl: Parece que os índices do teu servidor Dharma están Lockeados. Para deslockealos, executa os seguintes comandos: 1. Apaga o servidor Dharma 2. Executa a aplicación 'deslocke' incluída no servidor Dharma 3. Acende o servidor

source: Then, months later, you see another post indicating that someone's indexes have become frobnicated. You search the archives and come up with the old response above, but you realize it's missing some steps (perhaps by mistake, or perhaps because the software has changed since that post was written). The classiest way to handle this is to post a new, more complete set of instructions, and explicitly obsolete the old post by mentioning it:
gl: Entón, meses despois, ves outra mensaxe indicando que os índices de alguén sufriron dunha lockeización. Fas unha procura nos arquivos e atopas a resposta anterior, mais decátaste de que na mesma non están incluídos algúns pasos (quizais por erro, quizais porque o software mudou desde que a resposta primixenia pasou a formar parte dos arquivos). O xeito clásico de manexar esta situación é mediante o envío dunha nova mensaxe que inclúa un conxunto de instrucións máis completo, e colgarlle a etiqueta de "obsoleta" á resposta orixinal mediante unha mención ao estilo de:

source: It appears that your Scanley indexes have become frobnicated. We saw this problem back in July, and J. Random posted a solution at http://blahblahblah/blah. Below is a more complete description of how to unfrobnicate your indexes, based on J. Random's instructions but extending them a bit: 1. Shut down the Scanley server. 2. Become the user the Scanley server normally runs as. 3. As that user, run the 'defrobnicate' program on the indexes. 4. Run Scanley by hand to see if the indexes work now. 5. Restart the server.
es: (En un mundo ideal, sería posible poner una nota en el viejo post, indicando que existe información más actualizada y apuntando al nuevo post que la contiene. Sin embargo, no conozco ningún software de archivación que ofrezca una característica "obsoleto por", quizá porque sería muy difícil de implementar de una manera en que no viole la integridad de los archivos. Esta es otra razón de porqué es buena idea crear páginas web con respuestas a cuestiones comunes.
gl: Parece que os índices do teu servidor Dharma están Lockeados. Xa vimos ese problema o xullo pasado, e D. Hume enviou unha solución, que se pode ver en http://ghandalf-loves-lost.org/servidoresDharma A continuación, expoñemos unha descrición máis completa sobre como deslockeizar os teus índices, baseada nas instrucións de D. Hume, mais ampliándoas un chisco: 1. Apaga o servidor Dharma 2. Rexístrate como usuario co que o servidor Dharma adoita executarse 3. Como ese usuario, executa a aplicación 'deslocke' sobre os índices 4. Arranca manualmente o servidor Dharma para testares se os índices funcionan 5. Reinicia o servidor

source: (In an ideal world, it would be possible to attach a note to the old post, saying that there is newer information available and pointing to the new post. However, I don't know of any archiving software that offers an "obsoleted by" feature, perhaps because it would be mildly tricky to implement in a way that doesn't violate the archives' integrity as a verbatim record. This is another reason why creating dedicated web pages with answers to common questions is a good idea.)
es: Los archivos probablemente son buscados más a menudo para respuestas a cuestiones técnicas, pero su importancia para el proyecto va más allá de eso. Si una pauta formal del proyecto son sus leyes establecidas, los archivos son su ley común: una grabación de todas las decisiones hechas y como se llegó hasta ellas. En cualquier discusión recurrente, actualmente es casi obligatorio empezar con una búsqueda en los archivos. Esto permite empezar la discusión con un sumario del estado actual de las cosas, anticipandose a objeciones, preparando refutaciones y posiblemente descubriendo ángulos que no habías imaginado. También los otros participantes <emphasis>esperan</emphasis> de ti que hayas hecho una búsqueda en los archivos. Incluso si las discusiones previas no llevaron a ninguna parte, tú deberías incluir sugerencias cuando vuelvas al téma, para que la gente pueda ver por si mismos a) que no llegaron a ningun consenso, y b) que tú hiciste tu trabajo, y por tanto que probablemente se este diciendo algo ahora que no se dijo anteriormente.
gl: (Nun mundo ideal, sería posible engadirlle unha nota á antiga mensaxe dicindo que existe información actualizada e apuntando á nova mensaxe. Contodo, non coñezo ningún software de arquivamento que ofreza unha funcionalidade ao estilo de "obsoletizado por", pode que debido a que sería moi dificultoso implementar isto sen violar a integridade dos arquivos. Esta é outra das razóns polas que crear páxinas web adicadas con respostas para as preguntas comúns é unha excelente idea).

source: Archives are probably most often searched for answers to technical questions, but their importance to the project goes well beyond that. If a project's formal guidelines are its statutory law, the archives are its common law: a record of all decisions made and how they were arrived at. In any recurring discussion, it's pretty much obligatory nowadays to start with an archive search. This allows you to begin the discussion with a summary of the current state of things, anticipate objections, prepare rebuttals, and possibly discover angles you hadn't thought of. Also, the other participants will <emphasis>expect</emphasis> you to have done an archive search. Even if the previous discussions went nowhere, you should include pointers to them when you re-raise the topic, so people can see for themselves a) that they went nowhere, and b) that you did your homework, and therefore are probably saying something now that has not been said before.
es: Trata todos los recursos como archivos
gl: Probablemente as consultas que se fagan con máis frecuencia sobre os arquivos sexan aquelas derivadas de cuestións técnicas, mais a súa importancia para o proxecto vai moito máis alá. Se as liñas e guías formais dun proxecto son o seu estatuto, os arquivos son a súa lei de usos e costumes: un rexistro de todas as decisións tomadas e de como se chegou ás mesmas. En calquera discusión recorrente, é case obrigatorio comezar cunha procura nos arquivos. Isto permite comezar a discusión cun resumo do estado actual das cousas, anticipar obxeccións, preparar refutacións, e posiblemente descubrir ángulos que doutro xeito non terías. Á súa vez, é lóxico que os outros participantes na discusión dean por suposto que fixeches esta procura. Mesmo se as discusións previas non chegaron a ningures, debe incluír referencias ás mesmas cando volvas a sacar o tema, para que a xente poida ver por si mesma a) que non se chegou a ningures, e b) que fixeches os teus deberes, e que probablemente se estea dicindo agora o que non se dixo anteriormente.

source: Treat all resources like archives
es: Todos los consejos anteriores son extensibles más allá de los archivos de las listas de mail. Tener piezas particulares de información de manera estable, y en direcciones que se puedan encontrar convenientemente debería ser un principio de organización para toda la información de un proyecto. Vamos a ver la FAQ como un caso de estudio.
gl: Trata todos os recursos como arquivos

source: All of the preceding advice applies to more than just mailing list archives. Having particular pieces of information at stable, conveniently findable addresses should be an organizing principle for all of the project's information. Let's take the project FAQ as a case study.
es: ¿Cómo usa la gente una FAQ?
gl: Todos os consellos anteriores son válidos en máis circunstancias que o caso concreto das listas de correo. Ter pezas concretas de información en enderezos estables e fáciles de atopar adoita ser un principio básico de organización para a información de calquera proxecto. Imos tomar as FAQ (Preguntas Frecuentes) dun proxecto como caso de estudo:

source: How do people use a FAQ?
es: Buscan palabras y frases específicas.
gl: Como emprega a xente unha FAQ?

source: They want to search in it for specific words and phrases.
es: Quieren poder navegarla, disfrutando de la información sin buscar necesariamente respuestas a cuestiones específicas.
gl: Pesquisan palabras e frases específicas.

source: They want to browse it, soaking up information without necessarily looking for answers to specific questions.
es: Esperan que motores de búsqueda como google conozcan el contenido de la FAQ, de manera que las búsquedas puedan ser entradas en la FAQ.
gl: Queren poder navegala, gozando da información sen necesariamente buscar respostas a cuestións específicas.

source: They expect search engines such as Google to know about the FAQ's content, so that searches can result in FAQ entries.
es: Quieren ser capaces de dirigirse directamente a otra gente en temas específicos en la FAQ.
gl: Esperan que motores de procura como Google coñezan o contido da FAQ, de tal xeito que as procuras aporten como resultado entradas na FAQ.

source: They want to be able to refer other people directly to specific items in the FAQ.
es: Quieren ser capaces de añadir nuevo material a la FAQ, pero hay que ver que esto ocurre menos a menudo que la búsqueda de respuestas &mdash;Las FAQs son de lejos mucho más leidas que escritas.
gl: Queren poder referirse directamente a outra xente en temas específicos na FAQ.

source: They want to be able to add new material to the FAQ, but note that this happens much less often than answers are looked up&mdash;FAQs are far more often read from than written to.
es: El punto 1 implica que la FAQ debería estar disponible en algún tipo de formato textual. Los puntos 2 y 3 implican que la FAQ debería estar disponible en forma de página HTML, con el punto 2 indicando adicionalmnente que el HTML debería ser diseñado con legibilidad (ejem., necesitaras algún tipo de control sobre su apariencia), y debería tener una tabla de contenidos. El punto 4 significa que cada entrada individual en la FAQ debería ser asignada como un HTML <firstterm>named anchor</firstterm>, (anclas con nombre) un tag que permite a la gente alcanzar un sitio particular en la página. El punto 5 significa que los ficheros fuente de la FAQ deberían estar disponibles de una manera conveniente (ver <xref linkend="version-everything"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>), un formato que sea fácil de editar.
gl: Queren poder engadir novo material na FAQ, mais ten en conta que isto ocorre moito menos a miúdo que a procura de respostas &mdash;as FAQs son de lonxe moito máis lidas que escritas.
