Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: Communications
es: Comunicaciones
gl: Comunicacións

source: The ability to write clearly is perhaps the most important skill one can have in an open source environment. In the long run it matters more than programming talent. A great programmer with lousy communications skills can get only one thing done at a time, and even then may have trouble convincing others to pay attention. But a lousy programmer with good communications skills can coordinate and persuade many people to do many different things, and thereby have a significant effect on a project's direction and momentum.
es: La capacidad de escribir claramente es quizás la más importante habilidad que se puede tener en un ambiente de código abierto. A largo plazo es más importante que el talento para programar. Un gran programador con pocas habilidades comunicativas puede realizar sólo una cosa a la vez, y puede tener problemas convenciendo a otros para que le presten atención. Pero un mal programador con buenas habilidades de comunicación puede coordinar y persuadir mucha gente para realizar diferentes cosas, y de tal modo tener un efecto significativo sobre la dirección y el ímpetu de un proyecto.
gl: A habilidade de escribir dun xeito claro quizais sexa a capacidade máis importante que unha persoa poida ter nun entorno de software libre. A longo prazo ten maior importancia que o talento programando. Un gran programador con habilidades comunicativas pobres só pode facer unha cousa á vez, e mesmo poder ter problemas para convencer a outros para que lle presten atención. Mais un programador mediocre con boas capacidades comunicativas pode coordinar e persuadir unha morea de xente para que faga distintas cousas, e dese xeito ter un efecto significativo na dirección do proxecto e no seu ímpeto.

source: There does not seem to be much correlation, in either direction, between the ability to write good code and the ability to communicate with one's fellow human beings. There is some correlation between programming well and describing technical issues well, but describing technical issues is only a tiny part of the communications in a project. Much more important is the ability to empathize with one's audience, to see one's own posts and comments as others see them, and to cause others to see their own posts with similar objectivity. Equally important is noticing when a given medium or communications method is no longer working well, perhaps because it doesn't scale as the number of users increases, and taking the time to do something about it.
es: No parece haber mucha correlación, en cualquier sentido, entre la capacidad de escribir buen código y la capacidad de comunicarse con sus compañeros. Hay cierta correlación entre programar bien y describir bien cuestiones técnicas, pero describir asuntos técnicos es sólo una pequeña parte de las comunicaciones en un proyecto. Más importante es la capacidad de enfatizar con su audiencia, ver sus propios correos y comentarios como lo ven los demás, y hacer que los demás vean sus propios correos con objetividad similar. Igualmente importante es notificar cuando un medio o método de comunicación determinado no está funcionando bien, quizás porque no escala al ritmo que incrementa el número de usuarios, y tomar el tiempo para hacer algo al respecto.
gl: Non parece haber moita correlación, en ningunha dirección, entre a capacidade de escribir bo código e mais a habilidade de comunicarse co resto dos compañeiros humanos. Si que hai correlación entre programar ben e describir tecnicamente ben as cousas, mais describir tecnicamente ben as cousas é unha parte ínfima das comunicacións nun proxecto. Moito máis importante é a capacidade de empatizar coa audiencia, de ver os correos e comentarios propios como os vería outra persoa, e facer que os demais vexan os seus propios correos cunha obxectividade similar. Igualmente importante é notificares cando un método de comunicacións non está funcionando ben, quizais porque non escale ben co incremento do número de usuarios, e tomáreste o tempo preciso para faceres algo ao respecto.

source: All of which is obvious in theory&mdash;what makes it hard in practice is that free software development environments are bewilderingly diverse both in audiences and in communications mechanisms. Should a given thought be expressed in a post to the mailing list, as an annotation in the bug tracker, or as a comment in the code? When answering a question in a public forum, how much knowledge can you assume on the part of the reader, given that "the reader" is not only the one who asked the question in the first place, but all those who might see your response? How can the developers stay in constructive contact with the users, without getting swamped by feature requests, spurious bug reports, and general chatter? How do you tell when a medium has reached the limits of its capacity, and what do you do about it?
es: Aquello que es obvio en teoría y que se hace duro en la práctica es que los ambientes de desarrollo de software libre son desconcertadamente diversos tanto en audiencias como en mecanismos de comunicación. ¿Debería una opinión dada ser expresada en un mensaje a la lista de correo, como una anotación en el gestor de fallos, o como un comentario en el código? Al contestar una pregunta en un foro público, ¿cuánto conocimiento puedes asumir por parte del lector?, en primer lugar dado que "el lector" no es el único que hizo la pregunta, ¿pueden todos ver tú respuesta? ¿Como pueden los desarrolladores permanecer en contacto constructivo con los usuarios, sin ser ahogado por peticiones de características, informes falsos de fallos, y charla en general? ¿Cómo dices cuando un medio ha alcanzado los límites de su capacidad, y que harías al respecto?
gl: Todo isto na teoría é obvio. O que o fai difícil na práctica é que son moi diversas tanto no público como nos mecanismos de comunicación. Un pensamento debería ser expresado nunha mensaxe na lista de correo, como anotación no seguimento de erros, ou como comentario no código? Cando se responde unha pregunta nun foro público, canto debemos supor que sabe o lector, dado que o «lector» non vai ser só o que responda a pregunta en primeiro lugar, senón que tamén serán aqueles que vexan a túa resposta? Canto deben estar os programadores en contacto constructivo cos usuarios, sen ser inundados por solicitudes de funcións, informes de erros e charla xeral? Cómo avisas cando un medio alcanzou o límite da súa capacidade e que fas?

source: Solutions to these problems are usually partial, because any particular solution is eventually made obsolete by project growth or changes in project structure. They are also often <foreignphrase>ad hoc</foreignphrase>, because they're improvised responses to dynamic situations. All participants need to be aware of when and how communications can become bogged down, and be involved in solutions. Helping people do this is a big part of managing an open source project. The sections that follow discuss both how to conduct your own communications, and how to make maintenance of communications mechanisms a priority for everyone in the project.
es: Las soluciones a estos problemas son usualmente parciales, ya que cualquier solucion particular se vuelve finalmente obsoleta por el crecimiento del proyecto o los cambios en la estructura del mismo. Son a menudo <foreignphrase>ad hoc</foreignphrase>, ya que son respuestas improvisadas a situaciones dinámicas. Todos los participantes necesitan darse cuenta de como y cuando la comunicacion puede volverse farragosa, y deben estar implicados en buscar soluciones. Ayudar a la gente a hacer esto es una gran parte de la direccion en un proyecto open source. Las secciones siguientes tratan sobre como conducir tu propia comunicacion y como hacer el mantenimiento de los mecanismos de comunicacion una prioridad para todo el mundo en el proyecto.
gl: As solucións a estes problemas normalmente son parciais, porque unha solución particular convertirarse en obsoleta cando medre o proxecto ou se dean cambios na estrutura deste. A miúdo tamén están ad hoc, porque se improvisan respostas a situacións dinámicas. Todos os participantes teñen que ser conscientes de cando e como as comunicacións poden chegar a estancarse e estar involucradas nas solucións. Axudar á xente a facer isto é unha grande parte de xestionar un proxecto fonte aberto. As seccións que siguen a continuación discuten sobre como conducir as túas propias comunicacións e como facer que os mecanismos de comunicación sexan unha prioridade para todos os que se atopan no proxecto.

source: There has been some interesting academic research on this topic; for example, see <citetitle>Group Awareness in Distributed Software Development</citetitle> by Gutwin, Penner, and Schneider. This paper was online for a while, then unavailable, then online again at <ulink url="http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf"></ulink>. So try there first, but be prepared to use a search engine if it moves again.
es: Se ha hecho alguna investigacion academica interesante en esta materia; por ejemplo, vease <citetitle>Group Awareness in Distributed Software Development</citetitle> por Gutwin, Penner, y Schneider (solia estar disponible on-line, pero parece que ha desaparecido, al menos temporalmente; utiliza una herramienta de busqueda encontrarla).
gl: Sobre este tema tense realizado algunha investigación interesante; por exemplo, o paper <citetitle>Group Awareness in Distributed Software Development</citetitle> de Gutwin, Penner e Schneider. Esta publicación estivo online por un tempo, logo non dispoñible e de novo online en <ulink url="http://www.st.cs.uni-sb.de/edu/empirical-se/2006/PDFs/gutwin04.pdf"></ulink>. Polo tanto usa ese enlace primeiro, mais cecáis terás que usar un buscador se o moven de novo.

source: You Are What You Write
es: Tú eres lo que escribes
gl: Es o que escribes

source: Consider this: the only thing anyone knows about you on the Internet comes from what you write, or what others write about you. You may be brilliant, perceptive, and charismatic in person&mdash;but if your emails are rambling and unstructured, people will assume that's the real you. Or perhaps you really are rambling and unstructured in person, but no one need ever know it, if your posts are lucid and informative.
es: Considera esto: la única cosa que cualquier persona sabe de ti en Internet viene de lo que tú escribes, o de lo que otros escriben acerca de ti. Puedes ser brillante, perceptivo, y carismático en persona pero si tus correos electrónicos son incoherentes y no estructurados, la gente asumirá que esé es el verdadero tú. O quizás realmente eres incoherente y no estructurado en persona, pero nadie tiene por que saberlo, si tus mensajes son claros e informativos.
gl: Considera que a única cousa que todo o mundo sabe de ti en Internet virá polo que escribes o que os demais escriben sobre ti. Pode que sexas unha persoa brillante, perceptiva e carismática, pero se os teus emails son demasiado extensos e non teñen estrutura, a xente asumirá que ti tamén es así. Ou quizais si que es unha persoa que fala de máis e pouco estruturada, pero ninguén ten por que sabelo se as túas mensaxes son lúcidas e informativas.

source: Devoting some care to your writing will pay off hugely. Long-time free software hacker Jim Blandy tells the following story:
es: Dedicar cierto cuidado a tu escritura valdrá enormemente la pena. El veterano hacker de software libre Jim Blandy narra la siguiente historia:
gl: Prestarlle atención ao que escribes paga a pena. O hacker Jim Blandy de software libre a longo prazo contaba a seguinte historia:

source: Back in 1993, I was working for the Free Software Foundation, and we were beta-testing version 19 of GNU Emacs. We'd make a beta release every week or so, and people would try it out and send us bug reports. There was this one guy whom none of us had met in person but who did great work: his bug reports were always clear and led us straight to the problem, and when he provided a fix himself, it was almost always right. He was top-notch.
es: Por el año 1993 trabajaba para la Fundación de Software Libre, y estábamos llevando a cabo el beta-testing de la versión 19 de GNU Emacs. Haríamos una publicación beta más o menos cada semana, y la gente la probaría y nos enviaría informes de error. Había un chico que ninguno de nosotros conocía en persona pero que hizo un gran trabajo: sus informes de error siempre fueron claros y nos enfocaba hacia el problema y, cuando nos proporcionaba una corrección, casi siempre tenía razón. Era un fuera de serie.
gl: En 1993 estaba traballando para a Free Software Foundation e estabamos probando a versión 19 of GNU Emacs. Faciamos unha versión beta cada semana ou así, e a xente tiña que probala e mandarnos reportes de erros. Había un tipo que ninguén de nós coñecera en persoa pero que facía un gran traballo: os seus informes de erros eran sempre moi claros e contaba sempre directamente o problema, e cando nos achegaba el un arranxo, case sempre estaba no certo. Era moi bo.

source: Now, before the FSF can use code written by someone else, we have them do some legal paperwork to assign their copyright interest to that code to the FSF. Just taking code from complete strangers and dropping it in is a recipe for legal disaster.
es: Ahora, antes que la FSF pueda utilizar código escrito por alguien, hay que realizar un papeleo legal para que el interés de esa persona hacia el copyright del código pase a la FSF. Simplemente tomando el código de completos extraños dejándolo dentro es una receta para el desastre legal.
gl: Agora, antes de que a Free Software Foundation puidera usar un código escrito por outra persoa, tiñamos que facer que firmasen algúns documentos legais para asinarlle o copyright a ese código para a FSF. Tomar un código dun descoñecido e deixalo é un indicio de catástrofe legal.

source: So I emailed the guy the forms, saying, "Here's some paperwork we need, here's what it means, you sign this one, have your employer sign that one, and then we can start putting in your fixes. Thanks very much."
es: Por lo que le envié un correo al chico con los formularios diciéndole "Te envío algo de papeleo que necesitamos, esto es lo que significa, firmas este, haces que quien te tiene contratado firme este otro y, entonces podemos comenzar a utilizar tus correcciones. Muchas gracias."
gl: Así que lle enviei ao tipo os formularios dicíndolle «precisamos ter listo este papelame, asina este documento, este que o asine o teu xefe e despois podemos comezar a pagarche. Moitas grazas».

source: He sent me back a message saying, "I don't have an employer."
es: Me envió un mensaje de vuelta diciendo: "No trabajo para nadie."
gl: Entón respondeume «non teño xefe».

source: So I said, "Okay, that's fine, just have your university sign it and send it back."
es: Por lo que le dije: "Bien, eso está bien, simplemente haz que firme tu universidad y envíamelo de vuelta."
gl: Así que escribinlle «Dacordo, non te preocupes. Consegue a firma da universidade e será suficiente».

source: After a bit, he wrote me back again, and said, "Well, actually... I'm thirteen years old and I live with my parents."
es: Después de un poco, me escribió de nuevo y me dijo: "Verás, realmente... tengo trece años y vivo con mis padres."
gl: Ao cabo dun momento, respondeume dicindo «É que en realidade… Teño trece anos e vivo con meus pais».

source: Because that kid didn't write like a thirteen-year-old, no one knew that's what he was. Following are some ways to make your writing give a good impression too.
es: Debido a que ese chico no escribía como si tuviera trece años nadie supuso que los tuviera. A continuación se exponen también algunas cosas que conseguirán además que tu escritura de una buena impresión.
gl: Como ese rapaz non escribía como alguén de trece anos, ninguén supuña que os tiña. A continuación temos algunhas formas para facer que a túa escrita cree unha boa impresión tamén.

source: Structure and Formatting
es: Estructura y formato
gl: Estrutura e formato

source: Don't fall into the trap of writing everything as though it were a cell phone text message. Write in complete sentences, capitalizing the first word of each sentence, and use paragraph breaks where needed. This is most important in emails and other composed writings. In IRC or similarly ephemeral forums, it's generally okay to leave out capitalization, use compressed forms of common expressions, etc. Just don't carry those habits over into more formal, persistent forums. Emails, documentation, bug reports, and other pieces of writing that are intended to have a permanent life should be written using standard grammar and spelling, and have a coherent narrative structure. This is not because there's anything inherently good about following arbitrary rules, but rather that these rules are <emphasis>not</emphasis> arbitrary: they evolved into their present forms because they make text more readable, and you should adhere to them for that reason. Readability is desirable not only because it means more people will understand what you write, but because it makes you look like the sort of person who takes the time to communicate clearly: that is, someone worth paying attention to.
es: No caigas en la trampa de escribir todo como si fuera un mensaje de teléfono móvil. Escribe frases completas, poniendo en mayúsculas la primera palabra de cada frase, y usando separaciones de párrafo donde sea necesario. Esto es lo más importante en correos electrónicos y otras composiciones. En el IRC u otros foros efímeros similares, generalmente es correcto dejar de poner mayúsculas, utilizar formas comprimidas o expresiones comunes, etc. Simplemente no lleves esos hábitos a foros más formales o persistentes. Correos electrónicos, documentación, informes de error y otras piezas de escritura que suelen tener una larga vida deberían escribirse usando una gramática y una spelling estándar, y tener una estructura narrativa coherente. Esto no se debe a que haya algo inherentemente bueno siguiendo reglas arbitrarias, sino a que estas reglas <emphasis>no</emphasis> son arbitrarias: evolucionan en las formas presentes ya que hacen que el texto sea más leíble y, por esa razón, deberías seguirlas. La legibilidad no sólo es deseable para que la mayoría de gente entienda lo que escribes, sino porque hace que que parezcas la clase de persona que se toma su tiempo en comunicarse de una forma clara: es decir, alguien a quien vale la pena prestar atención.
gl: Non caias no erro de escribir todo coma se fose unha mensaxe ao móbil. Escribe frases completas, coa primeira letra de cada unha delas en maiúscula, e utiliza as parénteses onde sexan necesarias. Isto é o máis importante na escrita de correos ou doutras redaccións. No Internet Relay Chat ou noutros foros deste tipo, xeralmente non é un erro esquecer as maiúsculas, utilizar contraccións ou expresións comúns… O que debes ter en conta é non trasladar estes hábitos a contornos formais e foros máis persistentes. Os correos, os documentos, os reportes de erros e outras formas de escrita están destinados a durar para sempre, así que deberían ser escritos utilizando a gramática e a ortografía estándares, e ter unha estrutura narrativa coherente. Isto non é así non porque non sexa bo seguir as normas arbitrarias, senón porque estas normas non son arbitrarias: evolucionan á forma do presente porque fan que os textos sexan máis fáciles de ler, e deberías seguir isto por esta razón. É desexable que o texto sexa fácil de ler non só porque significa que a xente entenderá o que escribes, senón porque fará que parezas o tipo de persoa que toma o seu tempo para comunicarse claramente; é dicir, alguén a quen paga a pena prestar atención.

source: For email in particular, experienced open source developers have settled on certain conventions:
es: En particular, para correos electrónicos, desarrolladores experimientados de open source han decidido ciertas convenciones:
gl: Para os correos, en particular, os expertos, os programadores, sentaron unha serie de convencións:

source: Send plain text mails only, not HTML, RichText, or other formats that might be opaque to text-only mail readers. Format your lines to be around 72 columns long. Don't exceed 80 columns, which has become the <foreignphrase>de facto</foreignphrase> standard terminal width (that is, some people may use wider terminals, but no one uses a narrower one). By making your lines a little <emphasis>less</emphasis> than 80 columns, you leave room for a few levels of quoting characters to be added in others' replies without forcing a rewrapping of your text.
es: Envía correos solo de texto plano, no en HTML, texto enriquecido u otros formatos ya que podrían no ser leidos por lectores que leen sólo texto plano. Formatea las líneas para que estén sobre las 72 columnas de largo. No excedas las 80 columnas, que ha sido <foreignphrase>de facto</foreignphrase> el ancho estándar del terminal (es decir, hay gente que utiliza terminales más anchos, pero nadie utiliza terminales no más estrechos). Al hacer las líneas un poco <emphasis>menores</emphasis> de 80 columnas da cabida a unos cuantos niveles de caracteres de citado para ser añadidos en otras respuestas sin forzar un estrechamiento de tu texto.
gl: Envía só textos sen formato; nin HTML, nin textos enriquecidos ou outros formatos que poidan ser pouco claros para os lectores de correos. Dálles formato ás túas liñas sobre 72 columnas. Non excedas as 80 columnas, que se converteron no estándar de largo (pode que algunha xente utilice terminais máis largos, pero ninguén utilizará terminais máis estreitos). Se escribes as túas liñas en menos de 80 columnas, deixarás espazo para as citas que se engaden nas respostas, sen que haxa que reaxustar o texto.

source: <emphasis>Use real line breaks.</emphasis> Some mailers do a kind of fake line wrapping, whereby when you're composing an email, the display shows line breaks that aren't actually there. When the mail goes out, it may not have the line breaks you thought it had, and it will wrap awkwardly on some people's screens. If your mailer might use fake line breaks, look for a setting you can tweak to make it show the true line breaks as you compose.
es: <emphasis>Utiliza saltos de línea reales.</emphasis> Algunos clientes de correo muestran un falso formateo de línea, mientras estás escribiendo un correo, viéndose en la pantalla saltos de línea donde en realidad no los hay. Cuando se envía el correo, no tendrá los saltos de línea que se pensaba y se presentará con un formato horroroso en la pantalla de la gente. Si tu cliente de correo muestra falsos saltos de línea, busca posibilidad de quitar la opción para ver los saltos de línea reales a medida que escribes el correo.
gl: Utiliza quebras de liñas reais. Algúns servizos de correo axustan o texto de forma errada, de forma que cando estás compoñendo un correo electrónico, visualízanse quebras de liña que en realidade non existen. Cando se envía o correo, pode que non teña quebras de liña que pensabas que tiña, e axustarase mal nas pantallas dos demais. Se pode que o teu servizo de correo use quebras de liña falsas, busca un configuración axeitada coa que poidas mostrar as quebras de liña verdadeiras tal e como ti as compós.
