Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: <emphasis>Who</emphasis> reported the problem to you? The answer to this question doesn't change the nature of the vulnerability, of course, but it does give you an idea of how many other people might know about it. If the report comes from one of the project's own developers, you can breathe a little easier (but only a little), because you can trust them not to have told anyone else about it. On the other hand, if it came in an email from <literal>anonymous14@globalhackerz.net</literal>, then you'd better act as fast as you can. The person did you a favor by informing you of the problem at all, but you have no idea how many other people she's told, or how long she'll wait before exploiting the vulnerability on live installations.
es: Nota que la diferencia que estamos hablando aquí es un rango estrecho entre <emphasis>urgente</emphasis> y <emphasis>extremadamente&nbsp;urgente</emphasis>. Incluso cuando el informe viene de una fuente conocida, puede haber otra gente en la red que descubrieron el bug hace tiempo y no han informado de ello. La única vez que las cosas no son urgentes es cuando el bug inherentemente no compromente la seguridad muy severamente.
gl: <emphasis>Quen</emphasis> te informou do problema? A resposta desta pregunta por suposto que non muda a natureza da vulnerabilidade, mais dáche unha idea sobre que outra xente pode coñecelo. Se o informe provén dalgún desenvolvedor do proxecto, podes estar un pouco máis tranquilo (pero só un pouco) dado que podes confiar en que non llo teña contado a ninguén máis. Por outra banda, se o informe veu nun correo electrónico desde <literal>anonymous14@globalhackerOrco.net</literal> entón o mellor é que actúes o máis axiña que poidas. A persoa en cuestión fíxoche un favor informándote do problema, mais non tes nin idea de a canta outra xente llo puido contar, ou sobre cando tempo vai tardar antes de explotar a vulnerabilidade nas instalacións en produción.

source: Note that the difference we're talking about here is often just a narrow range between <emphasis>urgent</emphasis> and <emphasis>extremely&nbsp;urgent</emphasis>. Even when the report comes from a known, friendly source, there could be other people on the Net who discovered the bug long ago and just haven't reported it. The only time things aren't urgent is when the bug inherently does not compromise security very severely.
es: El ejemplo de "<literal>anonymous14@globalhackerz.net</literal>" por cierto, no es burlón. Realmente puedes obtener informes de gente con identidades-encubiertas que, por sus palabras y comportamiento, nunca clarifican si estan de tu parte o no. No importa: si te han informado de el agujero de seguridad, ellos sienten que te han hecho un buen favor, y tú deberías responderles de la misma manera. Agredeciéndoles el informe, facilitándoles una fecha antes de la cual planeas liberar un parche público, y mantenlo al tanto. Algunas veces ellos pueden <emphasis>darte</emphasis> una fecha&mdash;que es, una amenaza implícita de publicar el bug en una fecha dada, si estás preparado o no. Esto puede parecer un juego de poder de intimidación, pero es más una acción preferente resultado de decepciones anteriores con productores de software que no respondían y no se tomaban los informes de seguridad en serio. This may feel like a bullying power play, but it's more likely a pre&euml;mptive action resulting from past disappointment with unresponsive software producers who didn't take security reports seriously enough. De todas maneras, no puedes permitirte ignorar a esta persona. Después de todo, si el bug es severo, el tiene conocimiento que podría causar grandes problemas a tus usuarios. Trata a estos informadores bien, y espera que ellos tambien te traten bien a tí.
gl: Ten en conta que a diferenza sobre a que estamos falando adoita ser un estreito rango entre <emphasis>urxente</emphasis> e <emphasis>extremadamente&nbsp;urxente</emphasis>. Mesmo cando o informe provén dunha orixe coñecida e amistosa, pode haber outras persoas na Rede que descubriran o erro xa fai tempo e non o notificaran. O único caso no que as cousas non son urxentes é cando o erro inerentemente non comprometa a seguridade dun xeito severo.

source: The "<literal>anonymous14@globalhackerz.net</literal>" example is not facetious, by the way. You really may get bug reports from identity-cloaked people who, by their words and behavior, never quite clarify whether they're on your side or not. It doesn't matter: if they've reported the security hole to you, they'll feel they've done you a good turn, and you should respond in kind. Thank them for the report, give them a date on or before which you plan to release a public fix, and keep them in the loop. Sometimes they may give <emphasis>you</emphasis> a date&mdash;that is, an implicit threat to publicize the bug on a certain date, whether you're ready or not. This may feel like a bullying power play, but it's more likely a pre&euml;mptive action resulting from past disappointment with unresponsive software producers who didn't take security reports seriously enough. Either way, you can't afford to tick this person off. After all, if the bug is severe, he has knowledge that could cause your users big problems. Treat such reporters well, and hope that they treat you well.
es: Otro informador frecuente de agujeros de seguridad es el profesional de la seguridad, alguien que audita código cómo parte de su trabajo y se mantiene al día con las últimas noticias en las vulnerabilidades de software. Esta gente normalmente tiene experiencia en ambos lados de la vallya&mdash;ellos tanto han recibido como enviado informes, probablemente más que la mayoría los desarrolladores de tu proyecto tengan. Ellos normalmente también te darán una fecha fija para solucionar la vulnerabilidad antes de hacerla pública. Esta fecha puede ser negociable, pero esto dependerá del informador; las fechas fijadas han sido reconocidas entre los profesionales de la seguridad como la única vía fiable para que las organizaciones solucionen los problemas de seguridad puntualmente. Por lo que no trates la fecha fijada como algo grosero; es una larga tradición, y hay buenas razones para ello.
gl: O exemplo "<literal>anonymous14@globalhackerOrco.net</literal>" non é de broma. Na realidade podes obter notificacións de erros enviadas por xente coa identidade encuberta, os cales tanto coas súas palabras como comportamento nunca chegan a deixar claro de todo se están do teu lado ou non. Realmente non importa: se te informaron da vulnerabilidade de seguridade, seguramente pensan que están facendo algo bo por ti, e debes responder en consecuencia. Agradécelles a notificación, dálles unha data estimada na que pensas publicar a solución do problema, e mantenos ao tanto. Algunhas veces son eles quen che dan a ti unha data; isto é, unha ameaza implícita de publicitar o erro en determinada data, esteas ti preparado ou non. Embora poida parecer un xogo de poder, realmente adoita ser unha acción preventiva derivada de anteriores decepcións con produtores irresponsables de software que non toman suficientemente en serio os erros de seguridade. De calquera xeito, non podes permitirte o luxo de non prestarlle atención a esta persoa. Despois de todo, se o erro é severo, el ten un coñecemento que lle podería causar grandes problemas aos teus usuarios. Trata ben estes informadores, e reza para que eles tamén te traten ben a ti.

source: Another frequent reporter of security bugs is the security professional, someone who audits code for a living and keeps up on the latest news of software vulnerabilities. These people usually have experience on both sides of the fence&mdash;they've both received and sent reports, probably more than most developers in your project have. They too will usually give a deadline for fixing a vulnerability before going public. The deadline may be somewhat negotiable, but that's up to the reporter; deadlines have become recognized among security professionals as pretty much the only reliable way to get organizations to address security problems promptly. So don't treat the deadline as rude; it's a time-honored tradition, and there are good reasons for it.
es: Una vez que conozcas la severidad y urgencia, puedes empezar a trabajar en la solución. A veces hay un sacrificio entre hacer una solución elegante y hacerla rápida; por esto, debeis acordar la urgencia antes de empezar. Manten la discusión de la solución restringida únicamente a los miembros de la lista, por supuesto también al informador original (si el quiere estar involucrado) y con cualquier desarrollador que se necesite contactar por razones técnicas.
gl: Outro informador frecuente de erros de seguridade son os profesionais da seguridade, persoas que examinan código profesionalmente, e están ao tanto das últimas novas sobre vulnerabilidades no software. Esta xente adoita ter experiencia nos dous lados do valado&mdash;teñen recibido e enviado informes, probablemente en maior número que a maioría dos desenvolvedores do teu proxecto. Normalmente dánche unha data límite para reparares a vulnerabilidade, antes de facela pública. A data límite adoita ser negociable, mais depende do informador.; as datas límite están consideradas polos profesionais da seguridade como o único xeito fiable para estimular as organizacións a solucionaren os problemas de seguridade con puntualidade. Debido a isto, non consideres que a data límite é unha imposición; é unha tradición honorable, motivada por razóns de peso.

source: Once you know the severity and urgency, you can start working on a fix. There is sometimes a tradeoff between doing a fix elegantly and doing it speedily; this is why you must agree on the urgency before you start. Keep discussion of the fix restricted to the security list members, of course, plus the original reporter (if she wants to be involved) and any developers who need to be brought in for technical reasons.
es: No hagas el commit de la solución en el repositorio. Mantelo en forma de parche hasta la fecha de ir al público. Si fueras a hacer el commit, incluso con un mensaje de log aparentemente inocnete, alguién puede darse cuenta y comprender el cambio. Nunca sabes quién está observando tu repositorio y porque estos pueden estar interesados. Deshabilitar los correos del commit no ayudará; primero de todo, el intervalo en la secuencia del mail del commit resultaría sospechoso, y de cualquier manera, los datos todavía estarían disponibles en el repositorio. Simplmente haz todo el desarrollo en un parche y mantén el parche en algún lugar privado, quizás un repositorio privado y separado que sólo lo conozca la gente que está al tanto del bug. (Si usas un sistema de control de versiones descentralizado tal como Arch o SVK, puedes hacer el trabajo bajo el control de versión completo, y mantener simplemente el repositorio inaccesible a los desconocidos.)
gl: Unha vez que coñezas a severidade e maila urxencia, podes comezar a traballar na solución. A veces xorde un conflito entre fornecer unha solución elegante e fornecela rápido; isto é polo que debes ter ben clara a urxencia antes de comezares. Mantén a discusión restrinxida unicamente aos membros da lista de seguridade e, por suposto, ao informador (se quere participar), incorporando calquera desenvolvedor que for preciso incluír por motivos técnicos.

source: Do not commit the fix to the repository. Keep it in patch form until the go-public date. If you were to commit it, even with an innocent-looking log message, someone might notice and understand the change. You never know who is watching your repository and why they might be interested. Turning off commit emails wouldn't help; first of all, the gap in the commit mail sequence would itself look suspicious, and anyway, the data would still be in the repository. Just do all development in a patch and keep the patch in some private place, perhaps a separate, private repository known only to the people already aware of the bug. (If you use a decentralized version control system like Arch or SVK, you can do the work under full version control, and just keep that repository inaccessible to outsiders.)
es: Números CAN/CVE
gl: Non fagas commit da solución no repositorio. Mantena en formato remendo ata a data da súa publicación. Se fixeres commit da mesma, mesmo engadindo unha mensaxe aparentemente inocente no rexistro de log, alguén podería decatarse e entender a mudanza. Nunca sabes quen está mirando o teu repositorio e os motivos polos que pode estar interesado. Deshabilitar os correos electrónicos de commit tampouco axuda; primeiro de todo o intervalo diferencial na secuencia da lista de commits pode ser sospeitoso por si mesmo, e de todos xeitos, os datos seguirían estando no repositorio. O mellor é facer todo o desenvolvemento nun remendo e manter este remendo nun lugar privado, como un un repositorio separado e privado, coñecido unicamente pola xente que xa está informada sobre o erro. (Se empregares un sistema de control descentralizado como Arch ou SVK, poderás facer o traballo baixo un completo control de versións, e simplemente manter ese repositorio inaccesible para os que deba estalo).

source: CAN/CVE numbers
es: Puedes haber visto un <firstterm>número CAN</firstterm> o un <firstterm>número CVE</firstterm> asociados con problemas de seguridad. Estos números son del tipo "CAN-2004-0397" o "CVE-2002-0092", por ejemplo.
gl: Números CAN/CVE

source: You may have seen a <firstterm>CAN number</firstterm> or a <firstterm>CVE number</firstterm> associated with security problems. These numbers usually look like "CAN-2004-0397" or "CVE-2002-0092", for example.
es: Ambos tipos de números representan el mismo tipo de entidad: una entrada en la lista de "Exposiciones y Vulnerabilidades Comunes" mantenida en <ulink url="http://cve.mitre.org/"></ulink>. El propósito de esta lista es proporcionar nombres estandarizados para todos los problemas de seguridad conocidos, de tal forma que todo el mundo tenga un único, nombre canónico que usar cuando se discuta una, y un sitio central para encontrar más información. La única diferencia entre número "CAN" y número "CVE" es que el primero representa una entrada candidata, pero todavía no aprobada para incluirse en la lista oficial de la junta editorial CVE, y el último representa una entrada aprobada. Sin embargo, ambos tipos de entradas son visibles al público, y un número de entrada no cambia cuando es aprobado&mdash;el prefijo "CAN" es reemplazado simplmente con "CVE".
gl: Pode que teñas visto un <firstterm>número CAN</firstterm> ou un <firstterm>número CVE</firstterm> asociados con problemas de seguridade. Estes números adoitan presentarse do xeito "CAN-2004-0397" ou "CVE-2002-0092", por exemplo.

source: Both kinds of numbers represent the same type of entity: an entry in the list of "Common Vulnerabilities and Exposures" list maintained at <ulink url="http://cve.mitre.org/"></ulink>. The purpose of the list is to provide standardized names for all known security problems, so that everyone has a unique, canonical name to use when discussing one, and a central place to go to find out more information. The only difference between a "CAN" number and a "CVE" number is that the former represents a candidate entry, not yet approved for inclusion in the official list by the CVE Editorial Board, and the latter represents an approved entry. However, both types of entries are visible to the public, and an entry's number does not change when it is approved&mdash;the "CAN" prefix is simply replaced with "CVE".
es: Una entrada CAN/CVE no contiene en sí misma una descripción completa del bug y como protegerse contra el. En lugar de eso, contiene un breve sumario, y una lista de referencias a recursos externos (tal como archivos de listas de correo) donde la gente puede ir para conseguir información más detallada. El propósito real de <ulink url="http://cve.mitre.org/"></ulink> es proporcionar un espacio bien organizado en el cual cada vulnerabilidad pueda tener un nombre y una ruta clara a más datos. Mira <ulink url="http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092"></ulink> cómo un ejemplo de una entrada. Observa que las referencias pueden ser muy secas, con fuentes apareciendo como abreviaciones crípticas. Note that the references can be very terse, with sources appearing as cryptic abbreviations. Una clave a estas abreviaciones está en <ulink url="http://cve.mitre.org/cve/refs/refkey.html"></ulink>.
gl: Ambos tipos de números representan o mesmo tipo de entidade: unha entrada na lista de "Exposicións e Vulnerabilidades Comúns", lista mantida en <ulink url="http://cve.mitre.org/"></ulink>. O propósito da lista é fornecer nomes estándar para todos os problemas de seguridade, de tal xeito que cada un teña un número único e canónico que se poida empregar cando se discutir sobre o mesmo, así como un lugar centralizado a onde ir para atopar máis información. A única diferencia entre un número "CAN" e un número "CVE" está en que o primeiro representa unha entrada candidata, aínda non aprobada para a súa inclusión na lista oficial pola Xunta Editorial CVE, mentres que a segunda representa unha entrada efectivamente aprobada. Aínda así, ambos tipos de entradas son visibles para o público, e o número dunha entrada non muda cando a mesma é aprobada&mdash;o prefixo "CAN" simplemente substitúese por "CVE".

source: A CAN/CVE entry does not itself contain a full description of the bug and how to protect against it. Instead, it contains a brief summary, and a list of references to external resources (such as mailing list archives) where people can go to get more detailed information. The real purpose of <ulink url="http://cve.mitre.org/"></ulink> is to provide a well-organized space in which every vulnerability can have a name and a clear route to more data. See <ulink url="http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092"></ulink> for an example of an entry. Note that the references can be very terse, with sources appearing as cryptic abbreviations. A key to those abbreviations is at <ulink url="http://cve.mitre.org/data/refs/refkey.html"></ulink>.
es: Si tu vulnerabilidad cumple los criterios de CVE, puedes adquirir un número CAN. El proceso para hacer esto es deliberadamente por ingreso: básicamente tienes que conocer a alguien, o conocer a alguien que conozca a alguien. Esto no es tan disparatado como pueda sonar. Con el fin de evitar que la Junta Editorial de CVE este abrumada con falsos o envíos pobremente escritos, reciben los envíos sólo de fuentes de las que ya confían. Con el fin de conseguir listar tu vulnerabilidad , por lo tanto, necesitas encontrar un camino de conocimiento de tu proyecto al Consejo Editorial de CVE. Pregunta entre tus desarrolladores; alguno de ellos probablemente conocerá a alguien que haya realizado previamente el proceso de CAN, o conoce a alguien que lo ha hecho, etc. La ventaja de hacerlo de esta manera es tambien que en algún lugar a través de la cadena, alguien puede saber lo suficiente para decirte que a) no contará como una vulnerabilidad o exposición de acuerdo a los criterios de MITRE, por lo que no es necesario enviarlo, o b) la vulnerabilidad ya <emphasis>tiene</emphasis> un número CAN o. Lo último puede ocurrir si el bug ya ha sido publicado en otra lista de avisos de seguridad, por ejemplo en <ulink url="http://www.cert.org/"></ulink> o en la lista de correo BugTraq en <ulink url="http://www.securityfocus.com/"></ulink>. (Si esto ha ocurrido y tu proyecto no se ha enterado, entonces deberías preocuparte por quien más puede saber algo que todavía no sabes.)
gl: Unha entrada CAN/VCE non contén en si mesma unha descrición completa do erro e o xeito de protexerse del. En lugar diso, contén un breve resumo, e máis unha lista de ligazóns a recursos externos (como arquivos de listas de correo) onde a xente pode obter información máis detallada. O propósito verdadeiro de <ulink url="http://cve.mitre.org/"></ulink> pasa por fornecer un espazo ben organizado no que cada vulnerabilidade poida obter un nome e unha ruta clara para máis información. Bótalle unha ollada a <ulink url="http://cve.mitre.org/cgi-bin/cvename.cgi?name=2002-0092"></ulink> para veres un exemplo dunha entrada. Ten en conta que as ligazóns poden ser moi concisas, con fontes expostas como abreviaturas cifradas. A chave para interpretar estas abreviaturas atópase en <ulink url="http://cve.mitre.org/data/refs/refkey.html"></ulink>.
