Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: Remember that although the other person may be the one behaving destructively, <emphasis>you</emphasis> will be the one who appears destructive if you make a public charge that you can't back up. Be sure to have plenty of examples to demonstrate what you're saying, and say it as gently as possible while still being direct. You may not persuade the person in question, but that's okay as long as you persuade everyone else.
es: Estudio del caso
gl: Recorda que aínda que a outra persoa sexa a que ten un comportamento destructivo es <emphasis>ti</emphasis> o que parecerá destructivo se fas de maneira pública unha acusación que non podes soster. Asegúrate de ter multitude de exemplos para demostrar o que dis, e fala do modo máis xentil posible, sen deixar de ser directo. Pode que non convenzas á persoa en cuestión, pero iso non supón un gran problema mentres convenzas aos demáis.

source: Case study
es: Recuerdo sólo una situación, en más de 10 años trabajando en Software Libre, donde las cosas fueron tan mal, que nosotros tuvimos que preguntar a alguien para que parase de postear completamente. Como era tan a menudo el caso, el no era maleducado y quería sinceramente ser de utilidad. Simplemente no sabía cuando escribir a la lista y cuando no hacerlo. Nuestras listas estaban abiertas al público, y él escribía muy a menudo, preguntando cuestiones de diferentes temas, que empezó a ser un problema de ruido para la comunidad. Nosotros habíamos intentado preguntarle de buenas maneras para que hiciera un poco más de investigación para las respuestas antes de escribir a la lista, pero no hizo efecto.
gl: Caso de estudo

source: I remember only one situation, in more than 10 years of working in free software, where things got so bad that we actually had to ask someone to stop posting altogether. As is so often the case, he was not rude, and sincerely wanted only to be helpful. He just didn't know when to post and when not to post. Our lists were open to the public, and he was posting so often, and asking questions on so many different topics, that it was getting to be a noise problem for the community. We'd already tried asking him nicely to do a little more research for answers before posting, but that had no effect.
es: La estrategia que al final funcionó es un ejemplo perfecto de como construir una situación neutral, y con datos cuantitativos. Uno de los cuatro desarrolladores hizo una exploración en los archivos, y envío entonces el siguiente mensaje de manera privada a unos pocos desarrolladores. El ofendido (el tercer nombre en la lista de abajo, se muestra aquí como "J. Random") tenía muy poca historia con el proyecto, y no había contribuido ni con código ni documentación. Y aún así era el tercero más activo en escribir mensajes en la lista de correo:
gl: Só recordo un caso, en máis de 10 anos de traballo con software libre, no que as cousas estaban tan mal que tivemos que pedirlle a alguén que parara totalmente de postear. Como adoita ocorrer, non era maleducado, e a verdade é que simplemente quería axudar. O que pasaba era que non sabía cando postear e cando non. As nosas listas estaban abertas públicamente, e posteaba con tanta frecuencia, preguntando sobre temas moi diferentes, que comezaba a ser unha amoladura para a comunidade. Comentámoslle que investigara un pouco máis esas respostas antes de postear, pero non serviu de nada.

source: The strategy that finally worked is a perfect example of how to build a strong case on neutral, quantitative data. One of our developers did some digging in the archives, and then sent the following message privately to a few developers. The offender (the third name on the list below, shown here as "J. Random") had very little history with the project, and had contributed no code or documentation. Yet he was the third most active poster on the mailing lists:
gl: A estratexia que finalmente funcionou é un exemplo perfecto sobre como elaborar un caso sobre datos cuantitativos e neutrais. Un dos nosos desenvolvedores rebuscou nos arquivos e enviou o seguinte mensaxe privado a uns pocos desenvolvedores. A persoa problemática (o terceiro nome na lista inferior, indicado aquí como "X. Aleatorio") levaba pouco tempo no proxecto, e non tiña contribuido nin con código nin con documentación. A pesar diso, era o terceiro membro máis activo nas listas de correo:

source: From: "Brian W. Fitzpatrick" &lt;fitz@collab.net&gt; To: [... recipient list omitted for anonymity ...] Subject: The Subversion Energy Sink Date: Wed, 12 Nov 2003 23:37:47 -0600 In the last 25 days, the top 6 posters to the svn [dev|users] list have been: 294 kfogel@collab.net 236 "C. Michael Pilato" &lt;cmpilato@collab.net&gt; 220 "J. Random" &lt;jrandom@problematic-poster.com&gt; 176 Branko &Ccaron;ibej &lt;brane@xbc.nu&gt; 130 Philip Martin &lt;philip@codematters.co.uk&gt; 126 Ben Collins-Sussman &lt;sussman@collab.net&gt; I would say that five of these people are contributing to Subversion hitting 1.0 in the near future. I would also say that one of these people is consistently drawing time and energy from the other 5, not to mention the list as a whole, thus (albeit unintentionally) slowing the development of Subversion. I did not do a threaded analysis, but vgrepping my Subversion mail spool tells me that every mail from this person is responded to at least once by at least 2 of the other 5 people on the above list. I think some sort of radical intervention is necessary here, even if we do scare the aforementioned person away. Niceties and kindness have already proven to have no effect. dev@subversion is a mailing list to facilitate development of a version control system, not a group therapy session. -Fitz, attempting to wade through three days of svn mail that he let pile up
es: Aunque no pueda parecerlo al principio, el comportamiento de J. Random's era un clásico de abuso de los procedimientos del proyecto. El no estaba haciendo nada obvio más que intentando obstruccionar en los votos, y estaba aprovechándose de la ventaja de la política de la lista de correo de depender en la propia moderación de sus miembros. Dejamos al juicio de cada individuo en lo que escribe y sobre que materias. De esta manera, no teníamos recursos de procedimiento para tratar con aquellos que no tenían buen juicio, o que no lo practicaban. No había ninguna regla que pudieras apuntar e indicar que se estaba violando, aunque todo el mundo ya sabía que sus frecuentes correos se estaban convirtiendo en un problema serio.
gl: De: "Brian W. Fitzpatrick" &lt;fitz@collab.net&gt; A: [... lista de receptores omitida por anonimato ...] Asunto: O sumidoiro de enerxía de subversion Data: Mércores, 12 Nov 2003 23:37:47 -0600 Nos últimos 25 días, os 6 membros máis activos na lista svn [dev|users] foron: 294 kfogel@collab.net 236 "C. Michael Pilato" &lt;cmpilato@collab.net&gt; 220 "X. Aleatorio" &lt;xaleatorio@posteador-problematico.com&gt; 176 Branko &Ccaron;ibej &lt;brane@xbc.nu&gt; 130 Philip Martin &lt;philip@codematters.co.uk&gt; 126 Ben Collins-Sussman &lt;sussman@collab.net&gt; Eu diría que 5 desas persoas están contribuindo a que saía Subversion 1.0 nun futuro próximo. Tamén diría que unha desas persoas está constantemente roubando tempo e enerxía dos outros 5, sen mencionar toda a lista, e polo tanto (aínda que de maneira non intencionada) freando o desenvolvemento de Subversion. Non fixen un análisis dos fíos, pero un vgrep da mila bandexa de correo de Subversion mostra que tódolos correos desta persoa foron respondidos polo menos una vez por polo menos dúas das cinco persoas citadas enriba. Penso que algún tipo de intervención radical é necesaria neste caso, incluso se escorrentamos á mentada persoa fora do proxecto. A amabilidadee as suxerencias xa mostraron que non teñen efecto. dev@subversion é unha lista de correo para facilitar o desenvolvemento dun sistema de control de versións, non para facer sesións de terapia de grupo. -Fitz, tentando ler tres días de correo de svn amontoado

source: Though it might not seem so at first, J. Random's behavior was a classic case of abusing project procedures. He wasn't doing something obvious like trying to filibuster a vote, but he was taking advantage of the mailing list's policy of relying on self-moderation by its members. We left it to each individual's judgement when to post and on what topics. Thus, we had no procedural recourse for dealing with someone who either did not have, or would not exercise, such judgement. There was no rule one could point to and say the fellow was violating it, yet everyone knew that his frequent posting was getting to be a serious problem.
es: La estrategia de Fitz era retrospectivamente maestra. El recopilo una cantidad de evidencia irrefutable, y entonces la distribuyo discretamente, enviándola primero a unas pocas personas cuyo soporte sería clave en una acción drástica. Ellos estuvieron de acuerdo en que era necesaria algún tipo de acción, y al final llamamos a J. Random por teléfono, le describimos el problema directamente, y le preguntamos para que simplemente parase de escribir correos a la lista. El nunca comprendio realmente las razones de ello; si hubiera sido capaza de comprenderlo, probablemente hubiera ejercido un juicio apropiado en primer lugar. Pero el acordó en parar de escribir correos, y la lista de correo se convirtio en útil de nuevo. Una de las razones por las que esta estrategia funcionó fue quizás, la amenaza implícita con la que hubieramos empezado a restringir sus posts vía el software de moderación que normalmente se utiliza para prevenir el spam (consulta <xref linkend="spam-prevention"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>). Pero la razón por la que fuimos capaces de aquella opción en reserva fue que Fitz había recopilado el apoyo necesario de la gente clave en primer lugar.
gl: Pode que non o pareza ao principio, pero o comportamento de X. Aleatorio era un caso clásico de abuso dos procedementos dun proxecto. Non facía cousas evidentes como tentar obstruir unha votación, pero estaba sacando proveito das políticas das listas de correo de ser moderadas polos seus propios membros. Deixamos a xuízo de cada un o momento de postear e sobre que temas. Ademáis, non tiñamos procedementos para tratar con alguén que non tivera ou non fixera uso dese xuízo. Non había regras que alguén puidera sinalar que dicir que outro as estaba violando, aínda que todos sabiamos que os seus mensaxes frecuentes comezaban a ser un problema serio.

source: Fitz's strategy was, in retrospect, masterful. He gathered damning quantitative evidence, but then distributed it discreetly, sending it first to a few people whose support would be key in any drastic action. They agreed that some sort of action was necessary, and in the end we called J. Random on the phone, described the problem to him directly, and asked him to simply stop posting. He never really did understand the reasons why; if he had been capable of understanding, he probably would have exercised appropriate judgement in the first place. But he agreed to stop posting, and the mailing lists became useable again. Part of the reason this strategy worked was, perhaps, the implicit threat that we could start restricting his posts via the moderation software normally used for preventing spam (see <xref linkend="spam-prevention"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>). But the reason we were able to have that option in reserve was that Fitz had gathered the necessary support from key people first.
es: Manejando el crecimiento
gl: Retrospectivamente, a estratexía de Fitz foi autoritaria. Recopilou claras evidencias cuantitativas, pero decidiu distribuilas de maneira discreta, mandándoas primeiro a aquelas persoas cuxo apoio sería clave nunha medida drástica. Aceptaron tomar ese tipo de decisión se era necesario, e ao final chamamos a X. Aleatorio ao teléfono, describímoslle o problema directamente e pedímoslle que simplemente cesara de postear. Realmente nunca comprendeu os motivos; se fora capaz de comprendelo, probablemente tivera feito uso dun xuízo apropiado en primeiro lugar. Pero aceptou parar de postear, e as listas de correo volveron a poderse usar de novo. Parte do éxito desta estratexia foi, quizáis, a ameaza implícita de restrinxir os seus mensaxes mediante o software de moderación normalmente empregado para previr o spam (ver <xref linkend="spam-prevention"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>). Pero o motivo de que tivéramos dita opción de reserva foi que Fitz conseguiu xa ao principio o apoio necesario de xente clave no proxecto.

source: Handling Growth
es: El precio del éxito es muy pesado en el mundo del Open Source. Conforme tu software se hace más popular, el número de gente que empieza a buscar información sobre él, se incrementa dramaticamente, mientras el número de gente capaza de proporcionar información se incrementa mucho más despacio. Además, incluso si el ratio fuera uniformemente balanceado, todavía existiría un problema de escalabilidad en la forma en que la mayoría de los proyectos Open source manejan las comunicaciones. Considera por ejemplo las listas de correo. La mayoría de los proyectos tienen una lista de correo para cuestiones generales de los usuarios; a veces los nombres de estas listas son "usuarios", "discusiones", o "ayuda" o algo similar. Cualquiera que sea su nombre, el propósito de esas listas es el mismo: proporcionar un lugar donde la gente pueda resolver sus cuestiones, mientras otros observan y (presumiblemente) absorben conocimiento de la observación de ese intercambio de conocimiento.
gl: Xestionando o crecemento

source: The price of success is heavy in the open source world. As your software gets more popular, the number of people who show up looking for information increases dramatically, while the number of people able to provide information increases much more slowly. Furthermore, even if the ratio were evenly balanced, there is still a fundamental scalability problem with the way most open source projects handle communications. Consider mailing lists, for example. Most projects have a mailing list for general user questions&mdash;sometimes the list's name is "users", "discuss", "help", or something else. Whatever its name, the purpose of the list is always the same: to provide a place where people can get their questions answered, while others watch and (presumably) absorb knowledge from observing these exchanges.
es: Estas listas de correo funcionan muy bien hasta unos pocos miles de usuarios y/o un par de cientos de posts al día. Pero más o menos, a partir de ahí el sistema empieza a romperse, porque cada suscriptor vee cada post; si el número de post a la lista empieza a exceder lo que cualquier lector individual puede procesar en un día, la lista se convierte en una carga para sus miembros. Imagina por ejemplo, si Microsoft tuviera tal lista de correo para Windows XP. Windows XP tiene cientos de millones de usuarios; aún incluso si el uno por ciento de ellos tuviera cuestiones en un periodo de veinticuatro horas, entonces esta lista hipotética cientos de miles de posts al día! Por supuesto, tal lista de correo no podría existir, porque nadie permanecería subscrito. Este problema no esta limitado a las listas de correo; la misma lógica se aplica a los canales del IRC, los foros de discusión online y por ende, a cualquier sistema en el cual un grupo escuche preguntas de individuos. Las implicaciones son siniestras: el modelo usual del Open Source del soporte masivamente paralelizado simplemente no escala los niveles necesarios para la dominación mundial.
gl: O prezo do éxito é forte no mundo do software libre. A medida que o teu software se fai máis popular, o número de persoas que xorden buscando información sobre o mesmo medra drasticamente, mentres que o número de persoas capacitadas para fornecer esa información aumenta moito máis lentamente. Máis aínda, mesmo se a relación estivese equilibrada, seguiría habendo un problema fundamental de escalabilidade no xeito no que os proxectos de software libre xestionan as comunicacións. Considera as listas de correo, por exemplo. A maioría dos proxectos teñen unha lista de correo para cuestións xerais dos usuarios&mdash;ás veces nomeada "users","discuss","help" ou algo así. Calquera que for o seu nome, o propósito da lista sempre é o mesmo: fornecer un lugar onde a xente poida ver resoltas as súas preguntas, mentres outros miran e (presumiblemente) absorben coñecemento mediante a observación destes trocos de información.

source: These mailing lists work very well up to a few thousand users and/or a couple of hundred posts a day. But somewhere after that, the system starts to break down, because every subscriber sees every post; if the number of posts to the list begins to exceed what any individual reader can process in a day, the list becomes a burden to its members. Imagine, for instance, if Microsoft had such a mailing list for Windows XP. Windows XP has hundreds of millions of users; if even one-tenth of one percent of them had questions in a given twenty-four hour period, then this hypothetical list would get hundreds of thousands of posts per day! Such a list could never exist, of course, because no one would stay subscribed to it. This problem is not limited to mailing lists; the same logic applies to IRC channels, online discussion forums, indeed to any system in which a group hears questions from individuals. The implications are ominous: the usual open source model of massively parallelized support simply does not scale to the levels needed for world domination.
es: No habrá una explosión cuando los foros alcancen su punto de ruptura. Se trata simplemente de un efecto silencioso de feedback negativo: la gente se borrará de las listas, o saldrán de los canales del IRC, o a cualquier ritmo cesaran de preocuparse en preguntar cuestiones, porque verán que no se les escuchará entre tanta gente. Así cuanta más gente haga de estas su principal elección racional, la actividad de los foros empezará a permanecer a un nivel inmanejable precisamente porque la gente racional o (al menos experimentada), empezará a buscar información por otros medios, mientras la gente sin experiencia permanecerá y continuará preguntando en foros y listas de correo. En otras palabras, uno de los efectos de continuar con el uso de modelos de comunicación que no son escalables mientras que el proyecto crece es que la calidad media tanto de preguntas y respuestas tiene a disminuir, lo cual hace que los nuevos usuarios parezcan más tontos de lo que son, cuando de hecho probablemente no lo sean. Se trata simplemente de que el ratio beneficio/costo de el uso de esos foros masificados, disminuye, por lo que de manera natural, aquellos con experiencia, empezarán a buscar respuestas en otros sitios. Ajustar los mecanismos de comunicación para poder con el crecimiento del proyecto, implicará dos estrategias relacionadas:
gl: Estas listas de correo funcionan moi ben ata un poucos centos de usuarios e/ou un par de centos de mensaxes ao día. Mais para alén destes límites, o sistema comeza a fracturarse, dado que cada subscritor ve cada mensaxe; se o número de mensaxes á lista comeza a exceder o límite que cada lector individual pode procesar nun día, a lista convértese nun peso morto para os seus membros. Imaxina, por exemplo, que Microsoft tivese unha lista deste xeito para Windows XP. Windows XP ten centos de millóns de usuarios; mesmo se un por cento deles tiver preguntas dun período dado de 24 horas, entón esta hipotética lista tería centos de miles de mensaxes cada día! Unha lista deste estilo nunca podería existir, por suposto, dado que ninguén estaría subscrito á mesma. Este problema non se limita ás listas de correo; a mesma lóxica exacta é válida para os canais IRC, os foros de discusión en liña, e por derivación para calquera sistema no cal un grupo escoite preguntas provenientes de persoas individuais. As implicacións son desafortunadas: o modelo de software libre habitual baseado nun soporte masivamente paralelizado simplemente non escala para os niveis precisos para a dominación mundial (ou cando menos da Terra Media, ou da Illa de Perdidos).

source: There will be no explosion when forums reach the breaking point. There is just a quiet negative feedback effect: people unsubscribe from the lists, or leave the IRC channel, or at any rate stop bothering to ask questions, because they can see they won't be heard in all the noise. As more and more people make this highly rational choice, the forum's activity will seem to stay at a manageable level. But it is staying manageable precisely because the rational (or at least experienced) people have started looking elsewhere for information&mdash;while the inexperienced people stay behind and continue posting. In other words, one side effect of continuing to use unscalable communications models as the project grows is that the average quality of both questions and answers tends to go down, which makes it look like new users are dumber than they used to be, when in fact they're probably not. It's just that the benefit/cost ratio of using those high-population forums goes down, so naturally those with the experience to do so start to look elsewhere for answers first. Adjusting communications mechanisms to cope with project growth therefore involves two related strategies:
es: Reconociendo cuando partes especiales de un foro <emphasis>no</emphasis> sufren un crecimiento desmesurado, incluso si el foro se trata como un todo, y separando aquellas partes creando otras nuevas, en foros más especializados (ejem., no dejes que los buenos se arrastren por los malos).
gl: Obviamente non vai haber ningunha explosión cando os foros atinxiren o punto de fractura. Simplemente vai haber un silencioso efecto de retroalimentación negativa: xente que abandona as listas de correo, ou deixa os canais IRC, ou co ritmo que for deixan de se preocupar de faceren preguntas, dado que verán que non van ser escoitados no medio de todo ese barullo. A medida que máis e máis xente tome esta altamente racional decisión, vai parecer que a actividade do foro retorna a un nivel manexable. Mais será manexable precisamente porque a xente racional (ou cando menos experimentada) comezou a buscar información en calquera outro lugar&mdash;mentres que a xente sen experiencia segue aí e continúa enviando mensaxes. Noutras palabras, un efecto colateral de continuar empregando modelos de comunicacións non escalables cando o proxecto medra é que a calidade media tanto das preguntas como das respostas tende a reducirse, o que provoca que pareza que os novos usuarios son máis parvos do que o eran antes, cando de feito probablemente non o sexan. Trátase simplemente de que a relación beneficio/custo de empregar estes foros tan superpoboados diminúe, polo que naturalmente os usuarios experimentados comezarán a buscar respostas en primeira instancia noutros sitios. Axustar os mecanismos de comunicación para asimilar o crecemento do proxecto envolve dúas estratexias relacionadas:

source: Recognizing when particular parts of a forum are <emphasis>not</emphasis> suffering unbounded growth, even if the forum as a whole is, and separating those parts off into new, more specialized forums (i.e., don't let the good be dragged down by the bad).
es: Asegurando que existen muchas fuentes de información automáticas disponibles, y que se mantienen organizadas, actualizadas y fáciles de localizar.
gl: Recoñecer cando partes concretas dun foro <emphasis>non</emphasis> están a sufrir dun crecemento excesivo, embora o foro en conxunto si que o estea a sufrir; e separar estas partes en foros novos e especializados (por exemplo, non deixes que paguen xustos por pecadores).
