Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: In any mailing list discussion, it's easy for a small minority to give the impression that there is a great deal of dissent, by flooding the list with numerous lengthy emails. It's a bit like a filibuster, except that the illusion of widespread dissent is even more powerful, because it's divided across an arbitrary number of discrete posts and most people won't bother to keep track of who said what, when. They'll just have an instinctive impression that the topic is very controversial, and wait for the fuss to die down.
es: La mejor manera de contrarrestar este efecto es indicarlo muy claramente y proporcionar pistas respaldadas mostrando cómo de pequeño es el número actual de disidentes comparado a los que están en acuerdo. Para incrementar la disparidad, puedes querer encuestar de manera privada a la gente que ha estado la mayor parte del tiempo en silencio, pero que sospechas que estarán de acuerdo con la mayoría. been mostly silent, but who you suspect would agree with the majority. No digas nada que sugiera que los disidentes estaban intentando deliberadamente inflar la impresión que estaban creando. Oportunidades que no tuvieron, e incluso si las tuvieron no había una ventaja estratégica para señalarla. Todo lo que necesitas es mostrar el número actual en una comparación cara-a-cara, y la gente se dara cuenta que su intuición de la situación no coincidía con la realidad.
gl: En calquera discusión nunha lista de correo, resúltalle sinxelo a unha minoría dar a impresión de que existe un gran acordo na disensión, mediante inundación da lista con numerosos e longos emails. Isto semella filibusterismo, excepto que a ilusión da difusión da disensión é mesmo máis poderosa, dado que está dividida entre un número arbitrario de mensaxes concretas e moita xente non se vai molestar en trazar quen dixo que, nin cando. Simplemente van ter a impresión instintiva de que o tema é moi controvertido, e van agardar ata que o escándalo diminúa.

source: The best way to counteract this effect is to point it out very clearly and provide supporting evidence showing how small the actual number of dissenters is, compared to those in agreement. In order to increase the disparity, you may want to privately poll people who have been mostly silent, but who you suspect would agree with the majority. Don't say anything that suggests the dissenters were deliberately trying to inflate the impression they were making. Chances are they weren't, and even if they were, there would be no strategic advantage to pointing it out. All you need do is show the actual numbers in a side-by-side comparison, and people will realize that their intuition of the situation does not match reality.
es: Este consejo no sólo se aplica a temas con una clara posición a-favor-en-contra. Se aplica a cualquier discusión donde hay un alboroto, pero no esta claro que la mayoría de la gente considere ese tema bajo discusión que sea un problema real. Despues de todo, si estas de acuerdo en que el tema no es digno de acción, y puedes ver que ha fallado en atraer la atención (incluso si ha generado muchos mails), puedes observar públicamente que no está teniendo tracción. Si el efecto "ruido minoritario" ha funcionado, tu post parecerá un soplo de aire fresco. La mayoría de la impresión de la gente de la discusión se dará cuenta de que ese punto habrá sido algo turbio: Huh, seguro que sienten como que hay un gran acuerdo aqui, porque seguramente hay un montón de posts, pero no puedo ver que esté habiendo ningún progreso claro." Explicando como la manera en que la discusión se hizo parezca más turbulenta de lo que realmente es, tú retrospectivamente le darás una nueva forma, a través de la cual la gente pueda recapitular su comprensión del resultado.
gl: O mellor xeito de contraatacar este efecto é dando conta dun xeito ben claro, e aportando probas, de que o número real de disensións, comparado cos acordos, é moi pequeno. Perseguindo o incremento da disparidade, poderías querer enquisar privadamente a xente que se ten mostrado silenciosa, mais que sospeitas que estarían de acordo coa maioría. Non digas nada que suxira que os desconformes están tentando inflar deliberadamente a impresión que están forxando. O único que precisas é mostrares os números reais nunha comparación un-a-un, e só con iso a xente xa se vai decatar de que a intuición que tiñan sobre a situación non encaixa coa realidade.

source: This advice doesn't just apply to issues with clear for-and-against positions. It applies to any discussion where a fuss is being made, but it's not clear that most people consider the issue under discussion to be a real problem. After a while, if you agree that the issue is not worthy of action, and can see that it has failed to get much traction (even if it has generated a lot of mails), you can just observe publicly that it's not getting traction. If the "Noisy Minority" effect has been at work, your post will seem like a breath of fresh air. Most people's impression of the discussion up to that point will have been somewhat murky: "Huh, it sure feels like there's some big deal here, because there sure are a lot of posts, but I can't see any clear progress happening." By explaining how the form of the discussion made it appear more turbulent than it really was, you retrospectively give it a new shape, through which people can recast their understanding of what transpired.
es: Gente difícil
gl: Este consello no só se aplica a temas cunha clara posición a favor ou en contra. Aplícase a calquera discusión onde houber un alboroto, mais non estiver claro que a maioría da xente considera ese tema en discusión como un problema real. Despois de todo, se estiveres de acordo en que o tema non é digno de acción, e podes ver o que fallou en atraer a atención (embora xerase moitos correos), podes facer pública esta observación. Se o efecto "minoría ruidosa" funcionou, a túa mensaxe vai parecer un sopro de aire fresco. A impresión da maioría da xente ata ese momento pode ser algo porquiña: "Uh, seguro que senten como se houber un gran acordo aquí, porque seguramente hai unha morea de mensaxes, mais non podo ver que haxa ningún progreso claro." Explicar o ciclo de vida da discusión pode facer que pareza máis turbulenta do que realmente é, polo que ti retrospectivamente debes darlle unha nova forma, a través da cal a xente poida recapitular a súa comprensión do resultado.

source: Difficult People
es: No es tan fácil tratar con gente díficl en foros electrónicos como lo sería en persona. Con "díficil" no me refiero a "maleducados". La gente maleducada es molesta, pero no son necesariamente díficiles. En este libro ya se ha discutido como manejarlos:comenta la grsoería la primera vez, y desde entonces ignórales o tratalos como otro cualquiera. Si continuan siendo maleducados, ellos mismos se haran tan impopulares que no tendrán influencia en nadie del proyecto, por lo que serán un problema de ellos mismos.
gl: Xente problemática

source: Difficult people are no easier to deal with in electronic forums than they are in person. By "difficult" I don't mean "rude". Rude people are annoying, but they're not necessarily difficult. This book has already discussed how to handle them: comment on the rudeness the first time, and from then on, either ignore them or treat them the same as anyone else. If they continue being rude, they will usually make themselves so unpopular as to have no influence on others in the project, so they are a self-containing problem.
es: Los casos realmente difíciles son la gente que no son manifiestamente groseros, pero que manipulan o abusan en los procesos del proyecto de una manera que termina costando el tiempo y la energía de otras personas, y todo ello sin traer ningún beneficio al proyecto. Tales personas a menudo buscan puntos de presión en los procedimientos del proyecto, para darse a sí mismos más influencia que de otra manera no tendrían. Esto es mucho más insidioso que la grosería meramente, porque ni el comportamiento ni el daño que causa es aparente a los observadores casuales. Un ejemplo clásico es aquellos que realizan maniobras obstruccionistas, en la que alguien (siempre sonando tan razonable como sea posible, por supuesto) viene demandando que la cuestión bajo discusión no esta lista para una solución, y ofrece más y más posibles soluciones, o nuevos puntos de vista de viejas soluciones, cuando lo que realmente está pasando es que el sentido de un consenso o votación está a punto de ocurrir, y no le gusta por donde va encaminado. Otro ejemplo es cuando hay un debate que no converge en consenso, pero el grupo al menos intenta clarificar los puntos en desacuerdo y produce un sumario para que todo el mundo se refiera a partir de el. El obstruccionista, que sabe que el sumario puede llevar a un punto que a el no le va a gustar, a menudo intentará retrasar el sumario, implacablemente mediante complicadas cuestiones que deberían estar ahí, u objetando sugerencias razonables, o mediante la introducción de nuevos asuntos.
gl: Os foros electrónicos non fan máis fácil tratar coa xente problemática ca en persoa. Por xente "problemática" non me refiro a "groseira". As persoas groseiras son molestas, pero non necesariamente problemáticas. Neste libro xa discutimos como tratar con elas: comentar as súas saídas de tono a primeira vez, e a partir de entón, ou ben ignoralos ou tratalos como a calquera outra persoa. Se continúan sendo maleducados, co tempo serán tan impopulares que non terán influencia algunha nos demáis membros do proxecto, polo que realmente rematarán sendo un problema con auto-contención.

source: The really difficult cases are people who are not overtly rude, but who manipulate or abuse the project's processes in a way that ends up costing other people time and energy, yet do not bring any benefit to the project. Such people often look for wedgepoints in the project's procedures, to give themselves more influence than they might otherwise have. This is much more insidious than mere rudeness, because neither the behavior nor the damage it causes is apparent to casual observers. A classic example is the filibuster, in which someone (always sounding as reasonable as possible, of course) keeps claiming that the matter under discussion is not ready for resolution, and offers more and more possible solutions, or new viewpoints on old solutions, when what is really going on is that he senses that a consensus or a ballot is about to form, and doesn't like where it is probably headed. Another example is when there's a debate that won't converge on consensus, but the group tries to at least clarify the points of disagreement and produce a summary for everyone to refer to from then on. The obstructionist, who knows the summary may lead to a result he doesn't like, will often try to delay even the summary, by relentlessly complicating the question of what should be in it, either by objecting to reasonable suggestions or by introducing unexpected new items.
es: Tratando con gente difícil
gl: Os casos realmente problemáticos son os de xente que non é abertamente groseira, pero que manipula ou abusa dos procedementos do proxecto de modo que lle custa a outra xente tempo e esforzo, sen proporcionar beneficio algún ao proxecto. Estas persoas habitualmente buscan físgoas nos procedementos do proxecto para ter máis influencia da que normalmente terían. Isto é claramente máis insidioso que simplemente groseiro, porque nin o comportamente nin o dano causado son aparentes para observadores casuais. Un exemplo clásico é o filibusteiro, no cal alguén (sempre nun suposto razoable, claro está) mantén que un tema baixo discusión non se pode dar por pechado, e ofrece máis e máis posibles solucións, ou novos puntos de vista en solucións antigas, mentres que o que realmente persegue e que non se chegue a un consenso ou votación que non lle beneficia. Outro exemplo é cando hai un debate que non chegará a un consenso, pero o grupo tenta polo menos aclarar os puntos de desacordo e crear un sumario para que calqueira poda consultar dende entón. O obstrucionista, que sabe que o sumario levará a un resultado que non desexa, tentará habitualmente de retrasar a súa creación, complicando continuamente a cuestión sobre que debería conter, ben obxectando de maneira razoable ou introducindo elementos novos inesperados.

source: Handling Difficult People
es: Para contrarrestar tal comportamiento, ayuda el comprender la mentalidad de aquellos que caen en él. La gente generalmente no lo hara conscientemente. Nadie se levanta por la mañana y se dice a sí mismo: "Hoy voy a manipular cínicamente las formas y procedimientos para ser así un irritante obstruccionista." En cambio, tales acciones están a menudo precedidas por un sentimiento de semi-paranoia de estar fuera de las interacciones y decisiones del grupo. La persona piensa que no se le toma seriamente, o (en casos más severos), que existe una conspiración contra él;y que los otros miembros del proyecto han decidido formar un club exclusivo, del cual el no es miembro. Esto entonces justifica en su mente, a tomar las reglas literalmente y encargándose de una manipulación formal de los procedimientos del proyecto, para así <emphasis> hacer </emphasis> que todo el mundo le tome en serio. En casos extremos, la persona puede incluso pensar que está luchando una batalla solo para salvar el proyecto de sí mismo.
gl: Tratando con xente problemática

source: To counteract such behavior, it helps to understand the mentality of those who engage in it. People generally do not do it consciously. No one wakes up in the morning and says to himself: "Today I'm going to cynically manipulate procedural forms in order to be an irritating obstructionist." Instead, such actions are often preceded by a semi-paranoid feeling of being shut out of group interactions and decisions. The person feels he is not being taken seriously, or (in the more severe cases) that there is almost a conspiracy against him&mdash;that the other project members have decided to form an exclusive club, of which he is not a member. This then justifies, in his mind, taking rules literally and engaging in a formal manipulation of the project's procedures, in order to <emphasis>make</emphasis> everyone else take him seriously. In extreme cases, the person can even believe that he is fighting a lonely battle to save the project from itself.
es: Es la naturaleza del propio ataque la que hara que nadie se percate de él al mismo tiempo, y mucha gente no lo notará, a menos que se presente con evidencias muy fuertes. Esto significa que neutralizarlo puede llevar algo de trabajo. No basta con persuadirse a sí mismo de que está ocurriendo; tendrás que organizar muy bien las evidencias para persuadir a los demás de lo que está ocurriendo, y entonces tendrás que distribuir estas evidencias de una manera atenta.
gl: Para contrarrestar devandito comportamento, axuda coñece-la mentalidade de aqueles que o presentan. A xente normalmente non o fai de maneira consciente. Ninguén se esperta unha mañá dicindo "Hoxe vou manipular de maneira cínica os procedementos formais para converterme nun obstrucionista irritante". No seu lugar, ditas accións son habitualmente precedidas por un sentimento semi-paranoide de estar sendo vetado de interacións no grupo e toma de decisións. A persoa sente que non se lle está tomando en serio, ou (en casos máis serios) de que existe unha conspiración na súa contra&mdash;que outros membros do proxecto decidiron formar un clube exclusivo, do cal non é membro. Entón isto xustifica, na súa mente, o feito de tomar as regras ao pé da letra e involucrarse nunha manipulación formal dos procedementos do proxecto, para poder <emphasis>facer</emphasis> que todos o tomen en serio. En casos extremos, a persoa pode chegar a pensar que está loitando unha batalla para salva-lo proxecto de si mesmo.

source: It is the nature of such an attack from within that not everyone will notice it at the same time, and some people may not see it at all unless presented with very strong evidence. This means that neutralizing it can be quite a bit of work. It's not enough to persuade yourself that it's happening; you have to marshal enough evidence to persuade others too, and then you have to distribute that evidence in a thoughtful way.
es: Dado que hay mucho por lo que luchar, a menudo la mejor opción es tolerarlo de vez en cuando. Piensa en esto como un parásito, esto es una dolencia suave: si no es muy debilitante, el proyecto podrá afrontar el permanecer infectado, y la medicina podría tener efectos perjudiciales. Sin embargo, si consigue más daño del que se pueda tolerar, entonces es tiempo de entrar en acción. Empieza reuniendo notas de los patrones que observas. Asegurate de incluir referencias a archivos públicos; esta es una de las razones por la que los proyectos mantiene históricos, para que puedas usarlos tambien. Una vez que tengas una buena recopilación, empieza a entablar conversaciones privadas con otros participantes del proyecto. No les digas lo que has observado; en vez de eso, pregúntales primero que es lo que observan ellos. Esta puede ser tu última oportunidad de conseguir feedback sin filtrar sobre como los demás observan el comportamiento de los que crean problemas; una vez que has empezado a hablar abiertamente, la opinión se polarizará y nadie será capaz de recordar que es lo que anteriormente opinaba sobre el tema en cuestión.
gl: Na natureza de ditos ataques ocorre que non todos se percatan del ao mesmo tempo, e algunha xente pode que non o vexa se non se lle presenta con probas moi claras. Isto significa que neutralizalo pode supor bastante traballo. Non é suficiente convencerte do que está ocurrindo; hai que reunir suficientes evidencias para convencer aos demáis, e entón distribuilas de maneira intelixente.

source: Given that it's so much work to fight, it's often better just to tolerate it for a while. Think of it like a parasitic but mild disease: if it's not too debilitating, the project can afford to remain infected, and medicine might have harmful side effects. However, if it gets too damaging to tolerate, then it's time for action. Start gathering notes on the patterns you see. Make sure to include references to public archives&mdash;this is one of the reasons the project keeps records, so you might as well use them. Once you've got a good case built, start having private conversations with other project participants. Don't tell them what you've observed; instead, first ask them what they've observed. This may be your last chance to get unfiltered feedback about how others see the troublemaker's behavior; once you start openly talking about it, opinion will become polarized and no one will be able to remember what he formerly thought about the matter.
es: Si las discusiones privadas indican que tambien hay otros que perciben el problema, entonces es hora de hacer algo. Aquí es donde tienes que ser <emphasis>realmente</emphasis> cauteloso, porque sera muy fácil para este tipo de persona hacer parecer como que tú eres el que actua injustamente. Hagas lo que hagas, nunca acuses de abusar maliciosamente de los procedimientos del proyecto, o de ser paranoico, o, en general, de cualquier otra cosa que sospeches que probablemente sea cierta. Tu estrategia deberá mostrarse tanto razonable como consciente del bienestar global del proyecto. Con el objetivo de reformar la actitud de la persona, o de expulsarla del proyecto permanentemente. Dependiendo de los otros desarrolladores, y de tu relación con ellos, puede ser ventajoso conseguir aliados de manera privada primero. O puede que no; ya que puede dificultar el ambiente interno, si la gente piensa que te estas dedicando a una campaña de falsos e impropios rumores.
gl: Sabendo que combatilos é tan complicado, moitas veces é mellor toleralos durante un tempo. Pensa nela coma nunha enfermedade parasitaria pero leve; se non debilita demasiado, o proxecto pode permitirse permanecer infectado, e a medicina podería ter efectos secundarios perxudiciais. Por outro lado, se se torna nalgo demasiado danino, entón hai que pasar á acción. Comeza anotando os patróns que observas. Asegúrate de incluir referencias aos arquivos públicos&mdash;esta é unha das razóns polas que o proxecto mantén rexistros, polo que fas ben en empregalos. Unha vez que tes un bo caso construido, comeza a ter conversacións privadas con outros participantes do proxecto. Non lles digas o que observaches; en lugar diso, pregunta primeiro que observaron eles. Esta pode ser a última oportunidade de obter información sen filtrar sobre como ven outros o comportamento do membro problemático; unha vez que comezas a falar delo abertamente, a opinión estará polarizada e ninguén poderá recordar con exactitude o que pensaba antes sobre o tema.

source: If private discussions indicate that at least some others see the problem too, then it's time to do something. That's when you have to get <emphasis>really</emphasis> cautious, because it's very easy for this sort of person to try to make it appear as though you're picking on them unfairly. Whatever you do, never accuse them of maliciously abusing the project's procedures, of being paranoid, or, in general, of any of the other things that you suspect are probably true. Your strategy should be to look both more reasonable and more concerned with the overall welfare of the project, with the goal of either reforming the person's behavior, or getting them to go away permanently. Depending on the other developers, and your relationship with them, it may be advantageous to gather allies privately first. Or it may not; that might just create ill will behind the scenes, if people think you're engaging in an improper whispering campaign.
es: Recuerda que aunque la otra persona sea la que se este portando destructivamente <emphasis>tu</emphasis> seras la que parezca destructiva si le culpas públicamente y no lo puedes probar. Asegurate de tener varios ejemplos y demostrar lo que estas diciendo, y dilo tan suave como puedes pero siendo directo. Puede que no persuadas a la persona en cuestión, pero estará bien mientras puedas persuadir a los demás.
gl: Se as conversas privadas indican que polo menos algúns dos demáis membros observaron tamén o problema, entón é hora de facer algo. Entón é cando hai que ter <emphasis>verdadeiro</emphasis> coidado, porque é moi sinxelo para este tipo de persoas facer que pareza que os estás tratando de maneira inxusta. Fagas o que fagas, nunca os acuses de abusar maliciosamente dos procedementos do proxecto, ou de ser paranoicos, ou, en xeral, de calqueira cousa que sospeites que é verdade. A túa estratexia debería ser semellar razoable e preocupado polo ben do proxecto, co obxectivo de cambia-lo comportamento da persoa, ou facer que marchen definitivamente. Segundo os demáis desenvolvedores, e a túa relación con eles, pode ser ventaxoso lograr aliados de maneira privada ao comezo. Ou quizáis non; isto podería crear malestar detrás do escenario se a xente pensa que os estás metendo nunha campaña de rexoubas impropia.
