Repository: amaneiro/poss-gl
Catalog: po/*/ch06.po
Languages: es, gl

source: Will all readers react positively to this style? Not necessarily; it depends on the person and the context. For example, if someone has just posted acknowledging that she made a mistake (perhaps she wrote a bug), and you know from past experience that this person tends to be a bit insecure, then while you may still write a compact response, you should make sure to leaven it with some sort of acknowledgment of her feelings. The bulk of your response might be a brief, engineer's-eye analysis of the situation, as terse as you want. But at the end, sign off with something indicating that your terseness is not to be taken as coldness. For example, if you've just given reams of advice about exactly how the person should fix the bug, then sign off with "Good luck, &lt;your name here&gt;" to indicate that you wish them well and are not mad. A strategically placed smiley face or other emoticlue can often be enough to reassure an interlocutor, too.
es: ¿Reaccionarán positivamente todos los lectores a este estilo? No necesariamente; depende de la persona y el contexto. Por ejemplo, si una persona envía un correo reconociendo que cometió un error (quizás codificó un fallo), y sabes por experiencias pasadas que esta persona tiende a ser un poco insegura, entonces mientras puedas escribir una respuesta compacta, deberías asegurarte de dejarlo con algo de mención hacia sus sentimientos. La mayor parte de tu respuesta puede ser un breve análisis de la situación desde el punto de vista del ingeniero, tan conciso como quieras. Pero al final, deberías despedirte con algo que indique que la brevedad no debe ser tomada como frialdad. Por ejemplo, si sólo escribiste montones de consejos indicando exactamente como la persona debería corregir el fallo, entonces debes despedirte con "Buena suerte, NOMBRE_DE_LA_PERSONA" para indicar que le deseas suerte y que no eres malgeniado. Una carita sonriente colocada estratégicamente u otro emoticón, también puede con frecuencia ser suficiente para tranquilizar a un interlocutor.
gl: Reaccionarían todo tipo de persoas positivamente a este correo? Non necesariamente; dependerá da persoa e do contexto. Por exemplo, si alguén ten posteado recoñecendo que se equivocou (cecáis escribiu un trozo de código con algún erro) e sabes por experiencias anteriores que esta persoa tende a ser un pouco insegura no código que envía, é posible que, aínda que escribas unha resposta lacónica, tamén desexes poñer algo que a faga sentir mellor. A resposta pode ser breve, un análise enxeñeril da situación, tan concisa como desexes. Pero ó final, remata deixando claro que a concisión non se debe tomar como un signo de rudeza. Por exemplo, si tes escrito un consello de cómo debe resolve-lo bug, podes asina-lo correo cun "Boa sorte, &lt;o teu nome aquí&lt;" para indicar que lle esperas o mellor dun modo positivo. Un emoticono colocado de modo estratéxico pode ser tamén suficiente.

source: It may seem odd to focus as much on the participant's feelings as on the surface of what they say, but to put it baldly, feelings affect productivity. Feelings are important for other reasons too, but even confining ourselves to purely utilitarian grounds, we may note that unhappy people write worse software, and less of it. Given the restricted nature of most electronic media, though, there will often be no overt clue as to how a person is feeling. You will have to make an educated guess based on a) how most people would feel in that situation, and b) what you know of this particular person from past interactions. Some people prefer a more hands-off attitude, and simply deal with everyone at face value, the idea being that if a participant doesn't say outright that she feels a particular way, then one has no business treating her as though she does. I don't buy this approach, for a couple of reasons. One, people don't behave that way in real life, so why would they online? Two, since most interactions take place in public forums, people tend to be even more restrained in expressing emotions than they might be in private. To be more precise, they are often willing to express emotions directed at others, such as gratitude or outrage, but not emotions directed inwardly, such as insecurity or pride. Yet most humans work better when they know that others are aware of their state of mind. By paying attention to small clues, you can usually guess right most of the time, and motivate people to stay involved to a greater degree than they otherwise might.
es: Puede resultar un tanto extraño centrarse en el sentimiento de los colaboradores, asi como tambien en lo superficial de lo que dicen por decirlo de alguna manera sin rodeos, los sentimientos afectan a la productividad. Los sentimientos tambien son importantes por otras razones, porque incluso confinandonos a nosotros mismos a razones puramente utilitarias, podemos notar que la gente infeliz escribe peor software, y/o menos. Dada la naturaleza restrictiva de la mayoria de los medios electronicos, aunque, a menudo no habra indicios patentes de como se siente una persona. Tendras que realizar una adecuada suposicion basandote en a) como se sentiria la mayoria de la gente en esa situacion, y b) que es lo que conoces de esa persona particular a partir de interacciones pasadas. Algunas personas prefieren una actitud mas pasiva, y simplemente estan de acuerdo con todo el mundo sin cuestionarlos, la idea tras esto es que si un participante no dice abiertamente que es lo que piensa, entonces uno no tiene nada que hacer tratandole como pensaba que lo hacia. No comparto este enfoque, por un par de razones. Una, la gente no se comporta de esa manera en la vida real, asi que porque deberian hacerlo online? Dos, dado que la mayoria de las interacciones tienen lugar en foros publicos, la gente tiende a ser incluso mas moderada expresando las emociones que lo podrian ser en privado. Para ser mas preciso, a menudo estan deseando expresar emociones directamente a otros, tales como de agradecimiento o indignacion, pero no emociones directamente intimas como inseguridad u orgullo. Todavía, la mayoría de los humanos trabajan mejor cuando saben que los demás son conscientes de su estado de ánimo. Prestando atención a a pequeñas pistas, normalmente podrás suponerlo acertadamente la mayoría del tiempo, y motivar a la gente a estar involucrada con un mayor grado que de otra manera no podrían.
gl: Pode parecer extraño poñer os sentementos dos participantes ó mesmo nivel que a propia superficie do que escribe, pero debemos recoñecer que os sentementos afectan á produtividade. Os sentementos son importantes por outras razóns tamén, pero incluso levándoo ó argumentario puramente utilitarista, é posible observar que xente infeliz escribe peor e menos software. Porén, dada a restrinxida natureza dos medios electrónicos, non é sinxelo habitualmente saber cómo se está a sentir unha persoa. Terás que facer unha estimación basándote en a) cómo a maioría da xente se sentiría nesa situación, e b) qué sabes desta persoa por pasadas iteracións con ela. Algunha xente prefire facelo doutro modo, e tratar con todo o mundo sen entrar no terreo das emocións; que si unha persoa non di claramente cómo se sinte, un non ten dereito a tratala como si o supese. Non estou dacordo. Por un par de razóns. Primeiro, a xente non se comporta dese modo na vida offline, entón por qué debería facelo online? A seungda é que, debido a que a maioría das iteraccións teñen lugar en foros públicos, a xente tende a restrinxir máis o ámbito das emocións que en privado. Por ser máis concreto, a xente está máis disposta a expresar emocións dirixidas a outros, como gratitude ou indignación, pero non as internas, como inseguridade ou orgullo. A pesar disto, os seres humás traballan mellor cando eles saben que os outros se preocupan por cómo están. Prestando atención ós pequenos detalles, podes adiviñar o que ocorre a maioría das veces, e motivar á xente para que se involucre en un grado maior do que faría doutro modo.

source: I don't mean, of course, that your role is to be a group therapist, constantly helping everyone to get in touch with their feelings. But by paying careful attention to long-term patterns in people's behavior, you will begin to get a sense of them as individuals even if you never meet them face-to-face. And by being sensitive to the tone of your own writing, you can have a surprising amount of influence over how others feel, to the ultimate benefit of the project.
es: Por supuesto no quiero decir que, tú rol sea el de un terapeuta de grupo, ayudando constantemente a todo el mundo a estar al corriente de sus sentimientos. Pero poniendo una especial atención a patrones a largo-plazo en el comportamiento de la gente, empezarás a tener una sensación de ellos como individuos incluso aunque nunca los hayas conocido cara a cara. Y siendo sensible en el tono de tus mensajes escritos, podrás tener una cantidad sorprendente de influencia sobre los sentimientos de los demás, que es el último beneficio del proyecto.
gl: Dende logo, non pretendo dicir que o teu rol sexa de psicoterapeuta, axudando a todo o mundo e sendo consciente en todo momento dos seus sentementos. Mais prestando atención ós patróns de comportamento a longo plazo, poderás obter unha imaxe mental deles como individuos incluso si endexamáis os tes visto cara a cara. Sendo precavido do teu propio tono ó escribir as mensaxes, podes ter unha cantidade incribe de influencia sobre os sentementos dos outros, para maior beneficio do proxecto.

source: Recognizing Rudeness
es: Reconociendo la grosería
gl: Recoñece-la rudeza

source: One of the defining characteristics of open source culture is its distinctive notions of what does and does not constitute rudeness. While the conventions described below are not unique to free software development, nor even to software in general&mdash;they would be familiar to anyone working in mathematics, the hard sciences, or engineering disciplines&mdash;free software, with its porous boundaries and constant influx of newcomers, is an environment where these conventions are especially likely to be encountered by people unfamiliar with them.
es: Una de las características que definen la cultura del código abierto son son las nociones distintivas de qué constituye grosería y qué no. Mientras que los convenios que se describen debajo no son únicos para el desarrollo de software libre, ni tampoco para el software en general debería ser familiar para cualquiera que trabaje en disciplinas de las matemáticas, ciencias puras o la ingeniería el software libre, con sus porosos límites y un constante influjo de recién llegados, es un entorno donde es especialmente probable encontrar estas convenciones por gente no familiarizada con ellas.
gl: Unha das características definitorias da cultura do software libre é a noción do que é rudeza e do que non. Aínda que as convencións descritas a continuación non son únicas no mundo do software libre, nen sequera únicas do mundo do software en xeral &mdash; serán familiares a calquera que traballe no ámbito das matemáticas, ciencias duras ou enxeñerías&mdash; o mundo do software libre, coas súas fronteiras porosas e constante fluxo de xente nova, é un ambiente onde estas convencións van a ser vistas por xente non familiarizadas con elas.

source: Let's start with the things that are <emphasis>not</emphasis> rude:
es: Comencemos con las cosas que <emphasis>no</emphasis> son groseras (maleducadas):
gl: Empecemos coas convencións do que <emphasis>non</emphasis> é rudeza:

source: Technical criticism, even when direct and unpadded, is not rude. Indeed, it can be a form of flattery: the critic is saying, by implication, that the target is worth taking seriously, and is worth spending some time on. That is, the more viable it would have been to simply ignore someone's post, the more of a compliment it becomes to take the time to criticize it (unless the critique descends into an <foreignphrase>ad hominem</foreignphrase> attack or some other form of obvious rudeness, of course).
es: La crítica técnica, incluso cuando es directa y sin tacto, no es una grosería. De hecho, puede ser una forma de adulación: la crítica es decir, por implicación, que vale la pena tomarse en serio el destinatario,y vale la pena invertir tiempo en él. Es decir, cuanto más viable fuera simplemente ignorar el mensaje de alguien, se entiende más por un cumplido molestarse en criticarlo (a no ser que la crítica se convierta, por su puesto, en un ataque <foreignphrase>ad hominem</foreignphrase> o alguna otra forma de grosería obvia).
gl: Críticas técnicas, aínda cando sexan directas e sen tacto, non é rudeza. Pode incluso ser visto como un eloxio: implícitamente, o crítico está dicindo que se está tomando en serio o que dis, e vale a pena dedicarlle algún tempo. É dicir, o mellor tería sido simplemente ignorar esa mensaxe, tomarse un tempo para criticalo ten o seu punto de eloxio (a menos que a crítica se convirta nun ataque <foreignphrase>ad hominen</foreignphrase> ou algún outro modo de rudeza, dende logo).

source: Blunt, unadorned questions, such as Shane's questions to me in the previously quoted email, are not rude either. Questions that in other contexts might seem cold, rhetorical, or even mocking, are often intended seriously, and have no hidden agenda other than eliciting information as quickly as possible. The famous technical support question "Is your computer plugged in?" is a classic example of this. The support person really does need to know if your computer is plugged in, and after the first few days on the job, has gotten tired of prefixing her question with polite blandishments ("I beg your pardon, I just want to ask a few simple questions to rule out some possibilities. Some of these might seem pretty basic, but bear with me..."). At this point, she doesn't bother with the padding anymore, she just asks straight out: is it plugged in or not? Equivalent questions are asked all the time on free software mailing lists. The intent is not to insult the recipient, but to quickly rule out the most obvious (and perhaps most common) explanations. Recipients who understand this and react accordingly win points for taking a broad-minded view without prompting. But recipients who react badly should not be reprimanded, either. It's just a collision of cultures, not anyone's fault. Explain amiably that your question (or criticism) had no hidden meanings; it was just meant to get (or transmit) information as efficiently as possible, nothing more.
es: Preguntas directas, sin adornos, como la que Shane me hizo en el correo anterior tampoco es grosería. Preguntas que, en otros contextos, pueden parecer frias, retóricas e incluso a modo de burla, son formuladas a menudo de una forma seria, y no tienen más intención que obtener información lo más rápido posible. La famosa pregunta del soporte técnico "¿Está su ordenador conectado?" es un ejemplo clásico de esto. La persona de soporte realmente necesita saber si tu ordenador está contectado y, después de unos pocos días en el trabajo, se ha cansado de adornar su pregunta de florituras ("Le pido disculpas, quisiera que me contestara unas simples preguntas para descartar algunas posibilidades. Algunas pueden parecer muy básicas, pero tenga paciencia..."). En este punto, no le importa seguir adornando más simplemente pregunta directamente: ¿está o no está conectado? Preguntas similares se hacen en todo momento en las lista de distribución del software libre. La intención no es insultar al destinatario, sino descartar rápidamente las explicaciones más obvias (y quizás más comunes). Los destinatarios que lo entiendan y reaccionen de ese modo ganarán puntos en tener una visión tolerante sin provocarse. Pero los destinatarios que reaccionen mal tampoco deberían ser reprendidos. Es simplemente una colisión de culturas, no es culpa de nadie. Explica amablemente que tu pregunta (o crítica) no tiene significados ocultos; que solo significaba obtener (o transmitir) la información de la forma más eficientemente posible, nada más.
gl: Preguntas desprovistas de todo adorno, directas ó grano, tales como as anteriores de Shane, tampouco poden considerarse rudas. Preguntas que noutros contextos poden parecer frías, retóricas, ou incluso burlescas, habitualmente son formuladas seriamente, e non teñen maior intención que extraer información o máis rápido posible. A famosa frase de "está o seu ordenador encendido?" é un exemplo clásico desto. A persoa que traballa en soporte técnico precisa saber si a computadora está accesa, e logo dos primeiros días de traballo, está cando de engadir previamente á súa pregunta educados acompañamentos como "desculpe vostede, vou a facerlle unhas preguntas moi sinxelas para descartar certas posibilidades. Algunhas delas poden parecer moi básicas, mais teña un pouco de paciencia...". Nese momento, xa non lle preocupan as frases de recheo e vai directamente ó esencial. Preguntas dese estilo son realizadas todo o tempo nas roldas de correo do movemento do software libre. Non pretenden insultar á persoa que enviou a mensaxe, senón descartar as máis obvias (e cecáis máis comúns) explicacións. Os que comprendan esta lóxica e reaccionen dacordo con ela están gañando puntos respecto a aqueles que non. Aínda que a estos últimos tampouco se lles pode reprochar a súa actitude. O conflito reside únicamente nun choque de culturas, non no erro de ninguén. Dun modo amigable debes comentar que a pregunta (ou crítica) non tiña significados ocultos, só desexaba obter a información o máis rápido posible.

source: So what is rude?
es: Entonces, ¿qué es grosería?
gl: Entón ... qué é rudeza?

source: By the same principle under which detailed technical criticism is a form of flattery, failure to provide quality criticism can be a kind of insult. I don't mean simply ignoring someone's work, be it proposal, code change, new issue filing, or whatever. Unless you explicitly promised a detailed reaction in advance, it's usually okay to simply not react at all. People will assume you just didn't have time to say anything. But if you <emphasis>do</emphasis> react, don't skimp: take the time to really analyze things, provide concrete examples where appropriate, dig around in the archives to find related posts from the past, etc. Or if you don't have time to put in that kind of effort, but still need to write some sort of brief response, then state the shortcoming openly in your message ("I think there's an issue filed for this, but unfortunately didn't have time to search for it, sorry"). The main thing is to recognize the existence of the cultural norm, either by fulfilling it or by openly acknowledging that one has fallen short this time. Either way, the norm is strengthened. But failing to meet that norm, while at the same time not explaining <emphasis>why</emphasis> you failed to meet it, is like saying the topic (and those participating in it) was not worth much of your time. Better to show that your time is valuable by being terse than by being lazy.
es: Bajo el mismo principo por el cual las críticas a detalles técnicos es una forma de halago, no proporcionar críticas de calidad puede ser un tipo de insulto. No quiero decir simplemente que ignorando el trabajo de alguien, sea una propuesta, cambio en el código, nuevas informaciones o cualquier cosa. A menos que explicitamente prometas una reacción detallada más adelante, normalmente es OK simplemente no reaccionando de ninguna manera. La gente asumirá así que no tuviste tiempo de decir nada. Pero si tu <emphasis>reaccionas</emphasis> , no escatimes: tómate el tiempo para analizar detalladamente las cosas, proporcionar ejemplos concretos allá donde sea apropiado, rebuscar a través de los archivos para encontrar información relacionada del pasado, etc. O si no tienes tiempo para realizar todo ese esfuerzo, pero todavía necesitas escribir algún tipo de respuesta corta, entonces exponlo de manera abierta y breve en tu mensaje ("Creo que hay un tema abierto para esto, pero desafortunadamente no tuve tiempo para buscarlo, lo siento"). Lo principal es reconocer la existencia de la norma cultural, ya sea algo satisfactorio o reconociendo abiertamente que ha fallado ligeramente esta vez. Sea lo que sea, la norma es reforzar. Pero el no cumplir esta norma mientras que al mismo tiempo no se explica el <emphasis>porque</emphasis> fallaste en conecerlo, es lo mismo que decir el tópico (y aquellos que participan en ello) no mereció tu tiempo. Es mejor mostrar que tu tiempo es muy valioso siendo seco que siendo vago.
gl: Polo mesmo principio baixo o cal unha crítica técnica detallada é un modo de eloxio, fornecer unha crítica mala pode ser considerado unha certa clase de insulto. Non quero dicir ignorar a aportación de alguén, sexa ésta unha proposta, cambio no código, petición de novas funcionalidades, etc. A xente asumirá que non tes tempo para dicir nada. Mais si reaccionas con algunha resposta, non escatimes: tómate o tempo necesario para analizar as cousas, fornece exemplos concretos cando sexa apropiado, investiga nos arquivos para buscar post relacionados no pasado, etc. Ou se non tes tempo para poñer esa clase de esforzo, pero escribes unha breve resposta, entón comeza a túa mensaxe dicindo algo como "creo que existe algún comentario previo sobre isto, mais non tiven tempo a buscalo, síntoo". O principal consiste en recoñece-la existencia dunha norma cultural, cumplíndoa ou recoñecendo que esta vez non se puido cumplir. Calquera que sexa a opción escollida, a norma é fortaleida. Non aterse á norma implícita, e ó mesmo tempo non dicir por qué, é como dicir que o asunto (e esos participando nel) non valen o teu tempo. Mellor amosar que o teu tempo é valioso sendo seco que vago.

source: There are many other forms of rudeness, of course, but most of them are not specific to free software development, and common sense is a good enough guide to avoid them. See also <xref linkend="prevent-rudeness"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>, if you haven't already.
es: Hay muchas otras formas de grosería, por supuesto, pero la mayoría no es específica del desarrollo de software libre, y el sentido común es una buena forma de evitarlas. Véase también <xref linkend="prevent-rudeness"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>, si lo has hecho todavía.
gl: Existen outras moitas formas de rudeza, obviamente. Mais a maioría delas non son específicas do mundo do software libre e o propio sentido común é unha guía máis que suficiente para evitala. Podes botarlle un vistazo ó seguinte enlace <xref linkend="prevent-rudeness"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>, se aínda non o tes feito.

source: Face
es: Caras
gl: Caras

source: There is a region in the human brain devoted specifically to recognizing faces. It is known informally as the "fusiform face area," and its capabilities are mostly inborn, not learned. It turns out that recognizing individual people is such a crucial survival skill that we have evolved specialized hardware to do it.
es: Hay una parte en el cerebro humano dedicada específicamente a reconocer caras. Es conocida informalmente como "área de fusión de caras", y sus capacidades son mayoritariamente innatas , no se han aprendido. Resulta que reconocer a las personas individualmente es una técnica tan crucial de supervivencia que hemos desarrollado un hardware especializado para ello..
gl: Hai unha rexión do cerebro humano diseñada específicamente para recoñecer caras. Coñécese informalmente como "área de recoñemento de caras" e as súas capacidaes son maiormente innatas, non aprendidas. Parece que o recoñecemento de persoas é unha tarefa crucial na supervivencia e que temos desenvolvido hardware especializado para facelo.
