Repository: amaneiro/poss-gl
Catalog: po/*/ch07.po
Languages: gl

source: Packaging, Releasing, and Daily Development
gl: Empaquetado, Liberación e dia a dia no Desenvolvemento

source: This chapter is about how free software projects package and release their software, and how overall development patterns organize around those goals.
gl: Este capítulo trata sobre como os proxectos de software libre empaquetan e liberan o seu software e de como os patróns de desenvolvemento globais se organizan en torno a eses obxectivos.

source: A major difference between open source projects and proprietary ones is the lack of centralized control over the development team. When a new release is being prepared, this difference is especially stark: a corporation can ask its entire development team to focus on an upcoming release, putting aside new feature development and non-critical bug fixing until the release is done. Volunteer groups are not so monolithic. People work on the project for all sorts of reasons, and those not interested in helping with a given release still want to continue regular development work while the release is going on. Because development doesn't stop, open source release processes tend to take longer, but be less disruptive, than commercial release processes. It's a bit like highway repair. There are two ways to fix a road: you can shut it down completely, so that a repair crew can swarm all over it at full capacity until the problem is solved, or you can work on a couple of lanes at a time, while leaving the others open to traffic. The first way is very efficient <emphasis>for the repair crew</emphasis>, but not for anyone else&mdash;the road is entirely shut down until the job is done. The second way involves much more time and trouble for the repair crew (now they have to work with fewer people and less equipment, in cramped conditions, with flaggers to slow and direct traffic, etc.), but at least the road remains useable, albeit not at full capacity.
gl: A maior diferencia entre os proxectos de software libre e os propietarios e a falta de control centralizado sobre o equipo de desenvolvemento. Cando unha nova versión está a ser preparada, esta diferencia é especialmente cruda: unha corporación pode pedir a todo o seu equipo de desenvolvemento que se centre na versión que está a piques de ser lanzada, deixando de lado as novas funcionalidades e os erros que non son críticos ata que finalmente se lance a nova versión. Os grupos de voluntarios non son monolíticos. A xente traballa nun proxecto por moitas razóns diferentes, e aqueles que non están interesados en axudar no proceso de lanzamento da nova versión poden querer seguir colaborando no desenvolvemento mentres a nova versión está a punto de saír. Debido a que o desenvolvemento non para, o proceso de lanzamento de novas versión no software libre tende ser largo pero menos problemático que nos procesos comerciais. E parecido a reparar unha autopista. Hai dúas maneiras de arranxar unha estrada, pódese pechar por completo de xeito que os operarios poidan traballar en toda ela por completo ata reparala toda ou pódese traballar nun par de carriles deixando outros abertos ao tráfico. A primeira forma é moi eficiente <emphasis>para os operarios</emphasis>, pero para ninguén máis; a estrada está totalmente pechada ata a finalización dos traballos. A segunda forma require moito máis tempo e dificultades para os operarios (ahora eles teñen que traballar con menos xentes e menos equipamento, con estreiteces, con sinais para reducir a velocidade do tráfico e dirixilo, etc.), pero alomenos a estrada permanece usable ainda que non por completo.

source: Open source projects tend to work the second way. In fact, for a mature piece of software with several different release lines being maintained simultaneously, the project is sort of in a permanent state of minor road repair. There are always a couple of lanes closed; a consistent but low level of background inconvenience is always being tolerated by the development group as a whole, so that releases get made on a regular schedule.
gl: Os proxectos de software libre tenden a traballar da segunda maneira. De feito, para un proxecto maduro con varias liñas diferentes de versións sendo mantidas simultáneamente, o proxecto atópase permanentemente nun estado de reparacións menores na estrada. Hai sempre un par de carriles pechados; un constante pero baixo nivel de inconvintes é sempre soportado polo grupo de desenvolvemento coma unha molestia, para que a liberación das versións siga un ciclo regular.

source: The model that makes this possible generalizes to more than just releases. It's the principle of parallelizing tasks that are not mutually interdependent&mdash;a principle that is by no means unique to open source development, of course, but one which open source projects implement in their own particular way. They cannot afford to annoy either the roadwork crew or the regular traffic too much, but they also cannot afford to have people dedicated to standing by the orange cones and flagging traffic along. Thus they gravitate toward processes that have flat, constant levels of administrative overhead, rather than peaks and valleys. Volunteers are generally willing to work with small but consistent amounts of inconvenience; the predictability allows them to come and go without worrying about whether their schedule will clash with what's happening in the project. But if the project were subject to a master schedule in which some activities excluded other activities, the result would be a lot of developers sitting idle a lot of the time&mdash;which would be not only inefficient but boring, and therefore dangerous, in that a bored developer is likely to soon be an ex-developer.
gl: O modelo que posibilita isto xeneralízase a algo máis que só a liberación de versións. É o principio de paralelización de tarefas que non son interdependentes&mdash; un principio que de ningún modo é exclusivo para o desenvolvemento de software libre, por suposto, pero que é implementado no software libre dun xeito particular. Non se pode asumir o molestar demasiado aos homes que traballan na estrada nin á circulación, pero tampouco se pode permitir ter xente dedicada a estar tras os conos laranxas dirixindo o tráfico con bandeiras. Así gravitan en torno a procesos que teñen niveles planos e constantes de esforzo de administración en lugar de altos e baixos. Os voluntarios xeralmente están dispostos a traballar con cantidades pequenas pero consistentes de inconvintes; a predicibilidade lles permite ir e vir sen preocuparse acerca de se as súas planificacións entran en conflicto co que ocurre no proxecto. Pero se o proxecto estibese suxeito a unha planificación maestra na cal unhas actividades exclúen a outras, o resultado sería desenvolvedores perdento tempo &mdash; que sería, non só ineficiente, senón aburrido, e por tanto perigoso, xa que un desenvolvedor aburrido está cerca de se converter nun ex-desenvolvedor.

source: Release work is usually the most noticeable non-development task that happens in parallel with development, so the methods described in the following sections are geared mostly toward enabling releases. However, note that they also apply to other parallelizable tasks, such as translations and internationalization, broad API changes made gradually across the entire code base, etc.
gl: O traballo de lanzamento de novas versións é xeralmente a tarefa de non desenvolvemento máis perceptible que sucede en pararelo co desenvolvemento, polo tanto os métodos que se describen nas seguintes seccións están concebidas maioritariamente para posibilitar as novas versións. Sen embargo, nótese que éstes deben ser aplicados paralelamente con outras tarefas, como a tradución e internacionalización, cambios claros na API feitos gradualmente a través do código base, etc.

source: Release Numbering
gl: Numeración de Versións

source: Before we talk about how to make a release, let's look at how to name releases, which requires knowing what releases actually mean to users. A release means that:
gl: Antes de falar acerca de como facer unha versión, imos ver como nomear as versións, o cal require coñecer o que as versións significan para os usuarios. Unha versión significa que:

source: Old bugs have been fixed. This is probably the one thing users can count on being true of every release.
gl: Vellos erros foron resoltos. Isto é probablemente unha das cousas coas que os usuarios contan con que se certo en cada versión.

source: New bugs have been added. This too can usually be counted on, except sometimes in the case of security releases or other one-offs (see <xref linkend="security-releases"/><phrase output="printed"> later in this chapter</phrase>).
gl: Novos erros forno engadidos. Con isto sóese contar tamén, excepto algunhas veces no caso de versións de seguridade ou outras que só saen unha vez (ver <xref linkend="security-releases"/><phrase output="printed"> máis adiante neste capítulo</phrase>).

source: New features may have been added.
gl: Novas funcionalidades puideron ser engadidas.

source: New configuration options may have been added, or the meanings of old options may have changed subtly. The installation procedures may have changed slightly since the last release too, though one always hopes not.
gl: Novas opcións de configuración puideron ser engadidas, ou o significado de vellas opcións puido cambiar sutilmente. A instalación de procedementos puido cambiar lixeiramente dende a última versión tamén, ainda que sempre se espera que non.

source: Incompatible changes may have been introduced, such that the data formats used by older versions of the software are no longer useable without undergoing some sort of (possibly manual) one-way conversion step.
gl: Cambios incompatibles poden ser introducidos, por exemplo o formato dos datos usados por versións anteriores do software xa non son usables sen algún tipo de conversión (posiblemente manual).

source: As you can see, not all of these are good things. This is why experienced users approach new releases with some trepidation, especially when the software is mature and was already mostly doing what they wanted (or thought they wanted). Even the arrival of new features is a mixed blessing, in that it may mean the software will now behave in unexpected ways.
gl: Como se pode ver, non todas estas cousas son boas. Isto é polo que os usuarios experimentados solicitan novas versións con algo de inquietude, especialmente cando o software é maduro e xa fai case todo o que eles queren (ou pensan que queren). Incluso a chegada de novas funcionalidades ú unha bendición a medias, xa que pode significar que o software se vaia comportar agora de xeito inexperado.

source: The purpose of release numbering, therefore, is twofold: obviously the numbers should unambiguously communicate the ordering of releases (i.e., by looking at any two releases' numbers, one can know which came later), but also they should indicate as compactly as possible the degree and nature of the changes in the release.
gl: O propósito da numeración de versións, polo tanto, é doble: obviamente os números deben comunicar sen ambigüedade a orden das versións (por exemplo, mirando os números de dúas versións, un debe poder saber cal ven despois), pero ademáis deben indicar do xeito máis compacto posible o nivel e natureza dos cambios na versión.

source: All that in a number? Well, more or less, yes. Release numbering strategies are one of the oldest bikeshed discussions around (see <xref linkend="bikeshed"/><phrase output="printed"> in <xref linkend="communications"/></phrase>), and the world is unlikely to settle on a single, complete standard anytime soon. However, a few good strategies have emerged, along with one universally agreed-on principle: <emphasis>be consistent</emphasis>. Pick a numbering scheme, document it, and stick with it. Your users will thank you.
gl: Todo iso nun número? Bueno, máis ou menos, si. As estratéxias de numeración de versións son unha das vellas discusións (ver <xref linkend="bikeshed"/><phrase output="printed"> en <xref linkend="communications"/></phrase>), e é pouco probable que se atope unha sinxela, completa e estándar solución. Sen embargo, unhas poucas boas estratéxias emerxeron, xunto con un universal principio: <emphasis>ser consistente</emphasis>. Elixir un esquema numérico, documentalo e mantelo. Os usuarios agradecerano.

source: Release Number Components
gl: Compoñentes numéricos da versión

source: This section describes the formal conventions of release numbering in detail, and assumes very little prior knowledge. It is intended mainly as a reference. If you're already familiar with these conventions, you can skip this section.
gl: Esta sección describe as convencións formais da numeración das versións en detalle, e asume un pouco de coñecemento previo. Está prevista principalmente coma unha referenza. Se xa estás familiarizado con estas convencións, podes saltar esta sección.

source: Release numbers are groups of digits separated by dots:
gl: A numeración de versións son grupos de díxitos separados por puntos:

source: ...and so on. The dots are <emphasis>not</emphasis> decimal points, they are merely separators; "5.3.9" would be followed by "5.3.10". A few projects have occasionally hinted otherwise, most famously the Linux kernel with its "0.95", "0.96"... "0.99" sequence leading up to Linux 1.0, but the convention that the dots are not decimals is now firmly established and should be considered a standard. There is no limit to the number of components (digit portions containing no dots), but most projects do not go beyond three or four. The reasons why will become clear later.
gl: ...continuando. Os puntos <emphasis>non</emphasis> significan decimáis, son meros separadores; "5.3.9" iria seguido de "5.3.10". Uns poucos proxectos son etiquetados de forma diferente, o máis famoso é o kernel de Linux coas súas secuencias "0.95", "0.96"... "0.99" ata Linux 1.0, pero a convención de que eses puntos non son decimáis é ahora firmemente establecida e debería ser considerada estándar. Non hai límites sobre o número de compoñentes (porción de díxitos que non conteñen puntos), pero a maioría dos proxectos non teñen máis de tres ou catro. A razón é para que sexan máis comprensibles.

source: In addition to the numeric components, projects sometimes tack on a descriptive label such as "Alpha" or "Beta" (see <xref linkend="alpha-and-beta"/>), for example:
gl: Ademáis dos compoñentes numéricos, os proxectos as veces engaden unha etiqueta descriptiva como "Alpha" ou "Beta" (ver <xref linkend="alpha-and-beta"/>), por exemplo:

source: An Alpha or Beta qualifier means that this release <emphasis>precedes</emphasis> a future release that will have the same number without the qualifier. Thus, "2.3.0&nbsp;(Alpha)" leads eventually to "2.3.0". In order to allow several such candidate releases in a row, the qualifiers themselves can have meta-qualifiers. For example, here is a series of releases in the order that they would be made available to the public:
gl: Unha calificación Alpha ou Beta quere dicir que esta versión <emphasis>precede</emphasis> a unha futura versión que terá o mesmo número pero sen o cualificador. De este modo, "2.3.0&nbsp;(Alpha)" lleva finalmente a "2.3.0". Para permitir tanta cantidade de versións distintas, os cualificadores teñen eles mismos meta-cualificadores. Por exemplo, aqui hai unha serie de versións que estarían dispoñibles para o público:

source: Notice that when it has the "Alpha" qualifier, Scanley "2.3" is written as "2.3.0". The two numbers are equivalent&mdash;trailing all-zero components can always be dropped for brevity&mdash;but when a qualifier is present, brevity is out the window anyway, so one might as well go for completeness instead.
gl: Nótese que cando ten o cualificador "Alpha", Scanley "2.3" escribese como "2.3.0". Os dous números son equivalentes&mdas; os compoñentes que son ceros poden ser eliminados por brevedade&mdash; pero cando un cualificador está presente, a brevedade non serve para nada, polo que debe poñerse completo.

source: Other qualifiers in semi-regular use include "Stable", "Unstable", "Development", and "RC" (for "Release Candidate"). The most widely used ones are still "Alpha" and "Beta", with "RC" running a close third place, but note that "RC" always includes a numeric meta-qualifier. That is, you don't release "Scanley&nbsp;2.3.0&nbsp;(RC)", you release "Scanley&nbsp;2.3.0&nbsp;(RC&nbsp;1)", followed by RC2, etc.
gl: Outros cualificadores que soen ser empregados son "Estable", "Inestable", "Desenvolvemento", e "RC" (para "Versión Candidata"). Os máis comunmente empregados son "Alpha" e "Beta", con "RC" moi cerca no terceiro posto, pero nótese que "RC" sempre inclúe un meta-cualificador numérico. Isto é, nos sacas a versión "Scanley&nbsp;2.3.0&nbsp;(RC)" sacas "Scanley&nbsp;2.3.0&nbsp;(RC&nbsp;1)"), seguido da RC", etc.

source: Those three labels, "Alpha", "Beta", and "RC", are pretty widely known now, and I don't recommend using any of the others, even though the others might at first glance seem like better choices because they are normal words, not jargon. But people who install software from releases are already familiar with the big three, and there's no reason to do things gratuitously differently from the way everyone else does them.
gl: Esas tres etiquetas, "Alpha", "Beta", e "RC", son bastante máis coñecidas agora, e non recomendo usar ningunha outra, incluso pensando que as outras poden parecer mellor elección a primeira vista porque son palabras normais, non xerga. Pero a xente que instala software dende versións está xa familiarizado coas tres, e non hai razón para facer as cousas gratuitamente diferentes da forma que a xente coñece.

source: Although the dots in release numbers are not decimal points, they do indicate place-value significance. All "0.X.Y" releases precede "1.0" (which is equivalent to "1.0.0", of course). "3.14.158" immediately precedes "3.14.159", and non-immediately precedes "3.14.160" as well as "3.15.anything", and so.
gl: Ainda que os puntos nos números da versión non son puntos decimais, a súa poscición ten significado. Todas as versións "0.X.Y" preceden a "1.0" (a cal equivale a "1.0.0", por suposto). "3.14.158" inmediatamente preceden a "3.14.159", e non inmediatamente precede a "3.14.160" así como tamén a "3.15.algo", e así.

source: A consistent release numbering policy enables a user to look at two release numbers for the same piece of software and tell, just from the numbers, the important differences between those two releases. In a typical three-component system, the first component is the <firstterm>major&nbsp;number</firstterm>, the second is the <firstterm>minor&nbsp;number</firstterm>, and the third is the <firstterm>micro&nbsp;number</firstterm>. For example, release "2.10.17" is the seventeenth micro release in the tenth minor release line within the second major release series. The words "line" and "series" are used informally here, but they mean what one would expect. A major series is simply all the releases that share the same major number, and a minor series (or minor line) consists of all the releases that share the same minor <emphasis>and</emphasis> major number. That is, "2.4.0" and "3.4.1" are not in the same minor series, even though they both have "4" for their minor number; on the other hand, "2.4.0" and "2.4.2" are in the same minor line, though they are not adjacent if "2.4.1" was released between them.
gl: Unha consistente política de numeración de versións permite ao usuario mirar dous números de versión para a mesma peza de software e decir, polos números, as importantes diferencias entre esas duas versións. En un típico sistema de tres compoñentes, o primeiro é o número <firstterm>maior&nbsp;</firstterm>, o segundo e o número <firstterm>menor&nbsp;</firstterm>, e o terceiro é o número <firstterm>micro&nbsp</firstterm>. Por exemplo, a versión "2.10.17" é a décimo séptima micro versión na décima liña de versión menor dentro da segunda serie de versións maiores. As palabras "liña" e "series" son empregadas informálmente aquí, pero teñen o significado que un esperaría. A serie maior é simplemente todas as versión que comparten o mesmo número maior, e a serie menor (ou liña menor) componse de todas as versións que comparten o número menor <emphasis>e</emphasis> número maior. Isto é, "2.4.0" e "3.4.1" non están na mesma serie menor ainda que comparten o "4" como número menor; por outra banda, "2.4.0" e "2.4.2" están na memsma liña menor, pensando que non son adxacentes se a "2.4.1" foi lanzada entre elas.

source: The meanings of these numbers are exactly what you'd expect: an increment of the major number indicates that major changes happened; an increment of the minor number indicates minor changes; and an increment of the micro number indicates really trivial changes. Some projects add a fourth component, usually called the <firstterm>patch&nbsp;number</firstterm>, for especially fine-grained control over the differences between their releases (confusingly, other projects use "patch" as a synonym for "micro" in a three-component system). There are also projects that use the last component as a <firstterm>build&nbsp;number</firstterm>, incremented every time the software is built and representing no change other than that build. This helps the project link every bug report with a specific build, and is probably most useful when binary packages are the default method of distribution.
gl: O significados de estes números son exactamente o que se esperaría: un incremento do número maior indica que ocorreron cambios maiores; un incremento do número menor indica cambios menores; e un incremento do número micro indica cambios realmente triviais. Algúns proxectos engaden un cuarto compoñente, chamado habitualmente o <firstterm>patch&nbsp;número</firstterm>, para un control moi especializado sobre as diferencias entre as súas versións (confunsamente, outros proxectos usan "patch" coma un sinónimo para "micro" nun sistema de tres compoñentes). Hai tamén proxectos que usan a última compoñente como <firstterm>build&nbsp;número</firstterm>, incrementado cada vez que o software é compilado e sen representar ningún outro cambio. Isto axuda ao proxecto a enlazar calquera erro atopado cunha compilación específica, e é probablemente máis útil cando os paquetes binarios son o método por defecto de distribución.

source: Although there are many different conventions for how many components to use, and what the components mean, the differences tend to be minor&mdash;you get a little leeway, but not a lot. The next two sections discuss some of the most widely used conventions.
gl: Ainda que hay moitas convencións diferentes sobre cantos compoñentes empregar, e sobre o que os compoñentes significan, as diferenzas tenden a ser pequenas&mdash; podes ter un pouco de flexibilidade, pero non moita. As próximas duas seccións tratan sobre as convencións máis empregadas.

source: The Simple Strategy
gl: A Estratexia Simple
