Repository: amaneiro/poss-gl
Catalog: po/*/ch07.po
Languages: gl

source: Most projects have rules about what kinds of changes are allowed into a release if one is only incrementing the micro number, different rules for the minor number, and still different ones for the major number. There is no set standard for these rules yet, but here I will describe a policy that has been used successfully by multiple projects. You may want to just adopt this policy in your own project, but even if you don't, it's still a good example of the kind of information release numbers should convey. This policy is adapted from the numbering system used by the APR project, see <ulink url="http://apr.apache.org/versioning.html"></ulink>.
gl: A maioría dos proxectos theñen reglas sobre que tipo de cambios son permitidos nunha versión se só se incrementa o micro número, reglas diferentes para o número menor, e diferentes tamén para o número maior. Non hai un estándar para estas reglas ainda, pero aqui farei unha descripción da política que foi adoptada con éxito por moitos proxectos. Ti podes querer simplemente adoptar esta política no teu propio proxecto, pero incluso senón, é un bo exemplo de que tipo de información deberían dar os números de versións. Esta política está adaptada dende o sistema de numeración usado polo proxecto APR, ver <ulink url="http://apr.apache.org/versioning.html"></ulink>.

source: Changes to the micro number only (that is, changes within the same minor line) must be both forward- and backward-compatible. That is, the changes should be bug fixes only, or very small enhancements to existing features. New features should not be introduced in a micro release.
gl: Cambiar o número micro só (isto é, cambios na menor liña) deben implicar compatibilidade tanto cara adiante coma cara atrás. Isto é, os cambios deberían resolver erros soamente, ou moi pequenas melloras en funcionalidades existentes. Novas funcionalidades non deberían ser introducidads nunha micro versión.

source: Changes to the minor number (that is, within the same major line) must be backward-compatible, but not necessarily forward-compatible. It's normal to introduce new features in a minor release, but usually not too many new features at once.
gl: Cambios no número menor (isto é, dentro da mesma liña maior) deben ser compatibles cara atrás, pero non necesáriamente cara adiante. É normal introducir novas funcionalidades nunha versión menor, pero xeralmente non moitas ao mesmo tempo.

source: Changes to the major number mark compatibility boundaries. A new major release can be forward- and backward-incompatible. A major release is expected to have new features, and may even have entire new feature sets.
gl: Cambios no número maior marca unha fronteira na compatibilidade. Unha versión maior pode ser incompatible cara adiante e cara atrás. Nunha versión maior espérase que teña novas funcionalidades, e pode incluso ter un novo xogo de funcionalidades.

source: What <firstterm>backward-compatible</firstterm> and <firstterm>forward-compatible</firstterm> mean, exactly, depends on what your software does, but in context they are usually not open to much interpretation. For example, if your project is a client/server application, then "backward-compatible" means that upgrading the server to 2.6.0 should not cause any existing 2.5.4 clients to lose functionality or behave differently than they did before (except for bugs that were fixed, of course). On the other hand, upgrading one of those clients to 2.6.0, along with the server, might make <emphasis>new</emphasis> functionality available for that client, functionality that 2.5.4 clients don't know how to take advantage of. If that happens, then the upgrade is <emphasis>not</emphasis> "forward-compatible": clearly you can't now downgrade that client back to 2.5.4 and keep all the functionality it had at 2.6.0, since some of that functionality was new in 2.6.0.
gl: O que quere dicir ser <firstterm>compatible cara atrás</firstterm> e <firstterm>compatible cara adiante</firstterm> depende do que o software faga, pero en contexto xeralmente non están abertas a moita interpretación. Por exemplo, se o teu proxecto é unha aplicación tipo cliente/servidor, entón "compatibilidade cara atrás" significa que actualizando o servidor a versión 2.6.0 non debería causar perda de funcionalidade ou comportamento diferente en clientes existentes 2.5.4 (excepto para os erros que foron resoltos, por suposto). Por outra banda, actualizar un dos clientes a versión 2.6.0, xunto co servidor, poden ter <emphasis>novas</emphasis> funcionalidades dispoñibles para ese cliente, funcionalidades que os clientes 2.5.4 no saben como sacar partido delas. Se esto sucede, entón a actualización <emphasis>non</emphasis> é "compatible cara adiante": claramente ti non podes agora desactualizar o cliente de novo a 2.5.4 e manter toda a funcionalidade que tiña coa 2.6.9, xa que algúnhas desas funcionalidades eran novas na 2.6.0.

source: This is why micro releases are essentially for bug fixes only. They must remain compatible in both directions: if you upgrade from 2.5.3 to 2.5.4, then change your mind and downgrade back to 2.5.3, no functionality should be lost. Of course, the bugs fixed in 2.5.4 would reappear after the downgrade, but you wouldn't lose any features, except insofar as the restored bugs prevent the use of some existing features.
gl: Isto é polo que as micro versións son esencialmente para arranxar erros. Deben manter a compatibilidade en ambas direccións: se actualizas da 2.5.3 a 2.5.4, despois cambias de opinión en volves a 2.5.3, non deberías perder ningunha funcionalidade, agás no caso de que ao restaurar os erros non posibiliten o uso de algunhas funcionalidades existentes.

source: Client/server protocols are just one of many possible compatibility domains. Another is data formats: does the software write data to permanent storage? If so, the formats it reads and writes need to follow the compatibility guidelines promised by the release number policy. Version 2.6.0 needs to be able to read the files written by 2.5.4, but may silently upgrade the format to something that 2.5.4 cannot read, because the ability to downgrade is not required across a minor number boundary. If your project distributes code libraries for other programs to use, then APIs are a compatibility domain too: you must make sure that source and binary compatibility rules are spelled out in such a way that the informed user need never wonder whether or not it's safe to upgrade in place. She will be able to look at the numbers and know instantly.
gl: Os protocolos cliente/servidor son un dos moitos posibles dominios. Outro é o formato dos datos: o software escribe os datos nun almacenamento permanente? Se o fai, os formatos de lectura e escritura precisan seguir as liñas de compatibilidade prometidas pola política de numeración das versións. A versión 2.6.0 precisa ser capaz de leer os ficheiros escritos coa versión 2.5.4, pero pode silenciosamente actualizar o formato a algo que a 2.5.4 non pode ler, porque a habilidade de volver a unha versión anterior non é requerida máis alá do límite que marca o número menor. Se o teu proxecto distribue bibliotecas de código para que usen outros programas, entón as APIs son un dominio compatible tamén: debes asegurarte de que as regras de compatibilidade de código e binaria son explicadas de forma que o usuario non precise preguntarse se a actualización vai ser segura ou non. Deberá ser capaz de ver os números de versións e sabelo ao instante.

source: In this system, you don't get a chance for a fresh start until you increment the major number. This can often be a real inconvenience: there may be features you wish to add, or protocols that you wish to redesign, that simply cannot be done while maintaining compatibility. There's no magic solution to this, except to try to design things in an extensible way in the first place (a topic easily worth its own book, and certainly outside the scope of this one). But publishing a release compatibility policy, and adhering to it, is an inescapable part of distributing software. One nasty surprise can alienate a lot of users. The policy just described is good partly because it's already quite widespread, but also because it's easy to explain and to remember, even for those not already familiar with it.
gl: Neste sistema, non tes unha oportunidade de partir de cero ata que incrementas o número maior. Isto pode a miudo ser un inconvinte: pode haber funcionalidades que desexas engadir, ou protocolos que desexes rediseñar, que simplemente non poden ser feitos mentres se matén a compatibilidade. Non hai unha solución máxica para isto, agás tentar deseñar as cousas de xeito extensible ao principio (un tema que fácilmente vale para o noso libro, e certamente se escapa do ámbito deste). Pero publicar unha versión compatible, política, e adherirse a ela, e unha parte inescapable da distribución de software. Unha desagradable sorpresa pode distanciar a un montón de usuarios. A política descrita é boa parcialmente porque está bastante extendida, pero tamén porque é facil de explicar e recordar, incluso para aqueles que ainda non está familiarizados con ela.

source: It is generally understood that these rules do not apply to pre-1.0 releases (although your release policy should probably state so explicitly, just to be clear). A project that is still in initial development can release 0.1, 0.2, 0.3, and so on in sequence, until it's ready for 1.0, and the differences between those releases can be arbitrarily large. Micro numbers in pre-1.0 releases are optional. Depending on the nature of your project and the differences between the releases, you might find it useful to have 0.1.0, 0.1.1, etc., or you might not. Conventions for pre-1.0 release numbers are fairly loose, mainly because people understand that strong compatibility constraints would hamper early development too much, and because early adopters tend to be forgiving anyway.
gl: É xeralmente comprendido que estas regras non se aplican as versións previas a 1.0 (ainda que a tua política de versións debería probablemente ser explícita, simplemente para ser clara). Un proxecto que está ainda nun desenvolvemento inicial pode ter versións 0.1, 0.2, 0.3, e así en secuencia, ata que esté lista para a 1.0, e as diferencias entre esas versións poden ser arbitrariamente grandes. Os micro números en versións anteriores a 1.0 son opcionais. Dependendo da natureza do proxecto e das diferencias entre as versións, podes atopar útil ter 0.1.0, 0.1.1, etc, ou pode que non. As convencións para as versións anteriores a 1.0 están bastante perdidas, probablemente porque a xente entende que manter unha forte compatibilidade pode comprometer demasiado o desenvolvemento inicial do proxecto, e porque os que as adoptan tenden a esquecelas de calquera xeito.

source: Remember that all these injunctions only apply to this particular three-component system. Your project could easily come up with a different three-component system, or even decide it doesn't need such fine granularity and use a two-component system instead. The important thing is to decide early, publish exactly what the components mean, and stick to it.
gl: Lembra que todos estes mandamentos son aplicables só a este particular sistema do terceiro compoñente. O teu proxecto podería fácilmente xurdir cun sistema diferente de tres compoñentes, ou incluso decidir que non precisa tanta granuralidade e empregar un sistema con dous compoñentes. O importante é decidir cedo, publicar exáctamente o que os compoñentes queren dicir, e aguantalo.

source: The Even/Odd Strategy
gl: A estratexia Par/Impar

source: Some projects use the parity of the minor number component to indicate the stability of the software: even means stable, odd means unstable. This applies only to the minor number, not the major and micro numbers. Increments in the micro number still indicate bug fixes (no new features), and increments in the major number still indicate big changes, new feature sets, etc.
gl: Algúns proxectos usan a paridade do número menor para indicar a estabilidade do software: par quere dicir estable, impar inestable. Isto aplícase só ao número menor, non ao maior e ao micro. Os incrementos no número micro indican todavía erros arranxados (non novas funcionalidades), e incrementos no número maior indican todavía grandes cambios, novos xogos de funcionalidades, etc.

source: The advantage of the even/odd system, which has been used by the Linux kernel project among others, is that it offers a way to release new functionality for testing without subjecting production users to potentially unstable code. People can see from the numbers that "2.4.21" is okay to install on their live web server, but that "2.5.1" should probably stay confined to home workstation experiments. The development team handles the bug reports that come in from the unstable (odd-minor-numbered) series, and when things start to settle down after some number of micro releases in that series, they increment the minor number (thus making it even), reset the micro number back to "0", and release a presumably stable package.
gl: As vantaxes do sistema par/impar, o cal he empregado polo kernel de Linux entre outros, ofrece unha forma de sacar versións con novas funcionalidades para testear sen que os usuarios teñan que empregar codigo inestable. A xente pode ver polos números que "2.4.21" está ben para instalar no seu servidor web, pero a "2.5.1" debería probablemente permanecer confinada para os seus experimentos locais. O equipo de desenvolvemento manexa os informes de erros que veñen das series inestable (a que ten o número menor impar), e cando as cousas empezan a calmarse despois de varias micro versións nesas series, incrementan o número menor, resetean o número micro a "0", e sacan a versión presumiblemente estable do paquete.

source: This system preserves, or at least, does not conflict with, the compatibility guidelines given earlier. It simply overloads the minor number with some extra information. This forces the minor number to be incremented about twice as often as would otherwise be necessary, but there's no great harm in that. The even/odd system is probably best for projects that have very long release cycles, and which by their nature have a high proportion of conservative users who value stability above new features. It is not the only way to get new functionality tested in the wild, however. <xref linkend="stabilizing-a-release"/><phrase output="printed"> later in this chapter</phrase> describes another, perhaps more common, method of releasing potentially unstable code to the public, marked so that people have an idea of the risk/benefit trade-offs immediately on seeing the release's name.
gl: Este sistema preserva, ou polo menos, non entra en conflicto con, as liñas de compatibilidade dadas anteriormente. Simplemente sobrecarga o número menor con algo de información extra. Isto forza a incrementar o número menor dúas veces tan amiudo como por otra parte sería necesario, pero non hai maior dano en iso. O sistema par/impar é probablemente mellor para proxectos que teñen ciclos de versións moi longos, os cales pola súa natureza teñen unha alta proporción de usuarios fixos quenes valoran máis a estabilidade que as novas funcionalidades. Esta non é a única forma de ter nova funcionalidade probada durante o proceso, sen embargo <xref linkend="stabilizing-a-release"/><phrase output="printed"> máis tarde neste capitulo</phrase> describe outra forma, quizais máis común, un método de sacar versións potencialmente inestables ao público, avisando a xente para que saiban o risco/beneficio inmediatamente ao ver o nome da versión.

source: Release Branches
gl: Organización das versión en ramas

source: From a developer's point of view, a free software project is in a state of continuous release. Developers usually run the latest available code at all times, because they want to spot bugs, and because they follow the project closely enough to be able to stay away from currently unstable areas of the feature space. They often update their copy of the software every day, sometimes more than once a day, and when they check in a change, they can reasonably expect that every other developer will have it within 24 hours.
gl: Dende o punto de vista do desenvolvedor, un proxecto de software libre está sempre nun estado constante de sacar novas versións. Os desenvolvedores normalmente executan sempre a última versión do código, porque eles queren descubrir erros, e porque eles seguen o proxecto o bastante de preto para ser capaces de manterse alexados das areas inestables comúnmente. Eles a miudo actualizan a súa copia do software todos os dias varias veces, e cando chequean un cambio , esperan que razoablemente todos os demais desenvolvedores o teñan en 24 horas.

source: How, then, should the project make a formal release? Should it simply take a snapshot of the tree at a moment in time, package it up, and hand it to the world as, say, version "3.5.0"? Common sense says no. First, there may be no moment in time when the entire development tree is clean and ready for release. Newly-started features could be lying around in various states of completion. Someone might have checked in a major change to fix a bug, but the change could be controversial and under debate at the moment the snapshot is taken. If so, it wouldn't work to simply delay the snapshot until the debate ends, because another, unrelated debate could start in the meantime, and then you'd have wait for <emphasis>that</emphasis> one to end too. This process is not guaranteed to halt.
gl: Como debería entón o proxecto facer unha nova versión formal? Debería simplemente tomar o estado da árbore nun determinado momento, empaquetalo, e entregalo ao mundo, como, por exemplo, versión "3.5.0"? O sentido común dí que non. Primeiro, pode non ser o momento no que o estado da árbore do desenvolvemento esté limpo e preparado para a versión. Funcionalidades novas que se están desenvolvendo poden estar en diferentes estados de desenvolvemento. Alguén pode haber feito un cambio grande para arranxar un erro, pero o cambio podería ser controvertido e estar baixo debate no momento de sacar a versión. Se fose así, deberíase simplemente retrasar a versión ata que o debate remate, porque outro debate non relacionado podería comezar ao mesmo tempo, e entón esperar a que <emphasis>ese </emphasis> debate remate tamén. Este proceso non se garante que pare.

source: In any case, using full-tree snapshots for releases would interfere with ongoing development work, even if the tree could be put into a releasable state. Say this snapshot is going to be "3.5.0"; presumably, the next snapshot would be "3.5.1", and would contain mostly fixes for bugs found in the 3.5.0 release. But if both are snapshots from the same tree, what are the developers supposed to do in the time between the two releases? They can't be adding new features; the compatibility guidelines prevent that. But not everyone will be enthusiastic about fixing bugs in the 3.5.0 code. Some people may have new features they're trying to complete, and will become irate if they are forced to choose between sitting idle and working on things they're not interested in, just because the project's release processes demand that the development tree remain unnaturally quiescent.
gl: En calquera caso, empregar a árbore compreta para facer as versións interferiría no proceso de desenvolvemento en marcha, incluso se a árbore estivese nun punto adecuado para sacar a versión. Dicir este estado será a versión "3.5.0·; presumiblemente, a proxima sería a "3.5.1", e tería a maior parte dos erros atopados na 3.5.0 arranxados. Pero se ambos estados da mesma árbore, que se supón que debería facer un desenvolvedor no periodo entre as dúas versións? Eles non poden engadir novas funcionalidades; as guías de compatibilidade preveñen iso. Pero non todo o mundo estará entusiasmado con arranxar erros no código da 3.5.0. Algunha xente pode ter novas funcionalidades que está tentando completar, e enfadaránse se os forzan a elexir entre non facer nada e traballar en cousas nas que non están interesados, só porque o proceso de lanzamento de versións do proxecto demande que a árbore de desenvolvemento permaneza inactiva.

source: The solution to these problems is to always use a <firstterm>release branch</firstterm>. A release branch is just a branch in the version control system (see <xref linkend="vc-vocabulary-branch"/>), on which the code destined for this release can be isolated from mainline development. The concept of release branches is certainly not original to free software; many commercial development organizations use them too. However, in commercial environments, release branches are sometimes considered a luxury&mdash;a kind of formal "best practice" that can, in the heat of a major deadline, be dispensed with while everyone on the team scrambles to stabilize the main tree.
gl: A solución a estes problemas é empregar sempre unha <firstterm>rama para sacar as versións</firstterm>. Unha rama para sacar as versións é simplemente unha rama no sistema de control de versións (ver <xref linkend="vc-vocabulary-branch"/>), na cal o código destinado para esta versión pode estar illado do desenvolvemento principal. O cocepto de unha rama para as versións certamente non é orixinal do software libre; moitas organizacións comerciais de desenvolvemento a empregan tamén. Sen embargo, en entornos comerciais, as ramas para as versións son as veces consideradas un luxo&mdash; un tipo de "boa práctica" formal que pode, baixo presión por unha data límite, ser prescindible mentras todo o mundo do equipo está traballando para estabilizar a árbore principal.
