Repository: amaneiro/poss-gl
Catalog: po/*/ch07.po
Languages: gl

source: ChangeLog files may be slowly disappearing anyway. They were helpful in the days when CVS was the only choice of version control system, because change data was not easy to extract from CVS. However, with more recent version control systems, the data that used to be kept in the ChangeLog can be requested from the version control repository at any time, making it pointless for the project to keep a static file containing that data&mdash;in fact, worse than pointless, since the ChangeLog would merely duplicate the log messages already stored in the repository.
gl: O ficheiro ChangeLog pode estar desaparecendo de calquera maneira. Eran de moita axuda cando CVS era a única opción de sistema de control de versións, porque a data non era sinxela de extraer. Sen embargo, cos máis recentes sistemas de control de versións, a data que é empregada para manter no ChangeLog pode ser pedida dende o repositorio deo sistema de control de versións en calquera momento, facendo que sea sinxelo para o proxecto manter un ficheiro estático que conteña a data&mdash; de feito, o ChangeLog duplica as mensaxes de log que están no repositorio.

source: The actual layout of the source code inside the tree should be the same as, or as similar as possible to, the source code layout one would get by checking out the project directly from its version control repository. Usually there are a few differences, for example because the package contains some generated files needed for configuration and compilation (see <xref linkend="packaging-build-install"/><phrase output="printed"> later in this chapter</phrase>), or because it includes third-party software that is not maintained by the project, but that is required and that users are not likely to already have. But even if the distributed tree corresponds exactly to some development tree in the version control repository, the distribution itself should not be a working copy (see <xref linkend="vc-vocabulary-working-copy"/>). The release is supposed to represent a static reference point&mdash;a particular, unchangeable configuration of source files. If it were a working copy, the danger would be that the user might update it, and afterward think that he still has the release when in fact he has something different.
gl: A distribución do código fonte dentro da árbore debería ser a mesma, ou o máis similar posible a distribución do código fonte do proxecto chequeando directamente dende o sistema de control de versións. Normalmente hai algunhas diferencias, por exemplo porque o paquete contén algúns ficheiros xerados necesarios para a configuración e compilación (ver <xref linkend="packaging-build-install"/><phrase output="printed"> máis adiante neste capitulo</phrase>, ou porque inclúe software de terceiros non mantido polo proxecto, pero requerido e que os usuarios probablemente non teñen. Pero incluso se a árbore de directorios coincide exáctamente con algunha árbore de desenvolvemento no repositorio do sistema de control de versións, a distribución non debería ser unha copia de traballo (ver <xref linkend="vc-vocabulary-working-copy"/>). A versión supónse que representa unha referencia estática&mdash; en particular, unha configuración inmutable dos ficheiros fonte. Se fose unha copia de traballo, o perigo seria que un usario poida actualizala,pensando que todavia ten a versión cando de feito ten algo distinto.

source: Remember that the package is the same regardless of the packaging. The release&mdash;that is, the precise entity referred to when someone says "Scanley&nbsp;2.5.0"&mdash;is the tree created by unpacking a zip file or tarball. So the project might offer all of these for download:
gl: Recordar que o paquete é o mesmo a pesar do empaquetado. A versión&mdash; iso é, a entidad precisa a que se remite cando algúen di "Scanley&nbsp;2.5.0"&mdash; é a árbore de directorio creada pola descompresión do ficheiro zip ou tarball. Polo tanto o proxecto debe ofrecer todo isto para descargar:

source: ...but the source tree created by unpacking them must be the same. That source tree is the distribution; the form in which it is downloaded is merely a matter of convenience. Certain trivial differences between source packages are allowable: for example, in the Windows package, text files should have lines ending with CRLF (Carriage Return and Line Feed), while Unix packages should use just LF. The trees may be arranged slightly differently between source packages destined for different operating systems, too, if those operating systems require different sorts of layouts for compilation. However, these are all basically trivial transformations. The basic source files should be the same across all the packagings of a given release.
gl: ...pero a árbore de fontes creado polo desempaquetado debe ser o mesmo. Esa árbore de fontes é a distribución; a forma na cal é descargado é simplemente unha conveniencia. Certas triviais diferencias entre os paquetes fontes son permisibles: por exemplo, no paquete de Windows, os ficheiros de texto deben ter liñas finais con CRLF (Carriage Return and Line Feed), mentras que os paquetes Unix deben empregar simplemente LF. As árbores poden ser ordeados lixeiramente de forma diferente entre paquetes software destinados para diferentes sistemas operativos, tamen, se eses sistemas operativos requiren diferentes ordenacións para a compilación. Sen embargo, son transformación básicamente triviais. Os ficheiros fonte básicos deberían ser os memos en tódolos paquetes dunha distribución.

source: To capitalize or not to capitalize
gl: Capitalizar ou non capitalizar

source: When referring to a project by name, people generally capitalize it as a proper noun, and capitalize acronyms if there are any: "MySQL&nbsp;5.0", "Scanley&nbsp;2.5.0", etc. Whether this capitalization is reproduced in the package name is up to the project. Either <filename>Scanley-2.5.0.tar.gz</filename> or <filename>scanley-2.5.0.tar.gz</filename> would be fine, for example (I personally prefer the latter, because I don't like to make people hit the shift key, but plenty of projects ship capitalized packages). The important thing is that the directory created by unpacking the tarball use the same capitalization. There should be no surprises: the user must be able to predict with perfect accuracy the name of the directory that will be created when she unpacks a distribution.
gl: Cando nos referimos a un proxecto polo nome, a xente normalmente o capitaliza coma un nome propio, e capitalizar acrónimos se hai algún: "MySQL&nbsp;5.0", "Scanley&nbsp;2.5.0", etc. Se esta capitalización é reproducida no nome do paquete esta no proxecto. Tanto <filename>Scanley-2.5.0.tar.gz</filename> estaría ben, por exemplo (Eu persoalmente prefiro a última, porque non me gusta que a xente empregue a tecla shift, pero moitos proxectos capitalizan os paquetes). A cousa importante é que o directorio creado despois de desempaquetar o tarball usa a mesma capitalización. Non debería haber sorpresas: o usuario debe ser capaz de predecir perfectamente o nome do directorio que será creado cando desempaquete a distribución.

source: Pre-releases
gl: Pre-versións

source: When shipping a pre-release or candidate release, the qualifier is truly a part of the release number, so include it in the name of the package's name. For example, the ordered sequence of alpha and beta releases given earlier in <xref linkend="release-number-components"/> would result in package names like this:
gl: Cando se saca unha pre-versión ou versión candidata, o cualificador é verdaderemente parte do número de versión, polo tanto inclúese no nome do paquete. Por exemplo, a secuencia ordeada das versións alpha e beta vista antes en <xref linkend="release-number-components"/> resultaría nos nomes de paquete así:

source: The first would unpack into a directory named <filename>scanley-2.3.0-alpha1</filename>, the second into <filename>scanley-2.3.0-alpha2</filename>, and so on.
gl: O primeiro que se desempaquetaria nun directorio chamado <filename>scanley-2.3.0-alpha1</filename>, o segundo dentro <filename>scanley-2.3-0-alpha2</filename>, e así.

source: Compilation and Installation
gl: Compilación e Instalación

source: For software requiring compilation or installation from source, there are usually standard procedures that experienced users expect to be able to follow. For example, for programs written in C, C++, or certain other compiled languages, the standard under Unix-like systems is for the user to type:
gl: Para software que require compilación ou instalación dende as fontes, hai normalmente varios procedementos estándar que usuarios experimentados esperan ser capaces de seguir. Por exemplo, para programas escritos en C, C++, ou outros certos linguaxes compilados, o estandar baixo sistemas operativos tipo Unix é para o usuario teclear:

source: The first command autodetects as much about the environment as it can and prepares for the build process, the second command builds the software in place (but does not install it), and the last command installs it on the system. The first two commands are done as a regular user, the third as root. For more details about setting up this system, see the excellent <citetitle>GNU Autoconf, Automake, and Libtool</citetitle> book by Vaughan, Elliston, Tromey, and Taylor. It is published as treeware by New Riders, and its content is also freely available online at <ulink url="http://sources.redhat.com/autobook/"></ulink>.
gl: O primeiro comando tanto detecta o entorno como o pode preparar para o proceso de compilación, o segundo comando compila o software no sitio (pero non o instala), e o último comando instalao no sistema. Os dous primeiros comando fanse como usuario normal, o terceiro como root. Para máis detalles acerca da configuración deste sistema, vexa o excelente libro <citetitle>GNU Autoconf, Automake, and Libtool</citetitle> escrito por Vaughan, Eliston, Tromey e Taylor. Está publicado como treeware por New Riders, e o seu contido está dispoñible gratuitamente online en <ulink url="http://sources.redhat.com/autobook/"></ulink>.

source: This is not the only standard, though it is one of the most widespread. The Ant (<ulink url="http://ant.apache.org/"></ulink>) build system is gaining popularity, especially with projects written in Java, and it has its own standard procedures for building and installing. Also, certain programming languages, such as Perl and Python, recommend that the same method be used for most programs written in that language (for example, Perl modules use the command <command>perl&nbsp;Makefile.pl</command>). If it's not obvious to you what the applicable standards are for your project, ask an experienced developer; you can safely assume that <emphasis>some</emphasis> standard applies, even if you don't know what it is at first.
gl: Este non é o único estándar, pero é un dos máis extendidos. O sistema de compilación Ant (<ulink url="http://ant.apache.org/"></ulink>) está gañando popularidade, especialmente nos proxectos escritos en Java, e ten os seus propios procesos de compilación e instalación. Ademáis, certos linguaxes de programación como Perl e Pyton, recomendan que ese mismo método sexa empregado por máis programas escritos en esa linguaxe (por exemplo, os módulos Perl empregan o comando <command>perl&nbsp;Makefile.pl</command>). Se non é obvio para ti que estándar aplicar para o teu proxecto, pregunta a un desenvolvedor experimentado; podes asumir con seguridade que se aplica <emphasis>algún</emphasis> estándar, incluso se non sabes cal é ao principio.

source: Whatever the appropriate standards for you project are, don't deviate from them unless you absolutely must. Standard installation procedures are practically spinal reflexes for a lot of system administrators now. If they see familiar invocations documented in your project's <filename>INSTALL</filename> file, that instantly raises their faith that your project is generally aware of conventions, and that it is likely to have gotten other things right as well. Also, as discussed in <xref linkend="downloads"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>, having a standard build procedure pleases potential developers.
gl: Sexa cal sexa o estándar apropiado para o teu proxecto, non te desvies del a menos que debas facelo. Os procesos estándar de instalación son practicamente a columna vertebral para moitos administradores de sistemas agora. Se ven invocacións familiares documentadas no ficheiro <filename>INSTALL</filename> do teu proxecto, iso fará que instantáneamente incrementen a súa fe en que o teu proxecto segue as convencións, e que probablemente outras cousas tamén están ben. Ademáis, como discutimos <xref linkend="downloads"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>, ter un proceso estándar de compilación complace aos potenciais desenvolvedores.

source: On Windows, the standards for building and installing are a bit less settled. For projects requiring compilation, the general convention seems to be to ship a tree that can fit into the workspace/project model of the standard Microsoft development environments (Developer Studio, Visual Studio, VS.NET, MSVC++, etc.). Depending on the nature of your software, it may be possible to offer a Unix-like build option on Windows via the Cygwin (<ulink url="http://www.cygwin.com/"></ulink>) environment. And of course, if you're using a language or programming framework that comes with its own build and install conventions&mdash;e.g., Perl or Python&mdash;you should simply use whatever the standard method is for that framework, whether on Windows, Unix, Mac OS X, or any other operating system.
gl: En Windows, o estandares para compilar e instalar están menos asentados. Para proxectos que requiren compilación, a convención xeral parace ser navegar por unha árbore que pode encaixar dentro do espacio de traballo/modelo do proxecto do entorno de desenvolvemento estándar de Microsoft (Developer Studio, Visual Studio, VS.NET, MSVC++, etc). Dependendo da natureza do teu software, pode ser posible ofrecer a opción dun sistema de compilación tipo Unix sobre Windows via o entorno Cygwin (<ulink url="http://www.cygwin.com/"></ulink>). E por suposto, se estás empregando unha linguaxe ou framework de programación que veña coa sua propia convención&mdash; para compilar e instalar;por exemplo, Perl ou Python&mdash;simplemente deberias usar o método estándar para ese framework, sexa en Windows, Unix, Mac OS X, ou calquera outro sistema operativo.

source: Be willing to put in a lot of extra effort in order to make your project conform to the relevant build or installation standards. Building and installing is an entry point: it's okay for things to get harder after that, if they absolutely must, but it would be a shame for the user's or developer's very first interaction with the software to require unexpected steps.
gl: Estea disposto a poñer un esforzo extra para construir o teu proxecto conforme a un relevante estándar de compilación ou instalación. Compilación e instalación é un punto de entrada: está ben para as cousas que se fan máis duras despois de iso, se deben, pero sería unha pena para os usuarios e desenvolvedores que a primeira interacción co software requerise pasos inesperados.

source: Binary Packages
gl: Paquetes Binarios

source: Although the formal release is a source code package, most users will install from binary packages, either provided by their operating system's software distribution mechanism, or obtained manually from the project web site or from some third party. Here "binary" doesn't necessarily mean "compiled"; it just means any pre-configured form of the package that allows a user to install it on his computer without going through the usual source-based build and install procedures. On RedHat GNU/Linux, it is the RPM system; on Debian GNU/Linux, it is the APT (<filename>.deb</filename>) system; on MS Windows, it's usually <literal>.MSI</literal> files or self-installing <literal>.exe</literal> files.
gl: Ainda que a formal normal dunha versión é un paquete de código fonte, moitos usuarios instalarana dende paquetes binarios, provistos polo mecanismo de distribución de software do seu sistema operativo, ou obtido manualmente dende a páxina web do proxeto ou dende terceiros. Aquí "binario" non necesariamente significa "compilado"; simplemente significa algunha forma de paquete que permite ao usuario instalalo na computadora se pasar polo proceso de compilar e instalar as fontes. En RedHat GNU/Linux, é o sistema RPM; en Debian GNU/Linux, é o sistema APT (<filename>.deb</filename>); en MS Windows, xeralmente ficheiros <literal>.MSI</literal> ou auto-instalables <literal>.exe</literal>.

source: Whether these binary packages are assembled by people closely associated with the project, or by distant third parties, users are going to <emphasis>treat</emphasis> them as equivalent to the project's official releases, and will file issues in the project's bug tracker based on the behavior of the binary packages. Therefore, it is in the project's interest to provide packagers with clear guidelines, and work closely with them to see to it that what they produce represents the software fairly and accurately.
gl: Independentemente de si estes paquetes binarios son empaquetados por xente vinculada ao proxecto, ou por terceiros, os usuarios <emphasis>trataranos</emphasis> como se fosen oficiais, e farán cuestións no bug tracker do proxecto basadas no comportamento deses paquetes binarios. Polo tanto, redunda no beneficio do proxecto proveer guias claras para os empaquetadores, e traballar con eles para ver se isto representa beneficios no software.

source: The main thing packagers need to know is that they should always base their binary packages on an official source release. Sometimes packagers are tempted to pull a later incarnation of the code from the repository, or include selected changes that were committed after the release was made, in order to provide users with certain bug fixes or other improvements. The packager thinks he is doing his users a favor by giving them the more recent code, but actually this practice can cause a great deal of confusion. Projects are prepared to receive reports of bugs found in released versions, and bugs found in recent trunk and major branch code (that is, found by people who deliberately run bleeding edge code). When a bug report comes in from these sources, the responder will often be able to confirm that the bug is known to be present in that snapshot, and perhaps that it has since been fixed and that the user should upgrade or wait for the next release. If it is a previously unknown bug, having the precise release makes it easier to reproduce and easier to categorize in the tracker.
gl: O máis importante que os empaquetadores precisan saber é que eles deben sempre basarse en versións oficiasi para facer os seus paquetes binarios. Algunhas veces os empaquetadores están tentados de facer cambios no código, ou incluir cambios que foron comiteados despois de estar feita a versión, para proveer aos usuarios de certas melloras. O empaquetador pensa que lles está a facer un grande favor aos usuarios dándolles a última versión do código, pero de feito esta práctica causa unha grande confusión. Os proxectos están preparados para recibir reportes de erros atopados en versións lanzadas, na rama principal e en recentes ramas (isto é, atopados por xente que deliberádamente executa este código). Cando un erro reportado ven destas fontes, o que responde a miudo é capaz de confirmar se ese bug coñecido está presente en esa versión, e quizais xa foi arranxado e o usuario debería actualizar ou esperar a seguinte versión. Se é un erro descoñecido previamente, tendo a versión precisa fai máis sinxelo reproducilo e categorizalo.

source: Projects are not prepared, however, to receive bug reports based on unspecified intermediate or hybrid versions. Such bugs can be hard to reproduce; also, they may be due to unexpected interactions in isolated changes pulled in from later development, and thereby cause misbehaviors that the project's developers should not have to take the blame for. I have even seen dismayingly large amounts of time wasted because a bug was <emphasis>absent</emphasis> when it should have been present: someone was running a slightly patched up version, based on (but not identical to) an official release, and when the predicted bug did not happen, everyone had to dig around a lot to figure out why.
gl: Os proxectos non están preparados, sen embargo, para recibir erros reportados basados en versións intermedias non especificicadas ou híbridas. Moitos erros poden ser difíciles de reproducir; ademáis, poden ser debidos a inesperadas interacións en cambios incorporados máis tardes no desenvolvementos, e dese modo causar malos comportamentos que os desenvolvedores do proxecto poden no ter culpa. Eu teño visto con consternación moito tempo perdido por culpa dun bug <emphasis>ausente</emphasis> cando debería estar presente: alguén estaba executando unha versión parcheada, basada (pero non idéntica) nuncha versión oficial, e cando o erro predecido non sucedeu, todo o mundo tiña que excarvar arredor averiguando o porque.
