Repository: amaneiro/poss-gl
Catalog: po/*/ch07.po
Languages: gl

source: Release branches are pretty much required in open source projects, however. I have seen projects do releases without them, but it has always resulted in some developers sitting idle while others&mdash;usually a minority&mdash;work on getting the release out the door. The result is usually bad in several ways. First, overall development momentum is slowed. Second, the release is of poorer quality than it needed to be, because there were only a few people working on it, and they were hurrying to finish so everyone else could get back to work. Third, it divides the development team psychologically, by setting up a situation in which different types of work interfere with each other unnecessarily. The developers sitting idle would probably be happy to contribute <emphasis>some</emphasis> of their attention to a release branch, as long as that were a choice they could make according to their own schedules and interests. But without the branch, their choice becomes "Do I participate in the project today or not?" instead of "Do I work on the release today, or work on that new feature I've been developing in the mainline code?"
gl: As ramas para as versións son moito máis requeridas nos proxectos de software libre, sen embargo teño visto proxectos sacar versións sen elas, pero sempre resulta haber algúns desenvolvedores sen facer nada mentras outros&mdash;normalmente unha minoría&mdash; traballa para sacar a versión. O resultado soe ser malo en varias formas. Primeiro, o desenvolvemento xeral é relantizado. Segundo, a versión ten menos calidades da que precisa ter, porque só un número pequeno de xente traballa nela, e eles están apurando para que o resto poida volver ao traballo. Terceiro, divide o equipo de desenvolvemento sicoloxicamente, creando una situación onde diferentes tipos de traballo interfiren con outros innecesariamente. Os desenvolvedores parados probablemente estarían máis contentos contribuíndo <emphasis>con algo</emphasis> da súa atención a rama da versión, siempre que fuera una elección acorde con su propio horario e intereses. Pero sen a rama, a súa elección convírtese en "Participo no proxecto hoxe ou non?" no canto de "Traballo na nova versión hoxe ou nunha nova funcionalidade que estou a desenvolver no código princiapl?"

source: Mechanics of Release Branches
gl: Mecanismos das Ramas para as Versións

source: The exact mechanics of creating a release branch depend on your version control system, of course, but the general concepts are the same in most systems. A branch usually sprouts from another branch or from the trunk. Traditionally, the trunk is where mainline development goes on, unfettered by release constraints. The first release branch, the one leading to the "1.0" release, sprouts off the trunk. In CVS, the branch command would be something like this
gl: Os mecanismos exactos para a creación da rama para as versións dependen do teu sistema de control de versións, por suposto, pero en xeral os conceptos son iguais na maioría dos sistemas. Unha rama, normalmente brota de outra rama ou do trunk. Tradicionalmente, o trunk é onde se fai o desenvolvemento principal, sen as limitacións da versión. A primeira rama para as versións, a guidada a ser a "1.0", brota do trunk. En CVS, o comando branch sería algo coma isto

source: or in Subversion, like this:
gl: ou en Subversion, así:

source: (All these examples assume a three-component release numbering system. While I can't show the exact commands for every version control system, I'll give examples in CVS and Subversion and hope that the corresponding commands in other systems can be deduced from those two.)
gl: (Todos estes exemplos asumen un sistema de numeración das versións de tres compoñentes. Ainda que non podo mostrar os comando exactos para cada sistema de control de versións, dareí exemplos en CVS e Subversion e espero que os correspondentes comandos en outros sistemas poidan ser deducidos destes dous.

source: Notice that we created branch "1.0.x" (with a literal "x") instead of "1.0.0". This is because the same minor line&mdash;i.e., the same branch&mdash;will be used for all the micro releases in that line. The actual process of stabilizing the branch for release is covered in <xref linkend="stabilizing-a-release"/><phrase output="printed"> later in this chapter</phrase>. Here we are concerned just with the interaction between the version control system and the release process. When the release branch is stabilized and ready, it is time to tag a snapshot from the branch:
gl: Nótese que creamos a rama "1.0.x" (con un literal "x") no canto de "1.0.0". Isto é porque a mesma liña menor&mdash;i.e., a mesma rama&mdash; será empregada por todas as micro versións nesa liña. O proceso actual de estabilizar a rama para as versións esta cuberto en <xref linkend="stabilizing-a-release"/><phrase output="printed"> máis tarde neste capítulo</phrase>. Aquí preocuparemonos coa interacción entre o sistema de control de versións e o proceso de sacar a versión. Cando a rama das versións está estabilizada e preparada, é hora de etiquetar o estado da rama:

source: <para>or</para>
gl: <para>ou</para>

source: That tag now represents the exact state of the project's source tree in the 1.0.0 release (this is useful in case anyone ever needs to get an old version after the packaged distributions and binaries have been taken down). The next micro release in the same line is likewise prepared on the 1.0.x branch, and when it is ready, a tag is made for 1.0.1. Lather, rinse, repeat for 1.0.2, and so on. When it's time to start thinking about a 1.1.x release, make a new branch from trunk:
gl: Esa tag representa agora exáctamente o estado da árbore de código do proxecto na versión 1.0.0 (isto é útil no caso de que alguén precise obter unha versión vella despois de que os paquetes e binarios foran eliminados). A seguinte micro versión na mesma liña é asimesmo preparada na rama 1.0, e cando esté preparada, faise unha etiqueta para a 1.0.1. Enxabonar, enjuagar, repetir para a 1.0.2, e continuar. Cando sexa tempo de empezar a pensar sobre a serie 1.1.x, crear unha nova rama dende o trunk:

source: Maintenance can continue in parallel along both 1.0.x and 1.1.x, and releases can be made independently from both lines. In fact, it is not unusual to publish near-simultaneous releases from two different lines. The older series is recommended for more conservative site administrators, who may not want to make the big jump to (say) 1.1 without careful preparation. Meanwhile, more adventurous people usually take the most recent release on the highest line, to make sure they're getting the latest features, even at the risk of greater instability.
gl: O mantemento pode continuar en paralelo sobre a 1.0.x e a 1.1.x, e as versións poden ser feitas independentemente dende as dúas liñas de feito, non é inusual publicar casi simultáneamente dende dúas liñas diferentes. As vellas series están recomendadas para os administradores máis conservadores, os cales poden non querer dar o salto a 1.1 sen unha cuidadosa preparación. Mentras tanto, a xente máis aventureira normalmente collen a versión máis recente da maior liña, para estar seguros the ter as últimas funcionalidades, incluso co risco da maior inestabilidade.

source: This is not the only release branch strategy, of course. In some circumstances it may not even be the best, though it's worked out pretty well for projects I've been involved in. Use any strategy that seems to work, but remember the main points: the purpose of a release branch is to isolate release work from the fluctuations of daily development, and to give the project a physical entity around which to organize its release process. That process is described in detail in the next section.
gl: Esta non é a única estratexia para facer ramas, por suposto. En algunhas circunstancias incluso pode non ser a mellor, pero está funcionando bastante ben para proxectos nos que estiven envolto. Emprega calquera estratexia que parece que funciona, pero recorda os puntos principais: o propósito das ramas é illar a versión para liberar dos cambios do desenvolvemento diario, e darlle ao proxecto unha entidade física coa que organizar os seus procesos de lanzamento de versións. Ese proceso é descrito con detalle na seguinte sección.

source: Stabilizing a Release
gl: Estabilizando unha Versión

source: <firstterm>Stabilization</firstterm> is the process of getting a release branch into a releasable state; that is, of deciding which changes will be in the release, which will not, and shaping the branch content accordingly.
gl: <firstterm>Estabilización</firstterm> é o proceso de poñer a rama da nova versión nun estado axeitado para sacala; isto é, decidir que cambios irán na versión, cales non, e darlle forma ao contido da rama.

source: There's a lot of potential grief contained in that word, "deciding". The last-minute feature rush is a familiar phenomenon in collaborative software projects: as soon as developers see that a release is about to happen, they scramble to finish their current changes, in order not to miss the boat. This, of course, is the exact opposite of what you want at release time. It would be much better for people to work on features at a comfortable pace, and not worry too much about whether their changes make it into this release or the next one. The more changes one tries to cram into a release at the last minute, the more the code is destabilized, and (usually) the more new bugs are created.
gl: Hai unha chea de dolor potencial contido nesa palabra, "decidir". As funcionalidades de último minuto son un fenómeno familiar en proxectos colaborativos de software: tan pronto como os desenvolvedores ven que unha versión está a punto de sacarse, codifican para rematar os seus cambios actuais, para non perder o barco. Isto, por suposto, é exactamente o oposto ao que ti queres nese momento. E moito mellor para a xente traballar nas funcionalidades do xeito máis confortable posible, e non preocuparse se os seus cambios van a ir nesta versión ou na seguiente. Cantos máis cambios de último minuto intentemos meter na versión, máis desestabilizado, e (xeralmente) máis erros serán introducidos.

source: Most software engineers agree in theory on rough criteria for what changes should be allowed into a release line during its stabilization period. Obviously, fixes for severe bugs can go in, especially for bugs without workarounds. Documentation updates are fine, as are fixes to error messages (except when they are considered part of the interface and must remain stable). Many projects also allow certain kinds of low-risk or non-core changes to go in during stabilization, and may have formal guidelines for measuring risk. But no amount of formalization can obviate the need for human judgement. There will always be cases where the project simply has to make a decision about whether a given change can go into a release. The danger is that since each person wants to see their own favorite changes admitted into the release, then there will be plenty of people motivated to allow changes, and not enough people motivated to bar them.
gl: A maioría dos enxeñeiros de software están dacordo en teoría con acordar os criterios sobre que cambios deberían ser permitidos dentro da liña da versión durante o periodo de estabilización. Obviamente, resolver erros graves deben ir, especialmente para erros con solucións parciais. Actualizacións de documentación pódense facer, se son para arranxar mensaxes de erro (excepto cando son consideradas parte da interfaz e deben permanecer estables). Moitos proxectos ademais permiten certos tipos de riscos baixos ou cambios que non sexan na parte central durante a estabilización, e poden ter pautas para minimizar o risco. Pero a cantidade de formalización non pode obviar a necesidade de xuizo humán. Sempre haberá casos donde o proxecto simplemente teña que tomar unha decisión sobre se un cambio debe ir na versión ou non. O perigo está en que cada persoa quere ver os seus cambios favoritos admitidos na versión, entón haberá milleiros de xente motivada para permitir cambios, e non suficiente xente motivada para excluilos.

source: Thus, the process of stabilizing a release is mostly about creating mechanisms for saying "no". The trick for open source projects, in particular, is to come up with ways of saying "no" that won't result in too many hurt feelings or disappointed developers, and also won't prevent deserving changes from getting into the release. There are many different ways to do this. It's pretty easy to design systems that satisfy these criteria, once the team has focused on them as the important criteria. Here I'll briefly describe two of the most popular systems, at the extreme ends of the spectrum, but don't let that discourage your project from being creative. Plenty of other arrangements are possible; these are just two that I've seen work in practice.
gl: Por tanto, o proceso de estabilizar unha versión é máis sobre crear mecanismos para decir "non". O truco para os proxectos de software libre, en particular, é atopar formas de dicir "non" sen que o resultado sexan moitos sentimentos feridos o desenvolvedores decepcionados, e sen desmerecer cambios para a versión. Hay distintas formas de facer isto. É bastante sinxelo designar sistemas que satisfagan estes criterios, unha vez que o equipo está enfocado na importancia dos criterios. Aqui describirei brevemente dous dos máis populares sistemas, no extremo final do expectro, pero non permitas o desanimo no teu proxecto por ser creativo. Moitos outros arranxos son posibles; estes son só dous que eu vín na practica.

source: Dictatorship by Release Owner
gl: Réxime ditactorial do mantenedor

source: The group agrees to let one person be the <firstterm>release owner</firstterm>. This person has final say over what changes make it into the release. Of course, it is normal and expected for there to be discussions and arguments, but in the end the group must grant the release owner sufficient authority to make final decisions. For this system to work, it is necessary to choose someone with the technical competence to understand all the changes, and the social standing and people skills to navigate the discussions leading up to the release without causing too many hurt feelings.
gl: O grupo está dacordo con permitir a unha persoa ser o <firstterm>propietario da versión</firstterm>. Esta persoa ten a derradeira palabra sobre os cambios que van na versión. Por suposto, é normal e esperado que haxa discusións, pero ao final o grupo debe garantizarlle ao propietario da versión suficiente autoridade para tomar as decisións finais. Para que este sistema funcione, é preciso elexir a alguén o suficientemente competente técnicamente para comprender tódolos cambios, e con habilidades sociais para navegar nas discusións e sacar a versión sen ferir demasiados sentimentos.

source: A common pattern is for the release owner to say "I don't think there's anything wrong with this change, but we haven't had enough time to test it yet, so it shouldn't go into this release." It helps a lot if the release owner has broad technical knowledge of the project, and can give reasons why the change could be potentially destabilizing (for example, its interactions with other parts of the software, or portability concerns). People will sometimes ask such decisions to be justified, or will argue that a change is not as risky as it looks. These conversations need not be confrontational, as long as the release owner is able to consider all the arguments objectively and not reflexively dig in his heels.
gl: Un patrón común para o propietario da versión é decir "Non penso que haxa nada malo con este cambio, pero non temos suficiente tempo para probalo, así que non debería ir nesta versión". Axuda moito se o propietario da versión ten un bo coñecemento técnico do proxecto, e pode dar razóns de porque o cambio podería ser potencialmente desestabilizante (por exemplo, as súas iteracións con outras partes do software, ou portabilidades). A xente pedirá algunhas veces que se xustifiquen as decisións, ou argumentará que un cambio non é tan arriscado como parece. Estas conversacións precisan non ser confrontacións, sempre e cando o propietario da versión poida considerar todos os argumentos obxectivamente e non ser intransixente.

source: Note that the release owner need not be the same person as the project leader (in cases where there is a project leader at all; see <xref linkend="benevolent-dictator"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase>). In fact, sometimes it's good to make sure they're <emphasis>not</emphasis> the same person. The skills that make a good development leader are not necessarily the same as those that make a good release owner. In something as important as the release process, it may be wise to have someone provide a counterbalance to the project leader's judgement.
gl: Nótese que o propietario da versión precisa non ser a mesma persoa que o lider do proxecto (en casos onde non hai lider do proxecto; ver <xref linkend="benevolent-dictator"/><phrase output="printed">en<xref linkend="social-infrastructure"/>). De feito, algunhas veces é bo asegurarse que eles </phrase>non<emphasis> son a mesma persoa. As habilidades que fan a un desenvolvedor lider non teñen porque ser necesariamente as mesmas que o fan o propietario da versión. Nalgo tan importante como o lanzamento dunha versión, pode ser prudente ter alguén que poña un contrapeso á opinión do lider.

source: Contrast the release owner role with the less dictatorial role described in <xref linkend="release-manager"/><phrase output="printed"> later in this chapter</phrase>.
gl: Contraste o rol do propietario da versión co de menos dictatorial descrito en <xref linkend="release-manager"/><phrase output="printed"> mais tarde neste capítulo</phrase>.

source: Change Voting
gl: Cambio de voto

source: At the opposite extreme from dictatorship by release owner, developers can simply vote on which changes to include in the release. However, since the most important function of release stabilization is to <emphasis>exclude</emphasis> changes, it's important to design the voting system in such a way that getting a change into the release involves positive action by multiple developers. Including a change should need more than just a simple majority (see <xref linkend="electorate"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase>). Otherwise, one vote for and none against a given change would suffice to get it into the release, and an unfortunate dynamic would be set up whereby each developer would vote for her own changes, yet would be reluctant to vote against others' changes, for fear of possible retaliation. To avoid this, the system should be arranged such that subgroups of developers must act in cooperation to get any change into the release. This not only means that more people review each change, it also makes any individual developer less hesitant to vote against a change, because she knows that no particular one among those who voted for it would take her vote against as a personal affront. The greater the number of people involved, the more the discussion becomes about the change and less about the individuals.
gl: No extremo oposto da dictadura do propietario da versión, os desenvolvedores poden simplemente votar que cambios incluir na versión. Sen embargo, xa que a función máis importante da estabilización da versión é <emphasis>excluir</emphasis> cambios, é importante deseñar o sistema de votación de forma que poñer un cambio na versión implique accións positivas para moitos desenvolvedores. Incluir un cambio deberia precisar máis dunha simple maioría (ver <xref linkend="electorate"/><phrase output="printed"> en <xref linkend="social-infrastructure"/></phrase>). De outro xeito, un voto a favor e ningún en contra para un cambio sería suficiente para poñer un cambio na versión, e unha desafortunada dinámica podería ser creada polo cal cada desenvolvedor votaría polos seus propios cambios, sen embargo serían reacios a votar en contra dos cambios de outros desenvolvedores por medo a posibles represalias. Para evitar isto, o sistema debería organizar que subgrupos de desenvolvedores deben actuar en cooperación para poñer calquera cambio na versión. Isto non so significa que moita xente revise cada cambio, ademáis fai que calquera desenvolvedor dubide menos para votar en contra dun cambio, porque non coñece particularmente ningún dos que votaron porque tomaría o se voto en contra coma unha afrenta persoal. Canto maior sexa o número de xente involucrada, máis se discutirá sobre os cambios e menos sobre os individuos.

source: The system we use in the Subversion project seems to have struck a good balance, so I'll recommend it here. In order for a change to be applied to the release branch, at least three developers must vote in favor of it, and none against. A single "no" vote is enough to stop the change from being included; that is, a "no" vote in a release context is equivalent to a veto (see <xref linkend="veto"/>). Naturally, any such vote must be accompanied by a justification, and in theory the veto could be overridden if enough people feel it is unreasonable and force a special vote over it. In practice, this has never happened, and I don't expect that it ever will. People are conservative around releases anyway, and when someone feels strongly enough to veto the inclusion of a change, there's usually a good reason for it.
gl: O sistema que empregamos no proxecto Subversion parece que acadou un bo balance, polo que o recomendarei aquí. Co fin de que un cambio sexa aplicado na rama da versión, polo menos tres desenvolvedores deben votar a favor, e ningún en contra. Un simple voto "en contra" é suficiente para deter a aplicación dun cambio; iso é, un voto "en contra" no contexto da versión equivale a un veto (ver<xref linkend="veto"/>). Naturalmente, calquera voto debe ir acompañado dunha xustificación, e en teoría o veto podería ser invalidado se suficiente xente sinte que é razonable e forza un voto especial sobre iso. Na práctica, isto nunca sucede, e non espero que pase. A xente é conservativa acerca das versións de calquera modo, e cando alguén sinte fortemente a necesidade de vetar a inclusión dun cambio, normalente hai unha boa razón para iso.
