Repository: amaneiro/poss-gl
Catalog: po/*/ch07.po
Languages: gl

source: Still, there will sometimes be circumstances when a packager insists that modifications to the source release are necessary. Packagers should be encouraged to bring this up with the project's developers and describe their plans. They may get approval, but failing that, they will at least have notified the project of their intentions, so the project can watch out for unusual bug reports. The developers may respond by putting a disclaimer on the project's web site, and may ask that the packager do the same thing in the appropriate place, so that users of that binary package know what they are getting is not exactly the same as what the project officially released. There need be no animosity in such a situation, though unfortunately there often is. It's just that packagers have a slightly different set of goals from developers. The packagers mainly want the best out-of-the-box experience for their users. The developers want that too, of course, but they also need to ensure that they know what versions of the software are out there, so they can receive coherent bug reports and make compatibility guarantees. Sometimes these goals conflict. When they do, it's good to keep in mind that the project has no control over the packagers, and that the bonds of obligation run both ways. It's true that the project is doing the packagers a favor simply by producing the software. But the packagers are also doing the project a favor, by taking on a mostly unglamorous job in order to make the software more widely available, often by orders of magnitude. It's fine to disagree with packagers, but don't flame them; just try to work things out as best you can.
gl: Todavía, haberá as veces circunstancias nas que un empaquetador insiste en que é necesario modificar o código da versión. Os empaquetadores deberían ser animados a plantexar isto aos desenvolvedores do proxecto e describir os seus plans. Poden obter aprovación, pero se non, a lo menos notificarán ao proxecto das suas intencións, polo que o proxecto pode observar informes de erros inusuais. Os desenvolvedores poden resoponder poñendo unha nota de descargo de responsabilidade na páxina web do proxecto, e pedir ao empaquetador que faga o mesmo no lugar adecuado, para que os usuarios no paquete binario sepan que o que están obtendo non é exactamente o mesmo que a versión oficial do proxecto. Non hai que ter rencor por esta situación o que desafortunadamente pasa a miudo. O que pasa simplemente é que o empaquetador ten obxectivos lixeiramente distintos aos desenvolvedores. Normalmente os empaquetadores queren a mellor experiencia de serie posible para os seus usuarios. Os desenvolvedores queren iso tamén, por suposto, pero necesitan asegurarse tamén de que coñecen o que contén a versión para que no caso de recibir reportes de bugs e asegurar a compatibilidade. Algunhas veces os obxetivos entran en conflicto. Cando isto pasa, é bo ter en mente que o proxecto non ten control sobre os empaquetadores. E certo que o proxecto fai un favor aos empaquetadores producindo o software. Pero os empaquetadores están tamén facendo un favor ao proxecto, facendo o software dispoñible, a miudo en ordes de magnitude maiores. Está ben estar en desacordo cos empaquetadores, pero non entrar en conflicto con eles, simplemente trata de facer as cousas o mellor que poidas.

source: Testing and Releasing
gl: Probas e Publicación das Versións

source: Once the source tarball is produced from the stabilized release branch, the public part of the release process begins. But before the tarball is made available to the world at large, it should be tested and approved by some minimum number of developers, usually three or more. Approval is not simply a matter of inspecting the release for obvious flaws; ideally, the developers download the tarball, build and install it onto a clean system, run the regression test suite (see <xref linkend="automated-testing"/>)<phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>, and do some manual testing. Assuming it passes these checks, as well as any other release checklist criteria the project may have, the developers then digitally sign the tarball using GnuPG (<ulink url="http://www.gnupg.org/"></ulink>), PGP (<ulink url="http://www.pgpi.org/"></ulink>), or some other program capable of producing PGP-compatible signatures.
gl: Unha vez que o tarball das fontes é producido dende a rama da versión establilizada, comeza a parte pública do proceso de sacar a versión. Pero antes de que o tarball estea dispoñible para o mundo, debería ser testeado e aprobado por un mínimo de desenvolvedores, normalmente tres ou máis. Aprobado non é simplemente inspeccionar a versión en busca de simples defectos; idealmente, os desenvolvedores baixan o tarball, compila e o instalan nun sistema limpo, lanzan os test de regresión (ver <xref linkend="automated-testing"/><phrase output="printed"> en <xref linkend="managing-volunteers"/></phrase>, e fan algo de test manual. Asumindo que pasa eses tests, como calquera outro que a versión pode ter a criterio do proxecto, os desenvolvedores asinan o tarball empregando GnuPG (<ulink url="http://www.gnupg.org/"></ulink>), PGP (<ulink url="http://www.pgpi.org/"></ulink>), o algún outro programa que produza sinatura PGP compatibles.

source: In most projects, the developers just use their personal digital signatures, instead of a shared project key, and as many developers as want to may sign (i.e., there is a minimum number, but not a maximum). The more developers sign, the more testing the release undergoes, and also the greater the likelihood that a security-conscious user can find a digital trust path from herself to the tarball.
gl: En moitos proxectos, os desenvolvedores simplemente usan as suas sinaturas dixitais, no canto de compartir a chave do proxecto, e como moitos desenvolvedores queren poder asinar (por exemplo, hai un número mínimo, pero non máximo). Canto máis desenvolvedores asinen, máis testeo se fai na versión, e ademáis máis grande a posibilidade de que un consciente-seguro usuario pode atopar un camiño dixitalmente seguro entre el e o tarball.

source: Once approved, the release (that is, all tarballs, zip files, and whatever other formats are being distributed) should be placed into the project's download area, accompanied by the digital signatures, and by MD5/SHA1 checksums (see <ulink url="http://en.wikipedia.org/wiki/Cryptographic_hash_function"></ulink>). There are various standards for doing this. One way is to accompany each released package with a file giving the corresponding digital signatures, and another file giving the checksum. For example, if one of the released packages is <filename>scanley-2.5.0.tar.gz</filename>, place in the same directory a file <filename>scanley-2.5.0.tar.gz.asc</filename> containing the digital signature for that tarball, another file <filename>scanley-2.5.0.tar.gz.md5</filename> containing its MD5 checksum, and optionally another, <filename>scanley-2.5.0.tar.gz.sha1</filename>, containing the SHA1 checksum. A different way to provide checking is to collect all the signatures for all the released packages into a single file, <filename>scanley-2.5.0.sigs</filename>; the same may be done with the checksums.
gl: Unha vez aprobada, a versión (isto é, todos os tarballs, ficheiros zip, e calquera outros formatos nos que é distribuida) deberían poñerse na zona de descargas dos proxectos, acompañada das sinaturas dixitais e o MD5/SHA1 checksums (ver <ulink url="http://en.wikipedia.org/wiki/Cryptographic_hash_function"></ulink>). Hai varios estándares para facer isto. Unha forma é acompañar a cada paquete lanzado cun ficheiro que contén as correspondencias das sinaturas dixitais, e outro ficherio co checksum. Por exemplo, se un dos paquetes lanzados é <filename>scanley-2.5.0.tar.gz</filename>, se situa no mesmo directorio un ficheiro <filename>scanley-2.5.0.tar.gz.asc</filename> contendo a sinatura dixital para o tarball, outro ficheiro <filename>scanley-2.5.0.tar.gz.mdz</filename> contendo o MD5 checksum, e opcionalmente outro, <filename>scanley-2.5.0.tar.gz.sha1</filename>, contendo o SHA1 checksum. Unha forma diferente de facelo es poñendo todas a sinaturas para os paquetes lanzados nun único ficheiro, <filename>scanley-2.5.0.sigs</filename>; o mesmo cos checksums.

source: It doesn't really matter which way you do it. Just keep to a simple scheme, describe it clearly, and be consistent from release to release. The purpose of all this signing and checksumming is to give users a way to verify that the copy they receive has not been maliciously tampered with. Users are about to run this code on their computers&mdash;if the code has been tampered with, an attacker could suddenly have a back door to all their data. See <xref linkend="security-releases"/><phrase output="printed"> later in this chapter</phrase> for more about paranoia.
gl: Non importa realmente a forma de facelo. Simplemente segue un esquema simple, descrito claramente, e consistente de versión a versión. O propósito de todo estas sinaturas e checksumming e darlle aos usuarios unha forma de verificar que a copia que reciben non ten nada malicioso. Os usuarios executan ese código na sua computadora&mdash;se o código foi alterado con, un atacante podería ter unha porta de atrás para acceder a todos os datos. Ver <xref linkend="security-releases"/><phrase output="printed">despois neste capítulo</phrase> para máis sobre paranoia.

source: Candidate Releases
gl: Versións Candidatas

source: For important releases containing many changes, many projects prefer to put out <firstterm>release candidates</firstterm> first, e.g., <filename>scanley-2.5.0-beta1</filename> before <filename>scanley-2.5.0</filename>. The purpose of a candidate is to subject the code to wide testing before blessing it as an official release. If problems are found, they are fixed on the release branch and a new candidate release is rolled out (<filename>scanley-2.5.0-beta2</filename>). The cycle continues until no unacceptable bugs are left, at which point the last candidate release becomes the official release&mdash;that is, the only difference between the last candidate release and the real release is the removal of the qualifier from the version number.
gl: Para versións importantes que conteñen moitos cambios, moitos proxectos prefiren sacar <firstterm>versións candidatas</firstterm> primeiro, p.e.,<filename>scanley-2.5.0-beta1</filename> antes de <filename>scanley-2.5.0</filename>. O propósito de unha candidata é probar ese código antes de bendecila como unha versión oficial. Se se atopan problemas, son arranxados na rama da versión e unha nova versión candidata é extendida (<filename>scanley-2.5.0-beta2</filename>). O ciclo continúa ata que non queden erros inaceptables, neste punto a última versión candidata convírtese na versión oficial&mdash;iso é, a única diferencia entre a última versión candidata e a versión real é a falta do cualificador do número de versión.

source: In most other respects, a candidate release should be treated the same as a real release. The <emphasis>alpha</emphasis>, <emphasis>beta</emphasis>, or <emphasis>rc</emphasis> qualifier is enough to warn conservative users to wait until the real release, and of course the announcement emails for the candidate releases should point out that their purpose is to solicit feedback. Other than that, give candidate releases the same amount of care as regular releases. After all, you want people to use the candidates, because exposure is the best way to uncover bugs, and also because you never know which candidate release will end up becoming the official release.
gl: En moitos outros aspectos, unha versión candidata debería ser tratata como a versión real. O cualificador <emphasis>alpha</emphasis>, <emphasis>beta</emphasis> ou <emphasis>rc</emphasis> é suficiente para advertir a usuarios conservadores que esperen ata a versión real, e por suposto o email de anuncio para versións candidatas debería apuntar que o seu propósito é solicitar feedback. Outra cousa, da as versións candidatas a mesma atención que as regualres. Despois de todo, queres que a xente empregue as candidatas, porque é o mellor xeito de descubrir erros, e ademáis porque nuncha sabes que versión candidata se convertirá na versión oficial.

source: Announcing Releases
gl: Anunciando as Versións

source: Announcing a release is like announcing any other event, and should use the procedures described in <xref linkend="publicity"/><phrase output="printed"> in <xref linkend="communications"/></phrase>. There are a few specific things to do for releases, though.
gl: Anunciar unha versión é como anunciar calquera outro evento, e debería empregar os procesos descritos <xref linkend="publicity"/><phrase output="printed"> en <xref linkend="communications"/>. Hay algunhas cousas que facer específicamente para a versión.

source: Whenever you give the URL to the downloadable release tarball, make sure to also give the MD5/SHA1 checksums and pointers to the digital signatures file. Since the announcement happens in multiple forums (mailing list, news page, etc.), this means users can get the checksums from multiple sources, which gives the most security-conscious among them extra assurance that the checksums themselves have not been tampered with. Giving the link to the digital signature files multiple times doesn't make those signatures more secure, but it does reassure people (especially those who don't follow the project closely) that the project takes security seriously.
gl: Cando des a URL para descargar o tarball da versión, asegurate tambén de dar o MD5/SHA1 checksums e punteiros ao ficheiro da sinatura dixital. Xa que o anuncio sucede en multiples foros (listas de correo, páxinas de novas, etc.), isto significa que os usuarios poden obter o checksum de varias fontes, o cal lles a máxima seguridade de que os checksums nos foron alterados. Dar o enlace aos ficheiros de firma dixital multiples veces non fai esas firmas máis seguras, pero tranquiliza a xente (especialemente aqueles que non seguen o proxecto de preto) de que o proxecto se toma a seguridade seriamente.

source: In the announcement email, and on news pages that contain more than just a blurb about the release, make sure to include the relevant portion of the CHANGES file, so people can see why it might be in their interests to upgrade. This is as important with candidate releases as with final releases; the presence of bugfixes and new features is important in tempting people to try out a candidate release.
gl: En ese mail de anuncio, e nas páxinas de novas que conteñen máis que simplemente propaganda sobre a versión, asegurate de incluir a porción relevante do ficheiro CHANGES, para que a xente poida ver porque están interesados na actualización. Isto é importante con versións candidatas e con versións finais; a presencia de erros arranxados e novas funcionalidades é importante e tentador para a xente para probar a versión candidata.

source: Finally, don't forget to thank the development team, the testers, and all the people who took the time to file good bug reports. Don't single out anyone by name, though, unless there's someone who is individually responsible for a huge piece of work, the value of which is widely recognized by everyone in the project. Just be wary of sliding down the slippery slope of credit inflation (see <xref linkend="credit"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>).
gl: Finalmente, non olvides agradecer ao equipo de desenvolvemento, aso probadores, e a toda a xente que empregou tempo para facer bos reportes de erros. Non empregues nomes, a non ser que haxa alguén individualmente responsable de algunha peza grande de traballo. Simplemente se cauteloso para non caer na inflacción do crédito (ver <xref linkend="credit"/><phrase output="printed">en <xref linkend="managing-volunteers"/></phrase>).

source: Maintaining Multiple Release Lines
gl: Mantendo Múltiples Liñas de Versións

source: Most mature projects maintain multiple release lines in parallel. For example, after 1.0.0 comes out, that line should continue with micro (bugfix) releases 1.0.1, 1.0.2, etc., until the project explicitly decides to end the line. Note that merely releasing 1.1.0 is not sufficient reason to end the 1.0.x line. For example, some users make it a policy never to upgrade to the first release in a new minor or major series&mdash;they let others shake the bugs out of, say 1.1.0, and wait until 1.1.1. This isn't necessarily selfish (remember, they're forgoing the bugfixes and new features too); it's just that, for whatever reason, they've decided to be very careful with upgrades. Accordingly, if the project learns of a major bug in 1.0.3 right before it's about to release 1.1.0, it would be a bit severe to just put the bugfix in 1.1.0 and tell all the old 1.0.x users they should upgrade. Why not release both 1.1.0 and 1.0.4, so everyone can be happy?
gl: O proxectos máis maduros manteñen varias liñas de versións en paralelo. Por exemplo, despois de que saia a 1.0.0, esa liña debería continuar con micro versións 1.0.1, 1.0.2, etc., ata que o proxecto explícitamente decide o fin da liña. Nótese que lanzar a 1.1.0 non é razón suficiente para finalizar a liña 1.0.x. Por exemplo, moitos usuarios manteñen a política de non actualizar a primeria versión con novo número menor ou maior na serie&mdash;permiten que outros se sacudan os bugs, da 1.1.0, e esperar ata a 1.1.1. Isto non é necesariamente egoista (recorda, están renunciando a erros amañados e novas funcionalidades tamén); é simplemente iso, por calquera razón, eles decidiron ser cuidadosos coas actualizacións. Consecuentemente, se o proxecto se entera dun erro grave na 1.0.3 xusto antes de sacar a versión 1.1.0, debería ser un pouco severo e poñer o amaño na 1.1.0 e decirlle a tódolos usuarios da 1.0.x que deberían actualizar. Por qué non sacar ambas 1.1.0 1.0.4, para que todo mundo sexa feliz?

source: After the 1.1.x line is well under way, you can declare 1.0.x to be at <firstterm>end of life</firstterm>. This should be announced officially. The announcement could stand alone, or it could be mentioned as part of a 1.1.x release announcement; however you do it, users need to know that the old line is being phased out, so they can make upgrade decisions accordingly.
gl: Despois de que a liña 1.1.x estea ben en camiño, podes declarar a 1.0.x para ser <firstterm>fin da liña</firstterm>. Isto debería ser anunciado oficialmente. O anuncio podería ser independente ou podería ser mencionado como parte do anuncio da versión 1.1.x; sen embargo faino, os usuarios precisan saber que a liña vella está desfasada, para que eles poidan tomar a decisión de actualizar.

source: Some projects set a window of time during which they pledge to support the previous release line. In an open source context, "support" means accepting bug reports against that line, and making maintenance releases when significant bugs are found. Other projects don't give a definite amount of time, but watch incoming bug reports to gauge how many people are still using the older line. When the percentage drops below a certain point, they declare end of life for the line and stop supporting it.
gl: Algúns proxectos poñen unha ventana de tempo durante a cal prometen dar soporte a liña previa da versión. No contexto do software libre, "soporte" quere decir aceptar reportes de erros contra esa liña, e facer versións de mantemento cando se atopan erros importantes. Outros proxectos non poñen un tempo definitivos, pero seguen aceptando reportes de erros para calcular canta xente está empregando a liña vella. Cando a porcentaxe alcanza certo punto, declaran o fin da vida para esa liña e o soporte.

source: For each release, make sure to have a <firstterm>target version</firstterm> or <firstterm>target milestone</firstterm> available in the bug tracker, so people filing bugs will be able to do so against the proper release. Don't forget to also have a target called "development" or "latest" for the most recent development sources, since some people&mdash;not only active developers&mdash;will often stay ahead of the official releases.
gl: Para cada versión, asegurate de ter unha <firstterm>versión obxetivo</firstterm> ou <firstterm>hito</firstterm> dispoñible no bug tracker, para que a xente poida cubrir bugs contra esa versión. Non olvides ter tamén un obxetivo chamado "desenvolvemento" ou "última" para as fontes de desenvolvemento máis recentes, xa que algunha xente&mdash; no só desenvolvedores&mdash; activos; están atentos as versión oficias.

source: Security Releases
gl: Versións seguras

source: Most of the details of handling security bugs were covered in <xref linkend="security"/><phrase output="printed"> in <xref linkend="communications"/></phrase>, but there are some special details to discuss for doing security releases.
gl: A maioría dos detalle para manexar erros de seguridade están cubertos <xref linkend="security"/><phrase output="printed"> en <xref linkend="communications"/></phrase>, pero hai algúns detalles especiais que discutir para facer versións seguras.

source: A <firstterm>security release</firstterm> is a release made solely to close a security vulnerability. The code that fixes the bug cannot be made public until the release is available, which means not only that the fixes cannot be committed to the repository until the day of the release, but also that the release cannot be publicly tested before it goes out the door. Obviously, the developers can examine the fix among themselves, and test the release privately, but widespread real-world testing is not possible.
gl: Unha <firstterm>versión de seguridade</firstterm> é unha versión feita para pechar unha vulnerabilidade de seguridade. O codigo que arranxa ese bug pode non facerse público ata que está dispoñible a versión. o cal significa que non só os cambios non poden ser comiteados ata o día da versión senón que non se pode publictar e ser testeada antes de estar fora. Obviamente, os desenvolvedores poden examinar o amaño entre eles, e testear a versión privadamente, pero sacalo para ser testeado públicamente non é posible.

source: Because of this lack of testing, a security release should always consist of some existing release plus the fixes for the security bug, with <emphasis>no other changes</emphasis>. This is because the more changes you ship without testing, the more likely that one of them will cause a new bug, perhaps even a new security bug! This conservatism is also friendly to administrators who may need to deploy the security fix, but whose upgrade policy prefers that they not deploy any other changes at the same time.
gl: Debido a esta falta de testeo, unha versión de seguridade debería sempre consistir de unha versión existente máis os arranxos para o erro de seguridade, sen <emphasis>ningún outro cambio</emphasis>. Isto é porque cantos máis cambios metes sen testear, máis probabilidades de que algún cause un novo erro, quizais incluso un novo erro de seguridade!. Este conservadurismo é ademáis amigo dos administradores os cales poden precisar desplegar o arranxo de seguridade, pero quenes actualizan prefiren que non se desplegue ningún cambio ao mesmo tempo.
