Repository: amaneiro/poss-gl
Catalog: po/*/ch07.po
Languages: gl

source: Making a security release sometimes involves some minor deception. For example, the project may have been working on a 1.1.3 release, with certain bug fixes to 1.1.2 already publicly declared, when a security report comes in. Naturally, the developers cannot talk about the security problem until they make the fix available; until then, they must continue to talk publicly as though 1.1.3 will be what it's always been planned to be. But when 1.1.3 actually comes out, it will differ from 1.1.2 only in the security fixes, and all those other fixes will have been deferred to 1.1.4 (which, of course, will now <emphasis>also</emphasis> contain the security fix, as will all other future releases).
gl: Facer versións de seguridade as veces supón algunha pequena decepción. Por exemplo, o proxecto pode estar traballando na versión 1.1.3, con certos erros amañados da 1.1.2, cando un informe de seguridade aparece. Naturalmente, os desenvolvedores non poden falar do problea de seguridade ata que estea amañado; teñen que seguir falando públicamente de que os seus plans son sacar a 1.1.3. Pero cando se vai a sacar a 1.1.3, só vai ser diferente da 1.1.2 no amaño de seguridade, a tódolos demáis erros amañados se retrasarán a 1.1.4 (a cal, por suposto terá <emphasis>tamén</emphasis> o amaño de seguridade, igual que o resto de futuras versións).

source: You could add an extra component to an existing release to indicate that it contains security changes only. For example, people would be able to tell just from the numbers that 1.1.2.1 is a security release against 1.1.2, and they would know that any release "higher" than that (e.g., 1.1.3, 1.2.0, etc.) contains the same security fixes. For those in the know, this system conveys a lot of information. On the other hand, for those not following the project closely, it can be a bit confusing to see a three-component release number most of the time with an occasional four-component one thrown in seemingly at random. Most projects I've looked at choose consistency and simply use the next regularly scheduled number for security releases, even when it means shifting other planned releases by one.
gl: Podes engadir unha compoñente extra a unha versión existente para indiciar que contén cambios só por seguridade. Por exemplo, a xente podería ser capaz de decir só polos números que 1.1.2.1 é unha versión de seguridade e non 1.1.2, e saberían que calquera versión "maior" que esa (e.x., 1.1.3, 1.2.0, etc.) contén os mesmos amaños de seguridade. Para eses, este sistema expresa moita información. Por outro lado, para aqueles que non seguen de preto o proxecto, pode ser un pouco confuso ver unha terceira compoñente no número da versión con ocasionalmente un cuarto compoñente aparentemente ao azar. Moitos proxectos simplemente empregan o seguinte numero programado para as versións de seguridade, incluso cando implica cambiar os plans da versión.

source: Releases and Daily Development
gl: Versións e Desenvolvemento Diario

source: Maintaining parallel releases simultaneously has implications for how daily development is done. In particular, it makes practically mandatory a discipline that would be recommended anyway: have each commit be a single logical change, and never mix unrelated changes in the same commit. If a change is too big or too disruptive to do in one commit, break it across N commits, where each commit is a well-partitioned subset of the overall change, and includes nothing unrelated to the overall change.
gl: Manter versións paralelas simultáneamente ten implicacións para como se fai o desenvolvemento diario. En particular, fai prácticamente obligatorio unha disciplina que sería recomendable de calquera forma: ter cada comit como un simple cambio lóxico, e nunca mezclar cambios non relacionados no mesmo commit.

source: Here's an example of an ill-thought-out commit:
gl: Aquí hai un exemplo de commit mal concebido:

source: The problem with it becomes apparent as soon as someone needs to port the <function>BuildDir</function> error check fix over to a branch for an upcoming maintenance release. The porter doesn't want any of the other changes&mdash;for example, perhaps the fix to issue #1729 wasn't approved for the maintenance branch at all, and the <filename>index.html</filename> tweaks would simply be irrelevant there. But she cannot easily grab just the <function>BuildDir</function> change via the version control tool's merge functionality, because the version control system was told that that change is logically grouped with all these other unrelated things. In fact, the problem would become apparent even before the merge. Merely listing the change for voting would become problematic: instead of just giving the revision number, the proposer would have to make a special patch or change branch just to isolate the portion of the commit being proposed. That would be a lot of work for others to suffer through, and all because the original committer couldn't be bothered to break things into logical groups.
gl: O problema con iso aparece tan pronto como alguén necesita portar o arranxo para chequear os erros na función <function>BuildDir</function> a outra rama para unha versión de mantemento. O portador non quere ningún dos outros cambios&mdash;por exemplo, quizais o arranxo para o problema #1729 non foi de todo aprobado para a rama de mantemento, e o ficheiro <filename>index.html</filename> sería simplemente irrelevante alí. Pero non pode facilmente coller xusto o cambio para <function>BuildDir</function> a través da ferramenta de integración do sistema de control de versións xa que o cambio está agrupado coas outras cousas non relacionadas. De feito, o problema aparecería incluso antes da integración. Simplemente listando o cambio para votación sería problemático: en lugar de dar o número de revisión, o que o propoño tería que facer un parche especial ou cambiar a rama para illar a porción do commit proposto. Iso sería un montón de traballo sufrido por outros, e todo poque o commiter orixinal nun puido romper as cousas en grupos lóxicos.

source: In fact, that commit really should have been <emphasis>four</emphasis> separate commits: one to fix issue #1729, another to remove obsolete comments and reformat code in <function>BuildDir</function>, another to fix the error check in <function>BuildDir</function>, and finally, one to tweak <filename>index.html</filename>. The third of those commits would be the one proposed for the maintenance release branch.
gl: De feito, ese commit realmente deberían ter sido <emphasis>catro</emphasis> commits separados: un para resolver o problema #1729, outro para eliminar comentarios obsoletos e reformatear o código en <function>BuildDir</function>, outro para arranxar o error en <function>BuildDir</function>, e finalmente, un para o <filename>index.html</filename>. O terceiro de eses commits seria o proposto para a rama de mantemento da versión.

source: Of course, release stabilization is not the only reason why having each commit be one logical change is desirable. Psychologically, a semantically unified commit is easier to review, and easier to revert if necessary (in some version control systems, reversion is really a special kind of merge anyway). A little up-front discipline on everyone's part can save the project a lot of headache later.
gl: Por suposto, estabilizar unha versión non é a única razón de porque é desexable que cada commit sexa un cambio lóxico. Psicolóxicamente, un commit semánticamente unificado é fácil de revisar, e fácil de revertir se é necesario (en algúns sistemas de control de versións, reversión é realemten unha especie de merge). Un pouco de disciplina por parte de todo o mundo pode a larga evitar unha dor de cabeza ao proxecto.

source: Planning Releases
gl: Planeando as Versións

source: One area where open source projects have historically differed from proprietary projects is in release planning. Proprietary projects usually have firmer deadlines. Sometimes it's because customers were promised that an upgrade would be available by a certain date, because the new release needs to be coordinated with some other effort for marketing purposes, or because the venture capitalists who invested in the whole thing need to see some results before they put in any more funding. Free software projects, on the other hand, were until recently mostly motivated by amateurism in the most literal sense: they were written for the love of it. No one felt the need to ship before all the features were ready, and why should they? It wasn't as if anyone's job was on the line.
gl: Un area donde os proxectos de software libre son diferentes históricamente dos propietarios é nos plans de lanzamento de versións. Os proxectos propietarios normalmente teñen datas límite firmes. As veces porque se lles prometeu aos clientes que unha actualización estaría dispoñible nunha data concreta, porque a nova versión precisa coordinarse con algún outro esforzo por propósitos de marketing, ou porque os aventurados capitalistas os cales invisten en todo precisan ver algúns resultados antes de poñer os seus cartos para financiar algo máis. Os proxectos de Software Libre, por outra banda, foron ata fai pouco máis motivados polo amateurismo no senso máis literal: foron escritos por amor a eles. Ninguén sinte a necesidade de lanzalo antes de que todas as funcionalidades estén listas, e por que deberían? Non era como se o traballo de alguén estivese en xogo.

source: Nowadays, many open source projects are funded by corporations, and are correspondingly more and more influenced by deadline-conscious corporate culture. This is in many ways a good thing, but it can cause conflicts between the priorities of those developers who are being paid and those who are volunteering their time. These conflicts often happen around the issue of when and how to schedule releases. The salaried developers who are under pressure will naturally want to just pick a date when the releases will occur, and have everyone's activities fall into line. But the volunteers may have other agendas&mdash;perhaps features they want to complete, or some testing they want to have done&mdash;that they feel the release should wait on.
gl: Hoxe en día, a maioría dos proxectos de software libre son fundados por corporacións, e cada vez están máis influenciados pola cultura das datas límite. Isto é en certa forma algo bo, pero pode causar conflictos entre as prioridades dos desenvolvedores que son pagados e quenes o fan como voluntarios. Estes conflictos a miudo suceden cando se trata de plantexar o esquema de lanzamento de versións. Os desenvolvedores pagados que son os que están baixo presión queren establecer unha data para lanzar a versión, e teñen as actividades de todo o mundo en xogo. Pero os voluntarios poden ter outras axendas&mdash;quizais funcionalidades que queren completar, ou algún test que queren ter feito&mdash;eles sinte que o lanzamento da versión debería esperar.

source: There is no general solution to this problem except discussion and compromise, of course. But you can minimize the frequency and degree of friction caused, by decoupling the proposed <emphasis>existence</emphasis> of a given release from the date when it would go out the door. That is, try to steer discussion toward the subject of which releases the project will be making in the near- to medium-term future, and what features will be in them, without at first mentioning anything about dates, except for rough guesses with wide margins of error<footnote><para>For an alternative approach, you may wish to read Martin Michlmayr's Ph.D. thesis <citetitle>Quality Improvement in Volunteer Free and Open Source Software Projects: Exploring the Impact of Release Management</citetitle> (<ulink url="http://www.cyrius.com/publications/michlmayr-phd.html"></ulink>). It is about using time-based release processes, as opposed to feature-based, in large free software projects. Michlmayr also gave a talk at Google on the subject, available on Google Video at <ulink url="http://video.google.com/videoplay?docid=-5503858974016723264"></ulink>.</para></footnote>. By nailing down feature sets early, you reduce the complexity of the discussion centered on any individual release, and therefore improve predictability. This also creates a kind of inertial bias against anyone who proposes to expand the definition of a release by adding new features or other complications. If the release's contents are fairly well defined, the onus is on the proposer to justify the expansion, even though the date of the release may not have been set yet.
gl: Non hai unha solución xeral para este problema excepto a discusión e o compromiso, por suposto. Pero non podes minimizar a frecuencia e o nivel de fricción causada, polo desacoplamento da proposta <emphasis>existente</emphasis> de unha versión dada desde a data cando sairía. Isto é, tratar de levar a discusión hacia que versións do proxecto se farán nun futuro cercano, e que funcionalidades irán en cada unha, sen ningunha mención sobre datas, excepto con grande marxes de erro<footnote><para>Para unha aproximación alternativa, podes ler a tese de Martin Michlmayr's Ph.D.<citetitle>Quality Improvement in Volunteer Free and Open Source Software Projects: Exploring the Impact of Release Management</citetitle> (<ulink url="http://www.cyrius.com/publications/michlmayr-phd.html"></ulink>). E sobre o uso do tempo basado en procesos de lanzamento de versións, coma contraposición as funcionalidades, e moitos proxectos de software. Michlmayr ademáis deu unha charla en Google sobre o tema, dispoñible a través de Google Video en <ulink url="http://video.google.com/videoplay?docid=-5503858974016723264"></ulink>.</para></footnote>. Dando pronto un set de funcionalidades, reduces a complexidade da discusión centrada nunha versión individual, e por tanto melloras a predictibilidade. Isto ademáis crea unha certa inercia contra alguén que propoña expandir a definición da versión engadindo novas funcionalidades ou complicacións. Se os contidos da versión están máis ou menos ben definidos, a responsabilidade de xustificar a expansión é de quen a propón, incluso se a data de lanzamento non foi posta ainda.

source: In his multi-volume biography of Thomas Jefferson, <citetitle>Jefferson and His Time</citetitle>, Dumas Malone tells the story of how Jefferson handled the first meeting held to decide the organization of the future University of Virginia. The University had been Jefferson's idea in the first place, but (as is the case everywhere, not just in open source projects) many other parties had climbed on board quickly, each with their own interests and agendas. When they gathered at that first meeting to hash things out, Jefferson made sure to show up with meticulously prepared architectural drawings, detailed budgets for construction and operation, a proposed curriculum, and the names of specific faculty he wanted to import from Europe. No one else in the room was even remotely as prepared; the group essentially had to capitulate to Jefferson's vision, and the University was eventually founded more or less in accordance with his plans. The facts that construction went far over budget, and that many of his ideas did not, for various reasons, work out in the end, were all things Jefferson probably knew perfectly well would happen. His purpose was strategic: to show up at the meeting with something so substantive that everyone else would have to fall into the role of simply proposing modifications to it, so that the overall shape, and therefore schedule, of the project would be roughly as he wanted.
gl: Na biografía de Thomas Jefferson, de varios volúmenes, <citetitle>Jefferson and His Time</citetitle>, Dumas Malone conta a historia de como Jefferson manexou a primeira reunión que tivo para decidir como organizar o da Universidade de Virginia. A Universidade estivera no primeiro lugar na mente de Jefferson, pero (como pasa en todas partes, non só nos proxectos de software libre) moitos outros grupos se subiron o carro rapidamente, canda un cos seus propios intereses e axendas. Cando se reuniron por primeira vez para determinar as cousas, Jefferson asegurouse de mostrar con meticulosidade planos arquitectónicos preparados, presupostos detaiados para construcción e operación, unha proposta de curriculum, e de nomes de específicas facultades que quería importar de Europa. Ninguén máis na sala estaba remotamente preparado; o grupo esencialmente tivo que capitular a visión de Jefferson, e a Universidade e a Universidade foi máis ou menos fundada segundo os seus plans. Os feito de que a construcción fora por riba do presuposto, e que moitas ideas non se fixeran, por varias razóns, eran cousas que problemente Jefferson sabía que ian acontecer. O seu propósito era estratéxico: mostrar na reunión algo tan detallado que ninguén puidera propoñer modificacións, e que polo tanto as liñas, e o esquema, do proxecto fora coma el quería.

source: In the case of a free software project, there is no single "meeting", but instead a series of small proposals made mostly by means of the issue tracker. But if you have some credibility in the project to start with, and you start assigning various features, enhancements, and bugs to target releases in the issue tracker, according to some announced overall plan, people will mostly go along with you. Once you've got things laid out more or less as you want them, the conversations about actual release <emphasis>dates</emphasis> will go much more smoothly.
gl: No caso dun proxecto de software libre, non hai unha soa "reunión", no canto hai unha serie de pequenas propostas polo seguimento do problema. Pero se tes certa credibilidade no proxecto para empezar, e comezas asinando varias funcionalidades, melloras, e erros a versións obxectivo, de acordo co anunciado no plan xeral, a maioria da xente estará contigo. Unha vez que teñas as cousas ordeadas máis ou menos como querias, as conversas sobre as <emphasis>datas</emphasis> da versión actual será máis suaves.

source: It is crucial, of course, to never present any individual decision as written in stone. In the comments associated with each assignment of an issue to a specific future release, invite discussion, dissent, and be genuinely willing to be persuaded whenever possible. Never exercise control merely for the sake of exercising control: the more deeply others participate in the release planning process (see <xref linkend="share-management"/><phrase output="printed"> in <xref linkend="managing-volunteers"/></phrase>), the easier it will be to persuade them to share your priorities on the issues that really count for you.
gl: E crucial, por suposto, non presentar nunca unha decisión indiviual como se fose escrita en pedra. Nos comentarios asociados a cada asignación de temas a unha versión futura, invita a discusión, disentir, e estar xeuninamente disposto a ser persuadido na medida do posible. Nunca exerza control simplemente polo propósito de exercer control: Canto máis participen os demais no plan de lanzamento das versións (ver <xref linkend="share-management"/><phrase output="printed"> en <xref linkend="managing-volunteers"/>), máis sinxelo será persuadilos para compartir as tuas prioridades nos asuntos que realmente teñan importancia para ti.

source: The other way the project can lower tensions around release planning is to make releases fairly often. When there's a long time between releases, the importance of any individual release is magnified in everyone's minds; people are that much more crushed when their code doesn't make it in, because they know how long it might be until the next chance. Depending on the complexity of the release process and the nature of your project, somewhere between every three and six months is usually about the right gap between releases, though maintenance lines may put out micro releases a bit faster, if there is demand for them.
gl: A outra forma de conseguir que haxa menos tensión arredor do proceso de lanzamento de versións é facer versións a miudo. Cando pasa moito tempo entre versións, a importancia de cada versión individual é magnificada pola mente de todos; a xente indígnase máis cando o seu código non vai nunha versión, xa que saben que pasará bastente tempo ata que teñan outra oportunidade. Dependendo da complexidade do proceso de lanzamento de versións e a natureza do proxecto, un periodo entre 3 e 6 meses soe ser o correcto entre versións, ademáis as liñas de mantemento poden facer micro versións máis rápido, se hai demanda.
