Repository: amaneiro/poss-gl
Catalog: po/*/ch07.po
Languages: gl

source: Because the release procedure is deliberately biased toward conservatism, the justifications offered for vetoes are sometimes procedural rather than technical. For example, a person may feel that a change is well-written and unlikely to cause any new bugs, but vote against its inclusion in a micro release simply because it's too big&mdash;perhaps it adds a new feature, or in some subtle way fails to fully follow the compatibility guidelines. I've occasionally even seen developers veto something because they simply had a gut feeling that the change needed more testing, even though they couldn't spot any bugs in it by inspection. People grumbled a little bit, but the vetoes stood and the change was not included in the release (I don't remember if any bugs were found in later testing or not, though).
gl: Debido a que o proceso de sacar unha versión está deliberadamente baseado no conservativismo, as xustificación ofrecidas para os vetos son máis veces procedimentais que técnicas. Por exempo, unha persoa pode sentir que un cambio está ben escrito e é pouco probable que cause novos bugs, pero vota en contra da sua inclusión nunha micro versión porque é demasiado grande&mdash; quizais engade unha nova funcionalidade, ou de algunha forma sutil falla ao cubrir as liñas de compatibilidade. Ocasionalmente teño visto desenvolvedores vetar algo porque simplemente tiñan o presentimento de que o cambio necesitaba máis testeo, incluso cando eles non puideron atopar erros nel inspeccionandoo. A xente refunfuñou un pouco, pero os vetos resistiron e o cambio non foi incluido na versión (Non lembro se foi atopado algún erro máis tarde testeando ou non).

source: Managing collaborative release stabilization
gl: Manexando a estabilización das versións de xeito colaborativo

source: If your project chooses a change voting system, it is imperative that the physical mechanics of setting up ballots and casting votes be as convenient as possible. Although there is plenty of open source electronic voting software available, in practice the easiest thing to do is just to set up a text file in the release branch, called <filename>STATUS</filename> or <filename>VOTES</filename> or something like that. This file lists each proposed change&mdash;any developer can propose a change for inclusion&mdash;along with all the votes for and against it, plus any notes or comments. (Proposing a change doesn't necessarily mean voting for it, by the way, although the two often go together.) An entry in such a file might look like this:
gl: Se o teu proxecto elixe un sistema de voto sobre os cambios, é imperativo que o mecanismo físico de establecer votación e votos decisivos sexa o máis conveniente posible. A pesar de que hai moitos software open source para voto electrónico dispoñible, na practica o máis sinxelo e poñer un ficheiro de texto na rama da versión, chamado <filename>STATUS</filename> ou <filename>VOTES</filename> ou algo similar. Este ficheiro lista cada un dos cambios propostos&mdash;calquera desenvolvedor pode propoñer un cambio para a súa inclusión&mdash;xunto con todos os votos a favor e en contra, ademáis de notas ou comentarios. (Propoñer un cambio non implica necesariamente votar para iso, por certo, aínda que as dúas cousas soen ir xuntas). Unha entrada neste ficheiro ten a seguinte forma:

source: In this case, the change acquired two positive votes, but was vetoed by tmartin, who gave the reason for the veto in a parenthetical note. The exact format of the entry doesn't matter; whatever your project settles on is fine&mdash;perhaps tmartin's explanation for the veto should go up in the "Notes:" section, or perhaps the change description should get a "Description:" header to match the other sections. The important thing is that all the information needed to evaluate the change be reachable, and that the mechanism for casting votes be as lightweight as possible. The proposed change is referred to by its revision number in the repository (in this case a single revision, r2401, although a proposed change could just as easily consist of multiple revisions). The revision is assumed to refer to a change made on the trunk; if the change were already on the release branch, there would be no need to vote on it. If your version control system doesn't have an obvious syntax for referring to individual changes, then the project should make one up. For voting to be practical, each change under consideration must be unambiguously identifiable.
gl: Neste caso, o cambio adquiriu dous votos positivos, pero foi vetado por tmartin, quen deu a razón para o seu veto nunha nota entre paréntesis. O formato exacto da entrada non importa; sexa cal sexa o teu proxecto decidir está ben&mdash; quizais a explicación de tmartin para o veto debería ir na sección "Notes:" ou quizais a descripción do cambio debería ter unha cabeceira "Description:" dacordo coas outras seccións. O importante é que toda a información necesaria para evaluar o cambio está dispoñible, e o mecanismo para votos decisivos sexa o máis lixeiro posible. O cambio proposto está referenciado polo seu número de revisión no repositorio (neste caso unha simple revisión, r2401, aínda que un cambio proposto podería consistir en múltiples revisións). A revisión asúmese que está referida a un cambio feito no trunk; se o cambio estivese na rama da versión, non habería que votar. Se o teu sistema de control de versións non ten unha sintaxis obvia para referirse a cambios individuais, o proxecto debería inventala. Para que o voto sexa práctivo, cada cambio baixo consideración debe ser identificable inequívocamente.

source: Those proposing or voting for a change are responsible for making sure it applies cleanly to the release branch, that is, applies without conflicts (see <xref linkend="vc-vocabulary-conflict"/>). If there are conflicts, then the entry should either point to an adjusted patch that does apply cleanly, or to a temporary branch that holds an adjusted version of the change, for example:
gl: Esas proposicións ou votos para un cambio son responsable para asegurarse de que é aplicado limpamente la rama da versión, iso é, aplicado sen conflictos (ver <xref linkend="vc-vocabulary-conflict"/>). Se hai conflictos, entón a entrada debería apuntar a un parche que a aplique limpamente, ou a unha rama temporal que teña a axustada versión do cambio, por exemplo:

source: That example is taken from real life; it comes from the <filename>STATUS</filename> file for the Subversion 1.1.4 release process. Notice how it uses the original revisions as canonical handles on the change, even though there is also a branch with a conflict-adjusted version of the change (the branch also combines the three trunk revisions into one, r13517, to make it easier to merge the change into the release, should it get approval). The original revisions are provided because they're still the easiest entity to review, since they have the original log messages. The temporary branch wouldn't have those log messages; in order to avoid duplication of information (see <xref linkend="vc-singularity"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>), the branch's log message for r13517 should simply say "Adjust r13222, r13223, and r13232 for backport to 1.1.x branch." All other information about the changes can be chased down at their original revisions.
gl: Ese exemplo está tomada da vida real, ven do ficheiro <filename>STATUS</filename> no proceso de lanzamento da versión de Subversion 1.1.4. Nótese como se empregan as revisións orixinais coma manexadoras canónicas dos cambios, incluso hai unha rama cunha version de conflictos-axustados dos cambios (a rama ademáis combina tres revisións do trunk nunha, r13517, para facer máis sinxela a integración dos cambios na versión, debería ser aprovada). As revisións orixinais aparecen porque se están a revisar ainda, xa que teñen as mensaxes de log orixinais. A rama temporal non tería esas mensaxes de log; para evitar a duplicación de información (ver <xref linkend="vc-singularity"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>), As mensaxes de log para a rama da revisón r13517 deberían decir simplemente "Axustar r13222, r13223, r13232 para backport a rama 1.1.x". Toda outra información acerca dos cambios pode ser alcanzada nas suas revisións orixinais.

source: Release manager
gl: Manager das versións

source: The actual process of merging (see <xref linkend="vc-vocabulary-merge"/>) approved changes into the release branch can be performed by any developer. There does not need to be one person whose job it is to merge changes; if there are a lot of changes, it can be better to spread the burden around.
gl: O actual proceso de fusiónar (ver <xref linkend="vc-vocabulary-merge"/>) os cambios aprovados na rama da versión poden ser realizadas por calquera desenvolvedor. Aqui non se precisa unha persoa para facer o traballo de fusionar os cambios; se hai moitos cambios, pode ser mellor repartir a carga.

source: However, although both voting and merging happen in a decentralized fashion, in practice there are usually one or two people driving the release process. This role is sometimes formally blessed as <firstterm>release manager</firstterm>, but it is quite different from a release owner (see <xref linkend="release-owner"/><phrase output="printed"> earlier in this chapter</phrase>) who has final say over the changes. Release managers keep track of how many changes are currently under consideration, how many have been approved, how many seem likely to be approved, etc. If they sense that important changes are not getting enough attention, and might be left out of the release for lack of votes, they will gently nag other developers to review and vote. When a batch of changes are approved, these people will often take it upon themselves to merge them into the release branch; it's fine if others leave that task to them, as long as everyone understands that they are not obligated to do all the work unless they have explicitly committed to it. When the time comes to put the release out the door (see <xref linkend="testing-and-releasing"/><phrase output="printed"> later in this chapter</phrase>), the release managers also take care of the logistics of creating the final release packages, collecting digital signatures, uploading the packages, and making the public announcement.
gl: Nenbargantes, ainda que ámbolos dous, votación e merxeado sucedan de forma descentralizada, na práctica normalmente hai unha ou duas persoas conducindo o proceso de lanzamento da nova versión. Este rol e as veces bendecido coma <firstterm>release manager</firstterm>, pero é un pouco diferente do propietario da versión (ver <xref linkend="release-owner"/><phrase output="printed"> antes neste capítulo</phrase>) quen ten a derradeira palabra sobre os cambios. Os releases manager manteñen monitorizado cantos cambios están baixo consideración, cantos foron aprobados, cantos parece que van ser aprobados, etc. Se eles sinten que algúns cambios non están recibindo a atención precisa, e poden quedar fora da versión por falta de votos, eles estarán encima de outros desenvolvedores para que voten. Cando un puñado de cambios son aprovados, esta xente encargarase por sí mesmo de merxealos na rama da versión; está ben se outros lles deixan esa tarefa a eles, sempre que todo o mundo entenda que eles non están obligados a facer todo o traballo a non ser que eles explicitamente se prestasen a facelo. Cando a versión está a piques de sair (ver <xref linkend="testing-and-releasing"/><phrase output="printed">máis adiante neste capitulo</phrase>), os releases manager preocuparánse tamén da loxística para a creación da versión, os paquetes, recolectar as firmas dixitais, subir os paquetes, e facer os anuncios públicos.

source: Packaging
gl: Empaquetamento

source: The canonical form for distribution of free software is as source code. This is true regardless of whether the software normally runs in source form (i.e., can be interpreted, like Perl, Python, PHP, etc.) or needs to be compiled first (like C, C++, Java, etc.). With compiled software, most users will probably not compile the sources themselves, but will instead install from pre-built binary packages (see <xref linkend="binary-packages"/><phrase output="printed"> later in this chapter</phrase>). However, those binary packages are still derived from a master source distribution. The point of the source package is to unambiguously define the release. When the project distributes "Scanley&nbsp;2.5.0", what it means, specifically, is "The tree of source code files that, when compiled (if necessary) and installed, produces Scanley 2.5.0."
gl: A forma tradicional para a distribución do Software Libre é como código fonte. Isto é verdade dependendo de se o software normalmente se executa dende o código (por exemplo, podendo ser intrepretado, coma Perl, Python, PHP, etc.) o precisa ser compilado primeiro (coma C, C++, Java, etc). Con software compilado, moitos usuarios probablemente non compilen as fontes eles mismos, polo que precisarán instalalos dende paquetes binarios (ver <xref linkend="binary-packages"/><phrase output="printed">máis adiante neste capitulo</phrase>). Sen embargo, eses paquetes binarios están todavía derivados das fontes da distribución. A cuestión é que as fontes son ambiguas para definir a versión. Cando o proxecto distribue Scanley&nbsp;2.5.0", o que significa, específicamente, é "A árbore de ficherios de código fonte, cando se compilen (se é necesario) e instalen, producen Scanley 2.5.0."

source: There is a fairly strict standard for how source releases should look. One will occasionally see deviations from this standard, but they are the exception, not the rule. Unless there is a compelling reason to do otherwise, your project should follow this standard too.
gl: Hai un estándar bastante estricto sobre como deberian ser as versións das fontes. Ocasionalmente poden verse desviacións deste estándar, pero son a excepción, non a regra. A menos que haxa una razón xustificada para facelo de outra forma, o teu proxecto debería seguir este estándar tamén.

source: Format
gl: Formato

source: The source code should be shipped in the standard formats for transporting directory trees. For Unix and Unix-like operating systems, the convention is to use TAR format, compressed by <command>compress</command>, <command>gzip</command>, <command>bzip</command> or <command>bzip2</command>. For MS Windows, the standard method for distributing directory trees is <firstterm>zip</firstterm> format, which happens to do compression as well, so there is no need to compress the archive after creating it.
gl: O código fonte debería entregarse en formatos estándar para distribuir a árbore de directorios. Para Unix e sistemas operativos de tipo Unix, a conveción é empregar o formato TAE, comprimido con <command>compress</command>, <command>gzip</command>, <command>bzip</command> ou <command>bzip2</command>. Para MS Windows, o método estándar para a distribución da árbore de directorios é o formato <firstterm>zip</firstterm>, o cal xa fai a compresión tamén, polo que non é necesario comprimir o ficheiro despois de crealo.

source: TAR Files
gl: Ficheiros TAR

source: <firstterm>TAR</firstterm> stands for "Tape&nbsp;ARchive", because tar format represents a directory tree as a linear data stream, which makes it ideal for saving directory trees to tape. The same property also makes it the standard for distributing directory trees as a single file. Producing compressed tar files (or <firstterm>tarballs</firstterm>) is pretty easy. On some systems, the <command>tar</command> command can produce a compressed archive itself; on others, a separate compression program is used.
gl: <firstterm>TAR</firstterm> abreviatura para "Tape&nbsp;ARchive", porque o formato tar representa unha árbore de directorios coma un chorro de datos lineais, o cal o fai ideal para gardar árbores de directorios en cinta. A mesma propiedade faino tamén o estandar para distribuir árbores de directorios nun ficheiro. Producir ficheiros tar comprimidos (ou <firstterm>tarballs</firstterm>) é bastante sinxelo. Nalgúns sistemas, o comando <command>tar</command> pode producir ficheiros comprimidos por si mesmo; noutros, hai que empregar outro programa para comprimir.

source: Name and Layout
gl: Nomeamento e Distribución

source: The name of the package should consist of the software's name plus the release number, plus the format suffixes appropriate for the archive type. For example, Scanley 2.5.0, packaged for Unix using GNU Zip (gzip) compression, would look like this:
gl: O nome do paquete deberia consistir no nome do software mais o número da versión, mais o formato de sufixos apropiado para o tipo de ficheiro. Por exemplo, Scanley 2.5.0, empaquetado para Unix empregando GNU Zip (gzip) para comprimir, quedaría asi:

source: or for Windows using zip compression:
gl: ou para Windows usando compresión en zip:

source: Either of these archives, when unpacked, should create a single new directory tree named <filename>scanley-2.5.0</filename> in the current directory. Underneath the new directory, the source code should be arranged in a layout ready for compilation (if compilation is needed) and installation. In the top level of new directory tree, there should be a plain text <filename>README</filename> file explaining what the software does and what release this is, and giving pointers to other resources, such as the project's web site, other files of interest, etc. Among those other files should be an <filename>INSTALL</filename> file, sibling to the <filename>README</filename> file, giving instructions on how to build and install the software for all the operating systems it supports. As mentioned in <xref linkend="license-quickstart-applying"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>, there should also be a <filename>COPYING</filename> or <filename>LICENSE</filename> file, giving the software's terms of distribution.
gl: Algún destes ficheiros, cando son descomprimidos, deben crear unha nova árbore de directorios chamado <filename>scanley-2.5.0</filename> no directorio actual. Baixo o novo directorio, o código fonte debe estar preparado para a compilación (se ha compilación é necesaria) e instalación. Na raíz do novo directorio, deberia haber un ficheiro de texto plano <filename>README</filename> explicando o que fai o software e que versión é, e dar enlaces a outros recursos, como a páxina web do proxecto, outros ficheiros interesantes, etc. Entre esos outros ficheiros deberia haber un <filename>INSTALL</filename>, irmán do <filename>README</filename>, dando instruccións sobre como compilar e instalar o software para tódolos sistemas operativos soportados. Como se mencionaba <xref linkend="license-quickstart-applying"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>, deberia haber tamén un ficheiro <filename>COPYING</filename>, dando os termos de distribución do software.

source: There should also be a <filename>CHANGES</filename> file (sometimes called <filename>NEWS</filename>), explaining what's new in this release. The <filename>CHANGES</filename> file accumulates changelists for all releases, in reverse chronological order, so that the list for this release appears at the top of the file. Completing that list is usually the last thing done on a stabilizing release branch; some projects write the list piecemeal as they're developing, others prefer to save it all up for the end and have one person write it, getting information by combing the version control logs. The list looks something like this:
gl: Debe haber tamén un ficheiro <filename>CHANGES</filename> (as veces chamado <filename>NEWS</filename>), explicando cales son as novidades da versión. O ficheiro <filename>CHANGES</filename> acumula a lista de trocos para todas as versións, en orde cronolóxico inverso, para que a lista de cambios da versión apareza no principio do ficheiro. Completar esa lista é normalmente a derradeira cousa que hai que facer para estabilizara versión; algúns proxectos escriben a lista pouco a pouco segundo se vai desenvolvendo, outros prefiren facelo ao final e ter una persoa para escribilos, recollendo informacion combinando os logs do control de versións. A lista é algo así:

source: The list can be as long as necessary, but don't bother to include every little bugfix and feature enhancement. Its purpose is simply to give users an overview of what they would gain by upgrading to the new release. In fact, the changelist is customarily included in the announcement email (see <xref linkend="testing-and-releasing"/><phrase output="printed"> later in this chapter</phrase>), so write it with that audience in mind.
gl: A lista pode ser tan longa coma sexa necesaria, pero non fai falta incluir cada pequeno erro resolto e funcionalidade. O seu propósito é simplemente darlle aos usuarios una visión sobre o que eles gañan actualizando a nova versión. De feito, a lista de cambios é incluida normalmente no mail de anuncio (ver <xref linkend="testing-and-releasing"/><phrase output="printed"> máis adiante neste capitulo</phrase>), polo tanto escribea coa audiencia en mente.

source: Traditionally, a file named <firstterm>ChangeLog</firstterm> lists every change ever made to a project&mdash;that is, every revision committed to the version control system. There are various formats for ChangeLog files; the details of the formats aren't important here, as they all contain the same information: the date of the change, its author, and a brief summary (or just the log message for that change).
gl: Tradicionalmente, un ficheiro chamado <firstterm>ChangeLog</firstterm> que lista cada cambio feito no proxecto&mdash; isto é, cada revisión comiteada no sistema de control de versións. Hai varios formatos para os ficheiros ChangeLog; os detalles dos formatos non son importantes aqui, xa que todos eles conteñen a mesma información: a data do cambio, o autor, e un breve resumo (ou simplemente a mensaxe de log para ese cambio).

source: A <filename>CHANGES</filename> file is different. It too is a list of changes, but only the ones thought important for a certain audience to see, and often with metadata like the exact date and author stripped off. To avoid confusion, don't use the terms interchangeably. Some projects use "NEWS" instead of "CHANGES"; although this avoids the potential for confusion with "ChangeLog", it is a bit of a misnomer, since the CHANGES file retains change information for all releases, and thus has a lot of old news in addition to the new news at the top.
gl: O ficheiro <filename>CHANGES</filename> é diferente. Tamén é unha lista de cambios, pero so os que son importantes para que certa audiencia os vexa, e a miudo con metadata como a hora exacta e o autor. Para evitar confusións, non empregue termos intercambiables. Algúns proxectos empregan "NEWS" en lugar de "CHANGES"; ainda que isto evita a potencial confución con "ChangeLog", é un termo un pouco errado xa que o ficheiro CHANGES ten información para todas as versións, e ten moitas noticias vellas ademáis das novas na cima.
