Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: One of the most important features of collaborative development software (see <xref linkend="technical-infrastructure"/>) is that it keeps accurate records of who did what, when. Wherever possible, use these existing mechanisms to make sure that credit is distributed accurately, and be specific about the nature of the contribution. Don't just write "Thanks to J. Random &lt;jrandom@example.com&gt;" if instead you can write "Thanks to J. Random &lt;jrandom@example.com&gt; for the bug report and reproduction recipe" in a log message.
gl: Unha das características máis importantes do desenvolvemento colaborativo de software (véxase <xref linkend="technical-infrastructure"/>) é que conserva rexistros precisos sobre quen fixo que e cando. Sempre que for posible, débense empregar estes mecanismos existentes para asegurar que o mérito é distribuído correctamente, sendo específicos na natureza da contribución. Non escribir simplemente "Gracias a X. Aleatorio &lt;xaleatorio@exemplo.gl&gt;" se podemos poñer "Gracias a X. Aleatorio &lt;xaleatorio@exemplo.gl&gt; polo informe do erro e o método para repetilo" nunha mensaxe de log.

source: In Subversion, we have an informal but consistent policy of crediting the reporter of a bug in either the issue filed, if there is one, or the log message of the commit that fixes the bug, if not. A quick survey of Subversion commit logs up to commit number 14525 shows that about 10% of commits give credit to someone by name and email address, usually the person who reported or analyzed the bug fixed by that commit. Note that this person is different from the developer who actually made the commit, whose name is already recorded automatically by the version control system. Of the 80-odd full and partial committers Subversion has today, 55 were credited in the commit logs (usually multiple times) before they became committers themselves. This does not, of course, prove that being credited was a factor in their continued involvement, but it at least sets up an atmosphere in which people know they can count on their contributions being acknowledged.
gl: En Subversion temos unha política informal mais coherente de acreditación de informes de erros, ben nun ficheiro de problemas, se existir, ou na mensaxe de log do commit que soluciona o erro. Unha inspección rápida do log de commits de Subversion ata o número 14525 mostra que preto do 10% dos commits acreditan alguén polo nome e o enderezo de correo electrónico, normalmente a persoa que informou ou analizou o erro solucionado nese commit. Nótese que esta persoa é diferente do desenvolvedor que realmente fixo o commit, cuxo nome xa é rexistrado automaticamente no sistema de control de versións. Dos oitenta e tantos committers globais e parciais, cincuenta e cinco foron acreditados en logs de commit (normalmente múltiples veces) antes de seren committers. Isto non demostra, evidentemente, que ter sido acreditado fose un factor na súa colaboración continua no proxecto, mais polo menos crea unha atmosfera na cal a xente sabe que pode contar con que as súas contribucións sexan recoñecidas.

source: It is important to distinguish between routine acknowledgment and special thanks. When discussing a particular piece of code, or some other contribution someone made, it is fine to acknowledge their work. For example, saying "Daniel's recent changes to the delta code mean we can now implement feature X" simultaneously helps people identify which changes you're talking about and acknowledges Daniel's work. On the other hand, posting solely to thank Daniel for the delta code changes serves no immediate practical purpose. It doesn't add any information, since the version control system and other mechanisms have already recorded the fact that he made the changes. Thanking everyone for everything would be distracting and ultimately information-free, since thanks are effective largely by how much they stand out from the default, background level of favorable comment going on all the time. This does not mean, of course, that you should never thank people. Just make sure to do it in ways that tend not to lead to credit inflation. Following these guidelines will help:
gl: É importante distinguir entre a rutina de recoñecemento e os agradecementos especiais. Cando se discute un fragmento particular de código, ou calquera outra contribución, sempre é correcto recoñecer o traballo feito. Por exemplo, dicir "as mudanzas recentes de Xan sobre o código delta queren dicir que agora podemos implementar a funcionalidade X" simultaneamente axudan á xente a identificar de que mudanza se está a falar e recoñece o traballo de Xan. Por outra banda, darlle as gracias nun post individual a Xan non ten ningunha utilidade inmediata. Non engade información, xa que o sistema de control de versións e outros mecanismos xa rexistraron o feito de que el fixo as mudanzas. Agradecer a todos por todo sería unha distracción e carecería de toda información, debido a que o agradecemento resulta efectivo na medida en que se aparta dos comentarios favorables que se ven habitualmente. Isto non quere dicir, por suposto, que nunca se deba agradecer á xente. Só se debe estar seguro de que non se fai de maneira que conduza ao exceso de recoñecemento. As seguintes liñas xerais son de axuda niso:

source: The more ephemeral the forum, the more free you should feel to express thanks there. For example, thanking someone for their bugfix in passing during an IRC conversation is fine, as is an aside in an email devoted mainly to other topics. But don't post an email solely to thank someone, unless it's for a truly unusual feat. Likewise, don't clutter the project's web pages with expressions of gratitude. Once you start that, it'll never be clear when or where to stop. And <emphasis>never</emphasis> put thanks into comments in the code; that would only be a distraction from the primary purpose of comments, which is to help the reader understand the code.
gl: Canto máis efémero sexa o foro, con máis liberdade se pode agradecer nel. Por exemplo, agradecer alguén por arranxar un erro durante unha conversa de IRC é correcto, así como facelo nun correo centrado principalmente noutros temas. Mais non se debe mandar un correo unicamente para agradecer alguén, se non for por algunha labor realmente inédita. Do mesmo xeito, non se deben encher as páxinas do proxecto con expresións de gratitude. Unha vez que se comeza, nunca estará claro onde ou cando deterse. E <emphasis>nunca</emphasis> pór agradecementos no código; iso sería unicamente unha distracción sobre o obxectivo principal dos comentarios, que é axudar o lector a comprender o código.

source: The less involved someone is in the project, the more appropriate it is to thank her for something she did. This may sound counterintuitive, but it fits with the attitude that expressing thanks is something you do when someone contributes even more than you thought she would. Thus, to constantly thank regular contributors for doing what they normally do would be to express a lower expectation of them than they have of themselves. If anything, you want to aim for the opposite effect!
gl: Canto menos participar alguén nun proxecto, máis apropiado vai ser agradecerlle o traballo feito. Isto pode parecer un contrasentido, mais encaixa coa actitude de que expresar agradecemento é algo que se fai cando alguén contribúe máis do que era de esperar. Polo tanto, agradecer continuamente a xente que contribúe habitualmente por un traballo que xa farían en condicións normais ía querer dicir que esperamos deles menos que eles mesmos, e está claro que se algo nos interesa é o efecto contrario.

source: There are occasional exceptions to this rule. It's acceptable to thank someone for fulfilling his expected role when that role involves temporary, intense efforts from time to time. The canonical example is the release manager, who goes into high gear around the time of each release, but otherwise lies dormant (dormant as a release manager, in any case&mdash;he may also be an active developer, but that's a different matter).
gl: Existen algunhas excepción a esta norma. Resulta aceptable agradecer alguén por cumprir o seu rol cando ese traballo require esforzos importantes de cando en vez. O exemplo por excelencia é o xestor das versións, quen realiza un traballo importante cando se libera cada versión, mentres que o resto do tempo permanece inactivo (inactivo como xestor das versións, xa que por outra banda pode ser un desenvolvedor activo, mais iso é outro asunto).

source: As with criticism and crediting, gratitude should be specific. Don't thank people just for being great, even if they are. Thank them for something they did that was out of the ordinary, and for bonus points, say exactly why what they did was so great.
gl: Igual que as críticas e o recoñecemento, o agradecemento debe ser específico. Non se debe agradecer a xente simplemente por seren excelentes, mesmo se realmente o son. Os agradecementos faranse por algo fóra do ordinario, e por puntos adicionais, aclarando por que o traballo feito foi tan destacable.

source: In general, there is always a tension between making sure that people's individual contributions are recognized, and making sure the project is a group effort rather than a collection of individual glories. Just remain aware of this tension and try to err on the side of group, and things won't get out of hand.
gl: En xeral, sempre hai tensión entre asegurarse de que as contribucións individuais da xente son recoñecidas e que o proxecto resulta máis un esforzo de grupo que una colección de logros individuais. Simplemente hai que ser conscientes desta tensión e tratar de inclinar a balanza cara ao lado do grupo, e dese modo estará baixo control.

source: Forks
gl: Ramas

source: In <xref linkend="forkability"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase>, we saw how the <emphasis>potential</emphasis> to fork has important effects on how projects are governed. But what happens when a fork actually occurs? How should you handle it, and what effects can you expect it to have? Conversely, when should you <emphasis>initiate</emphasis> a fork?
gl: En <xref linkend="forkability"/><phrase output="printed"> en <xref linkend="social-infrastructure"/></phrase> vimos como o <emphasis>potencial</emphasis> de crear ramas ten importantes efectos en como se gobernan os proxectos. Mais, ¿que ocorre cando realmente se crea unha nova rama? ¿Como se debe manexar, e que efectos podemos esperar dela? No estremo contrario, cando se debe <emphasis>iniciar</emphasis> unha nova rama?

source: The answers depend on what kind of fork it is. Some forks are due to amicable but irreconcilable disagreements about the direction of the project; perhaps more are due to both technical disagreements and interpersonal conflicts. Of course, it's not always possible to tell the difference between the two, as technical arguments may involve personal elements as well. What all forks have in common is that one group of developers (or sometimes even just one developer) has decided that the costs of working with some or all of the others now outweigh the benefits.
gl: A resposta depende da clase de rama que sexa. Algunhas débense a desacordos amigables mais irreconciliables sobre a dirección do proxecto; quizais os máis debidos tanto a diverxencias técnicas como a conflitos persoais. Por suposto, non sempre é posible diferenciar ambos, xa que argumentos técnicos poden tamén implicar elementos persoais. O que tódalas ramas teñen en común é que un grupo de desenvolvedores (nalgunhas ocasión mesmo un só deles) decidiu que o custe de traballar con algúns ou con tódolos demais supera os beneficios.

source: Once a project forks, there is no definitive answer to the question of which fork is the "true" or "original" project. People will colloquially talk of fork F coming out of project P, as though P is continuing unchanged down some natural path while F diverges into new territory, but this is, in effect, a declaration of how that particular observer feels about it. It is fundamentally a matter of perception: when a large enough percentage of observers agree, the assertion starts to become true. It is not the case that there is an objective truth from the outset, one that we are only imperfectly able to perceive at first. Rather, the perceptions <emphasis>are</emphasis> the objective truth, since ultimately a project&mdash;or a fork&mdash;is an entity that exists only in people's minds anyway.
gl: Unha vez que un proxecto se ramifica, non hai unha resposta segura sobre a pregunta de cal é o proxecto "verdadeiro" ou "orixinal". A xente falará de maneira coloquial acerca de unha rama R que sae dun proxecto P, de maneira que P segue o seu rumbo natural mentres que R penetra nun novo territorio, mais isto é, realmente, unha declaración de como ese observador en concreto percibe a situación. Trátase fundamentalmente dun asunto de percepción: cando un porcentaxe suficientemente grande de observadores está de acordo, devandita afirmación comeza a ser certa. Non se trata de que exista unha verdade obxectiva, unha que simplemente non somos capaces de percibir desde o principio, senón de que as percepcións <emphasis>son</emphasis> a verdade obxectiva, simplemente porque un proxecto&mdash;ou unha rama&mdash;é unha entidade abstracta na nosa mente.

source: If those initiating the fork feel that they are sprouting a new branch off the main project, the perception question is resolved immediately and easily. Everyone, both developers and users, will treat the fork as a new project, with a new name (perhaps based on the old name, but easily distinguishable from it), a separate web site, and a separate philosophy or goal. Things get messier, however, when both sides feel they are the legitimate guardians of the original project and therefore have the right to continue using the original name. If there is some organization with trademark rights to the name, or legal control over the domain or web pages, that usually resolves the issue by fiat: that organization will decide who is the project and who is the fork, because it holds all the cards in a public relations war. Naturally, things rarely get that far: since everyone already knows what the power dynamics are, they will avoid fighting a battle whose outcome is known in advance, and just jump straight to the end.
gl: Se a xente que crea unha nova rama sente que están indo nun camiño diferente ao do proxecto principal, a cuestión queda resolta inmediata e sinxelamente. Todos, tanto desenvolvedores coma usuarios, tratarán á rama coma un novo proxecto, cun novo nome (pode que baseado no antigo, mais facilmente distinguible del), un sitio web diferente e unha filosofía de traballo ou un obxectivo distinto. En troca, as cousas complícanse cando ambos lados cren ser os gardiáns lexítimos do proxecto orixinal e por tanto teñen dereito a continuaren co antigo nome. Se existir algunha organización con dereitos sobre o nome, ou control legal sobre o dominio ou páxinas web, o problema resólvese habitualmente segundo o seu criterio: a organización decidirá quen é o proxecto e quen a rama, porque ten tódalas de gañar nunha guerra de relacións públicas. Naturalmente, rara vez as cousas chegan tan lonxe: como todos coñecen as dinámicas do poder, evitan unha guerra cuxo resultado xa saben de antemán, e prefiren ir directamente á solución.

source: Fortunately, in most cases there is little doubt as to which is the project and which is the fork, because a fork is, in essence, a vote of confidence. If more than half of the developers are in favor of whatever course the fork proposes to take, usually there is no need to fork&mdash;the project can simply go that way itself, unless it is run as a dictatorship with a particularly stubborn dictator. On the other hand, if fewer than half of the developers are in favor, the fork is a clearly minority rebellion, and both courtesy and common sense indicate that it should think of itself as the divergent branch rather than the main line.
gl: Por sorte, na maioría dos casos hai poucas dúbidas sobre cal é o proxecto e cal a rama, porque a rama é, en esencia, un voto de confianza. Se máis da metade dos desenvolvedores estiveren a favor de calquera rumbo que a rama propón tomar, habitualmente non hai motivos para ramificar; o proxecto simplemente vai ir por ese camiño por si mesmo, a non ser que estea controlado por un ditador especialmente teimudo. Por outra banda, se estiveren a favor menos da metade dos desenvolvedores, a rama é claramente unha rebelión minoritaria, e tanto a cortesía coma o sentido común dinnos que eles mesmos deberían considerarse unha rama diverxente mais que a tendencia principal.

source: Handling a Fork
gl: Manexar unha rama

source: If someone threatens a fork in your project, keep calm and remember your long-term goals. The mere <emphasis>existence</emphasis> of a fork isn't what hurts a project; rather, it's the loss of developers and users. Your real aim, therefore, is not to squelch the fork, but to minimize these harmful effects. You may be mad, you may feel that the fork was unjust and uncalled for, but expressing that publicly can only alienate undecided developers. Instead, don't force people to make exclusive choices, and be as cooperative as is practicable with the fork. To start with, don't remove someone's commit access in your project just because he decided to work on the fork. Work on the fork doesn't mean that person has suddenly lost his competence to work on the original project; committers before should remain committers afterward. Beyond that, you should express your desire to remain as compatible as possible with the fork, and say that you hope developers will port changes between the two whenever appropriate. If you have administrative access to the project's servers, publicly offer the forkers infrastructure help at startup time. For example, offer them a complete, deep-history copy of the version control repository, if there's no other way for them to get it, so that they don't have to start off without historical data (this may not be necessary depending on the version control system). Ask them if there's anything else they need, and provide it if you can. Bend over backward to show that you are not standing in the way, and that you want the fork to succeed or fail on its own merits and nothing else.
gl: Se alguén ameazar con crear unha rama no teu proxecto, mantén a calma e recorda os teus obxectivos a longo prazo. A simple <emphasis>existencia</emphasis> da rama non prexudica o proxecto, senón a perda de desenvolvedores e usuarios. Polo tanto o teu verdadeiro obxectivo non é esmagar esa rama, senón minimizar eses efectos daniños. Podes enfadarte, pensar que a rama é inxusta e ninguén a pedía, mais expresalo en público só servirá para alienar a desenvolvedores indecisos. En troca diso, non forces á xente a tomaren decisións excluíntes, e sé tan cooperativo coa rama como for posible. Para comezar, non revoques permisos de commit no teu proxecto a alguén simplemente porque decidiu traballar na rama. Traballar nela non significa que esa persoa perdera de repente a súa competencia para traballar no proxecto orixinal; os committers anteriores deberían seguir séndoo. Aparte disto, deberías expresar o teu desexo de ter toda a compatibilidade posible coa rama, e afirmar que desexas que os desenvolvedores adaptarán mudanzas entre ambos sempre que for apropiado. Se tivres acceso como administrador aos servidores do proxecto, ofrece publicamente as túas infraestruturas para os seus inicios. Por exemplo, ofrécelles unha copia completa do repositorio de control de versións, se non tiveren outra maneira de conseguilo, de modo que non teñan que comezar sen ningún dato histórico (isto pode non ser necesario segundo o sistema de control de versións empregado). Pregúntalles se precisan algunha outra cousa, e proporciónalla na medida do posible. Móstrate cordial e amistoso con eles, sen estorbarlles no seu camiño, demostrando que queres que a rama teña un futuro baseado nos seus propios méritos, nin máis nin menos.

source: The reason to do all this&mdash;and do it publicly&mdash;is not to actually help the fork, but to persuade developers that your side is a safe bet, by appearing as non-vindictive as possible. In war it sometimes makes sense (strategic sense, if not human sense) to force people to choose sides, but in free software it almost never does. In fact, after a fork some developers often openly work on both projects, and do their best to keep the two compatible. These developers help keep the lines of communication open after the fork. They allow your project to benefit from interesting new features in the fork (yes, the fork may have things you want), and also increase the chances of a merger down the road.
gl: A razón de faceres todo isto&mdash;e de facérelo publicamente&mdash;non é axudares realmente á rama, senón persuadires aos desenvolvedores de que o teu lado é unha aposta segura, semellando o menos vingativo posible. Na guerra ás veces ten sentido (sentido estratéxico, non ético) forzares a xente a escolleren bando, mais no software libre rara vez é así. De feito, tras unha rama é habitual que algúns desenvolvedores colaboren publicamente en ambos proxectos e fagan todo o posible por mantelos compatibles. Estes desenvolvedores axudan a manter as liñas de comunicación abertas despois de que se crea a rama. Tamén permiten que o teu proxecto se beneficie de novas características interesantes na rama (si, é posible que a rama teña cousas que che interesen) e incrementan as posibilidades dunha fusión máis adiante.
