Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: <blockquote> <para><emphasis>At the Apache Software foundation we discourage the use of author tags in source code. There are various reasons for this, apart from the legal ramifications. Collaborative development is about working on projects as a group and caring for the project as a group. Giving credit is good, and should be done, but in a way that does not allow for false attribution, even by implication. There is no clear line for when to add or remove an author tag. Do you add your name when you change a comment? When you put in a one-line fix? Do you remove other author tags when you refactor the code and it looks 95% different? What do you do about people who go about touching every file, changing just enough to make the virtual author tag quota, so that their name will be everywhere?</emphasis></para> <para><emphasis>There are better ways to give credit, and our preference is to use those. From a technical standpoint author tags are unnecessary; if you wish to find out who wrote a particular piece of code, the version control system can be consulted to figure that out. Author tags also tend to get out of date. Do you really wish to be contacted in private about a piece of code you wrote five years ago and were glad to have forgotten?</emphasis></para> </blockquote> <para>A software project's source code files are the core of its identity. They should reflect the fact that the developer community as a whole is responsible for them, and not be divided up into little fiefdoms.</para> <para>People sometimes argue in favor of author or maintainer tags in source files on the grounds that this gives visible credit to those who have done the most work there. There are two problems with this argument. First, the tags inevitably raise the awkward question of how much work one must do to get one's own name listed there too. Second, they conflate the issue of credit with that of authority: having done work in the past does not imply ownership of the area where the work was done, but it's difficult if not impossible to avoid such an implication when individual names are listed at the tops of source files. In any case, credit information can already be obtained from the version control logs and other out-of-band mechanisms like mailing list archives, so no information is lost by banning it from the source files themselves.<footnote><para>But see the mailing list thread entitled <citetitle>"having authors names in .py files"</citetitle> at <ulink url="http://groups.google.com/group/sage-devel/browse_thread/thread/e207ce2206f0beee"></ulink> for a good counterargument, particularly the post from William Stein. The key in that case, I think, is that many of the authors come from a culture (the academic mathematics community) where crediting directly at the source is the norm and is highly valued. In such circumstances, it may be preferable to put author names into the source files, along with precise descriptions of what each author did, since the majority of potential contributors will expect that style of acknowledgement.</para></footnote></para> <para>If your project decides to ban individual names from source files, make sure not to go overboard. For instance, many projects have a <filename>contrib/</filename> area where small tools and helper scripts are kept, often written by people who are otherwise not associated with the project. It's fine for those files to contain author names, because they are not really maintained by the project as a whole. On the other hand, if a contributed tool starts getting hacked on by other people in the project, eventually you may want to move it to a less isolated location and, assuming the original author approves, remove the author's name, so that the code looks like any other community-maintained resource. If the author is sensitive about this, compromise solutions are acceptable, for example:</para> <blockquote> <programlisting> # indexclean.py: Remove old data from a Scanley index. # # Original Author: K. Maru &lt;kobayashi@yetanotheremailservice.com&gt; # Now Maintained By: The Scanley Project &lt;http://www.scanley.org/&gt; # and K. Maru. # # ... </programlisting> </blockquote>
gl: <blockquote> <para><emphasis>Na Apache Software Foundation desalentamos o uso de etiquetas de autor no código fonte. Hai varias razóns para isto, a parte da ramificacións legais. O desenvolvemento colaborativo trata sobre o traballo como un grupo nos proxectos, coidándoos como un grupo. Dar recoñecemento é bo, e debería facerse, mais dun xeito que non permita falsa atribución, nin sequera por implicación. Non hai unha liña clara que marque cando engadir ou quitar unha etiqueta de autor. Engades o teu nome cando mudas un comentario? Cando aportas unha solución dunha liña? Quitas a etiqueta de autor doutro contribuínte cando refactorizas o seu código nun 95%? Que fas coa xente que toca cada ficheiro, mudando unicamente o necesario para facerse o autor virtual segundo as etiquetas de autor, de xeito que o seu nome estea en todos lados?</emphasis></para> <para><emphasis>Hai mellores xeitos de dar crédito, e nós preferimos empregar estoutros. Desde un punto de vista técnico, as etiquetas de autor son innecesarias; se queres saber quen escribiu un anaco de código en particular, o sistema de control de versións pode ser consultado para averigualo. As etiquetas de autor tenden a desactualizarse. Realmente queres que contacten contigo dun xeito privado sobre unha peza de código que escribiches hai cinco anos e da que estarías contento de poder esquecerte?</emphasis></para> </blockquote> <para>Os ficheiros fonte dun proxecto de software son o núcleo da súa identidade. Deberían reflectir o feito de que a comunidade de desenvolvemento no seu conxunto é a responsable del, e non estar dividido en pequena leiras.</para> <para>A xente ás veces argumenta a favor das etiquetas de autor ou de mantedor nos ficheiros fonte naquelas áreas que fixeron a maior parte do traballo e nas que lles habería que dar un crédito visible. Hai dous problemas con este argumento: Primeiro, as etiquetas inevitablemente sempre fan xurdir a fea cuestión de canto traballo debe facer un para ter o seu propio nome incluído na lista. Segundo, mesturan a cuestión do crédito coa da autoría: ter feito traballo no pasado non implica a propiedade da área na que o traballo foi feito, mais é difícil, senón imposible, obviar esta implicación cando nomes individuais son listados no cabezallo dos ficheiros fonte. En calquera caso, a información de crédito tamén pode ser obtida dos logs do control de versión e doutros mecanismos como os arquivos das listas de correo, polo que non se perde ningunha información como consecuencia da prohibición de explicitala nos ficheiros fonte.<footnote><para>Pero podes ver o fío titulado <citetitle>"having authors names in .py files"</citetitle> en<ulink url="http://groups.google.com/group/sage-devel/browse_thread/thread/e207ce2206f0beee"></ulink> para unha boa contraargumentación, en particular na mensaxe de William Stein. A chave, nese caso, penso, é que moito autores veñen dunha cultura (a comunidade académica matemática) onde o crédito inserido directamente nas fontes é a norma e é altamente considerado. Nestas circunstancias, pode ser preferible incluír os nomes dos autores nos ficheiros fonte, incluíndo unha precisa descrición do que cada autor fixo, dado que a maioría dos autores van esperar un recoñecemento deste estilo.</para></footnote></para> <para>Se o teu proxecto decide prohibir os nomes individuais nos ficheiros fonte, asegúrate de non meteres a zoca. Por exemplo, moitos proxectos teñen unha área de <filename>contrib/</filename> (contribucións) onde se manteñen pequenas ferramentas e scripts de axuda, habitualmente escritos por xente que doutro xeito non estaría asociada co proxecto. É bo que estes ficheiros si conteñan nomes de autor, porque realmente non están sendo mantidos polo conxunto do proxecto. Por outra banda, se unha ferramenta así contribuída comeza a recibir contribucións e hacks por parte de outra xente do proxecto, pode que queiras movela a un lugar menos isolado, asumindo a aprobación do autor orixinal, e eliminar o nome do autor, para que o código se mostre do mesmo xeito que calquera outro recurso mantido pola comunidade. Se o autor for sensible respecto a isto, hai solucións de compromiso aceptables como, por exemplo::</para> <blockquote> <programlisting> # indexclean.py: Borra datos antigos orixinados por un índice. # # Autor Orixinal: K. Maru &lt;kobayashi@yetanotheremailservice.com&gt; # Agora Mantido Por: O Proxecto Scanley &lt;http://www.scanley.org/&gt; # e K. Maru. # # ... </programlisting> </blockquote>

source: But it's better to avoid such compromises, if possible, and most authors are willing to be persuaded, because they're happy that their contribution is being made a more integral part of the project.
gl: Mais é mellor evitares estes compromisos, na medida que for posible, e a maioría dos autores están dispostos a seren persuadidos, porque se senten felices de que a súa contribución se converta nun parte máis integral do proxecto.

source: The important thing is to remember that there is a continuum between the core and the periphery of any project. The main source code files for the software are clearly part of the core, and should be considered as maintained by the community. On the other hand, companion tools or pieces of documentation may be the work of single individuals, who maintain them essentially alone, even though the works may be associated with, and even distributed with, the project. There is no need to apply a one-size-fits-all rule to every file, as long as the principle that community-maintained resources are not allowed to become individual territories is upheld.
gl: O importante é lembrares que hai unha continuidade entre o núcleo e a periferia de calquera proxecto. Os ficheiros fonte principais para o software son claramente parte do núcleo, e debería considerarse que son mantidos pola comunidade. Por outra banda, as ferramentas de acompañamento ou as pezas de documentación poden ser o traballo de individuos isolados, os cales os manteñen en solitario, aínda cando ese traballo poida asociarse, ou mesmo distribuírse, co proxecto. Non hai necesidade de aplicar a mesma regra a cada ficheiro, sempre e cando se cumpra o principio de que os recursos mantidos pola comunidade non poidan converterse no coto privado de ninguén.

source: The Automation Ratio
gl: A relación de automatización

source: Try not to let humans do what machines could do instead. As a rule of thumb, automating a common task is worth at least ten times the effort a developer would spend doing that task manually one time. For very frequent or very complex tasks, that ratio could easily go up to twenty or even higher.
gl: Tenta evitar que os humanos fagan aquelo que as máquinas poden facer no seu lugar. Como norma xeral, automatizar unha tarefa común supón dez veces menos traballo do que perdería un desenvolvedor facéndoa manualmente de cada vez. Para tarefas moi frecuentes ou complexas, a relación pode facilmente dispararse a vinte ou máis.

source: Thinking of yourself as a "project manager", rather than just another developer, may be a useful attitude here. Sometimes individual developers are too wrapped up in low-level work to see the big picture and realize that everyone is wasting a lot of effort performing automatable tasks manually. Even those who do realize it may not take the time to solve the problem: because each individual performance of the task does not feel like a huge burden, no one ever gets annoyed enough to do anything about it. What makes automation compelling is that that small burden is multiplied by the number of times each developer incurs it, and then <emphasis>that</emphasis> number is multiplied by the number of developers.
gl: Pensar en ti mesmo como un "xefe de proxecto" máis que como simplemente outro desenvolvedor pode ser unha actitude moi positiva neste particular. Ás veces os desenvolvedores individuais están demasiado metidos no traballo de baixo nivel e non son capaces de veren o cadro ao completo e decatarse de que alguén está gastando unha morea de esforzo levando a cabo manualmente tarefas que se poderían automatizar. Mesmo aqueles que si que se decatan poden non empregar o tempo preciso para resolveren o problema: dado que o rendemento e custo individual de cada tarefa non se presentan como demasiado altos no conxunto, nunca ninguén se anoxa tanto como para facer algo ao respecto. O que fai atractiva a automatización é que esa pequena carga multiplícase polo número de veces que cada desenvolvedor debe afrontala, e <emphasis>ese</emphasis> número aínda hai que multiplicalo polo número de desenvolvedores.

source: Here, I am using the term "automation" broadly, to mean not only repeated actions where one or two variables change each time, but any sort of technical infrastructure that assists humans. The minimum standard automation required to run a project these days was described in <xref linkend="technical-infrastructure"/>, but each project may have its own special problems too. For example, a group working on documentation might want to have a web site displaying the most up-to-date versions of the documents at all times. Since documentation is often written in a markup language like XML, there may be a compilation step, often quite intricate, involved in creating displayable or downloadable documents. Arranging a web site where such compilation happens automatically on every commit can be complicated and time-consuming&mdash;but it is worth it, even if it costs you a day or more to set up. The overall benefits of having up-to-date pages available at all times are huge, even though the cost of <emphasis>not</emphasis> having them might seem like only a small annoyance at any single moment, to any single developer.
gl: Aquí estou a empregar o termo "automatización" nun senso amplo, para dar a entender non unicamente tarefas repetitivas onde unha ou dúas variables mudan de cada vez, senón tamén calquera tipo de infraestrutura técnica que axude os humanos. A automatización mínima estándar precisa para levar a cabo un proxecto a día de hoxe describiuse en <xref linkend="technical-infrastructure"/>, mais cada proxecto pode ter a súa problemática específica, por suposto. Por exemplo, un grupo traballando en documentación podería querer ter un sitio web no que se mostren as versións máis actualizadas dos documentos en cada momento. Dado que a documentación adoita escribirse en linguaxes de marcado estilo XML, pode haber un paso de compilación, ás veces bastante intricado, involucrado na creación dos documentos visualizables e descarregables. Desenvolver unha páxina web onde esta compilación se faga de xeito automático ante cada commit pode ser complexo e bastante esixente en tempo&mdash;mais é rendible, mesmo se a súa configuración che custa un día ou máis. O beneficio xeral de ter páxinas actualizadas dispoñibles en todo momento é enorme, mesmo se o custo de <emphasis>non</emphasis> telas puidese parecerlle un tema menor nun momento concreto a algún desenvolvedor concreto.

source: Taking such steps eliminates not merely wasted time, but the griping and frustration that ensue when humans make missteps (as they inevitably will) in trying to perform complicated procedures manually. Multi-step, deterministic operations are exactly what computers were invented for; save your humans for more interesting things.
gl: Dar estes pasos non só elimina gastos de tempo, senón que tamén elimina as obsesións e frustracións que aparecen nas persoas cando cometen erros (cousa que inevitablemente vai suceder) ao tentar executaren manualmente procedementos complexos. As operacións deterministas de varios pasos é precisamente para o que se inventaron os computadores; deixa que os humanos fagan cousas máis interesantes.

source: Automated testing
gl: Probas automáticas

source: Automated test runs are helpful for any software project, but especially so for open source projects, because automated testing (especially regression testing) allows developers to feel comfortable changing code in areas they are unfamiliar with, and thus encourages exploratory development. Since detecting breakage is so hard to do by hand&mdash;one essentially has to guess where one might have broken something, and try various experiments to prove that one didn't&mdash;having automated ways to detect such breakage saves the project a <emphasis>lot</emphasis> of time. It also makes people much more relaxed about refactoring large swaths of code, and therefore contributes to the software's long-term maintainability.
gl: As execucións automáticas de probas son útiles para calquera proxecto de software, pero aínda o son máis no caso dos proxectos de software libre, dado que a testaxe automatizada (especialmente a testaxe de regresión) permite que os desenvolvedores se sintan cómodos mudando código en áreas que non lles son familiares, e mesmo fomenta o desenvolvemento exploratorio. Como é moi difícil detectar fallos a man&mdash;tes que adiviñar onde puideches romper algo, e probar varios experimentos para comprobares se o fixeches ou non&mdash;ter mecanismos automatizados para detectar estes erros afórralle ao proxecto <emphasis>unha chea</emphasis> de tempo. A maiores, tamén consegue que a xente se sinta máis relaxada á hora de refactorizar grandes conxuntos de código, e polo tanto contribúe a manter a longo prazo o software.

source: Regression Testing
gl: Probas de regresión

source: <firstterm>Regression testing</firstterm> means testing for the reappearance of already-fixed bugs. The purpose of regression testing is to reduce the chances that code changes will break the software in unexpected ways. As a software project gets bigger and more complicated, the chances of such unexpected side effects increase steadily. Good design can reduce the rate at which the chances increase, but it cannot eliminate the problem entirely.
gl: As <firstterm>probas de regresión</firstterm> son as comprobacións que se fan para detectar a reaparición de erros previamente reparados. A finalidade das probas de regresión é reducir a probabilidade de que mudanzas no código rompan o software de xeito inesperado. Do mesmo xeito que un proxecto de software vai aumentando de tamaño e complexidade, as probabilidades destes efectos colaterais aumentan da man. Un bo deseño pode reducir a relación de incremento destas probabilidades, mais non pode eliminar o problema por completo.

source: As a result, many projects have a <firstterm>test suite</firstterm>, a separate program that invokes the project's software in ways that have been known in the past to stimulate specific bugs. If the test suite succeeds in making one of these bugs happen, this is known as a <firstterm>regression</firstterm>, meaning that someone's change unexpectedly unfixed a previously-fixed bug.
gl: Como resposta a esta problemática, moitos proxectos teñen unha <firstterm>colección de probas</firstterm>, un programa separado que invoca o software do proxecto en casuísticas nas que se sabe que no pasado se producían erros. Se a colección de probas fai que aparezan algúns deste erros, entón este feito coñécese como <firstterm>regresión</firstterm>, o que quere dicir que as mudanzas feitas por alguén reabriron un erro previamente reparado.

source: See also <ulink url="http://en.wikipedia.org/wiki/Regression_testing"></ulink>.
gl: Bótalle unha ollada a <ulink url="http://en.wikipedia.org/wiki/Regression_testing"></ulink>.

source: Regression testing is not a panacea. For one thing, it works best for programs with batch-style interfaces. Software that is operated primarily through graphical user interfaces is much harder to drive programmatically. Another problem is that the regression test suite framework itself can often be quite complex, with a learning curve and maintenance burden all its own. Reducing this complexity is one of the most useful things you can do, even though it may take a considerable amount of time. The easier it is to add new tests to the suite, the more developers will do so, and the fewer bugs will survive to release. Any effort spent making tests easier to write will be paid back manyfold over the lifetime of the project.
gl: As probas de regresión non son a panacea. Ten en conta que funcionan mellor con programas con interfaces ao estilo dos procesos por lotes. O software que se opera principalmente a través de interfaces de usuario é moito máis complicado de manexar programaticamente. Outro problema é que o marco das coleccións de proba para comprobacións de regresión habitualmente é bastante complexo, cunha curva de aprendizaxe e de mantemento nada desprezables. Reducir esta complexidade é unha das cousas máis útiles que podes facer, mesmo se implica a inversión dunha morea considerable de tempo. Canto máis sinxelo for engadir novas comprobacións á colección, máis desenvolvedores as engadirán, e así a taxa de supervivencia dos erros será moito menor. Calquera esforzo dirixido a facer que as comprobacións sexan máis sinxelas de compoñer será recompensado con xuros abundantes ao longo do ciclo de vida do proxecto.

source: Many projects have a <firstterm>"Don't break the build!"</firstterm> rule, meaning: don't commit a change that makes the software unable to compile or run. Being the person who broke the build is usually cause for mild embarrassment and ribbing. Projects with regression test suites often have a corollary rule: don't commit any change that causes tests to fail. Such failures are easiest to spot if there are automatic nightly runs of the entire test suite, with the results mailed out to the development list or to a dedicated test-results mailing list; that's another example of a worthwhile automation.
gl: Moitos proxectos observan con decisión a regra de <firstterm>"Non rompas o que funciona!" </firstterm>, o que significa: non fagas mudanzas que deixen o software nun estado no que non compile ou non execute. Ser a persoa que rompeu a compilación ou execución adoita causar certa vergoña e burla. Os proxectos que teñen coleccións de probas de regresión habitualmente teñen como norma un corolario da anterior: non fagas ningunha mudanza que provoque que as comprobacións fallen. Estes fallos son sinxelos de identificar se hai execucións nocturnas automáticas das coleccións de proba nas que se envíen os resultados por correo-e á lista de desenvolvemento ou a listas dedicadas aos resultados das probas; este é outro exemplo de automatización que vale a pena.
