Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: Sometimes a fork becomes so successful that, even though it was regarded even by its own instigators as a fork at the outset, it becomes the version everybody prefers, and eventually supplants the original by popular demand. A famous instance of this was the GCC/EGCS fork. The <firstterm>GNU Compiler Collection</firstterm> (<firstterm>GCC</firstterm>, formerly the <firstterm>GNU C Compiler</firstterm>) is the most popular open source native-code compiler, and also one of the most portable compilers in the world. Due to disagreements between the GCC's official maintainers and Cygnus Software,<footnote><para>Now part of RedHat (<ulink url="http://www.redhat.com/"></ulink>).</para></footnote> one of GCC's most active developer groups, Cygnus created a fork of GCC called <firstterm>EGCS</firstterm>. The fork was deliberately non-adversarial: the EGCS developers did not, at any point, try to portray their version of GCC as a new official version. Instead, they concentrated on making EGCS as good as possible, incorporating patches at a faster rate than the official GCC maintainers. EGCS gained in popularity, and eventually some major operating system distributors decided to package EGCS as their default compiler instead of GCC. At this point, it became clear to the GCC maintainers that holding on to the "GCC" name while everyone switched to the EGCS fork would burden everyone with a needless name change, yet do nothing to prevent the switchover. So GCC adopted the EGCS codebase, and there is once again a single GCC, but greatly improved because of the fork.
gl: Nalgunhas ocasións, unha rama ten tanto éxito que, mesmo se foi considerada polos seus creadores como unha rama diverxente, tórnase a versión preferida por todos, e chega un momento en que supera a orixinal en demanda popular. O exemplo por excelencia disto é a rama GCC/EGCS. A <firstterm>GNU Compiler Collection</firstterm> (<firstterm>GCC</firstterm>, antigamente o <firstterm>GNU C Compiler</firstterm>) é o compilador de código fonte libre máis popular, e tamén un dos compiladores máis portables do mundo Debido a desacordos entre os mantedores oficiais de GCC e Cygnus Software<footnote><para>Agora parte de RedHat (<ulink url="http://www.redhat.com/"></ulink>).</para></footnote>, un dos grupos de desenvolvedores de GCC máis activos, Cygnus creou unha rama de GCC chamada <firstterm>EGCS</firstterm>. A rama foi deliberadamente amistosa: os desenvolvedores de EGCS non tentaron, en ningún momento, implantar a súa versión de GCC como unha nova versión oficial. No seu lugar, concentráronse en facer EGCS o mellor posible, incorporando remendos a un maior ritmo que os mantedores oficiais de GCC. EGCS gañou popularidade, e finalmente algunhas distribucións decidiron substituír GCC por EGCS como o seu compilador por defecto. Chegado este punto, fíxose evidente para os mantedores de GCC que manter o nome "GCC" mentres que todo o mundo migraba a EGCS simplemente serviría para que todo o mundo sufrira unha mudanza de nome sen motivo algún. Por iso GCC adoptou o código base de EGCS, e así temos de novo un único GCC, mais inmensamente mellorado debido á rama.

source: This example shows why you cannot always regard a fork as an unadulteratedly bad thing. A fork may be painful and unwelcome at the time, but you cannot necessarily know whether it will succeed. Therefore, you and the rest of the project should keep an eye on it, and be prepared not only to absorb features and code where possible, but in the most extreme case to even join the fork if it gains the bulk of the project's mindshare. Of course, you will often be able to predict a fork's likelihood of success by seeing who joins it. If the fork is started by the project's biggest complainer and joined by a handful of disgruntled developers who weren't behaving constructively anyway, they've essentially solved a problem for you by forking, and you probably don't need to worry about the fork taking momentum away from the original project. But if you see influential and respected developers supporting the fork, you should ask yourself why. Perhaps the project was being overly restrictive, and the best solution is to adopt into the mainline project some or all of the actions contemplated by the fork&mdash;in essence, to avoid the fork by becoming it.
gl: Este exemplo demostra por que non debemos considerar sempre unha rama como algo inevitablemente malo. Unha rama pode ser dolorosa e molesta en certo momento, mais nunca podemos saber se vai ter éxito. Polo tanto debemos manter, xunto co resto do proxecto, un ollo sobre ela, e estarmos preparados non só para absorbermos funcionalidades e código cando for posible, senón para no caso máis extremo unírmonos á rama se se convirte no referente do obxectivo do proxecto. Por suposto, é habitual podermos predicir as posibilidades de éxito dunha rama segundo quen se unir a ela. Se é comezada polo membro máis molesto do proxecto, e seguido por un bo número de desenvolvedores anoxados que xa non tiñan unha actitude construtiva, en esencia resolveron un dos nosos problemas, e probablemente non nos teñamos que preocupar de se a rama supera o proxecto orixinal. Mais se vemos como influentes e respectados desenvolvedores apoian a rama, deberiamos preguntarnos o motivo. Pode que o proxecto estea sendo demasiado restritivo, e a mellor solución pasa por adoptarmos na liña principal algunha ou tódalas accións contempladas na rama&mdash;en esencia, evitarmos que a rama se produza como tal.

source: Initiating a Fork
gl: Comezar unha rama

source: All the advice here assumes that you are forking as a last resort. Exhaust all other possibilities before starting a fork. Forking almost always means losing developers, with only an uncertain promise of gaining new ones later. It also means starting out with competition for users' attention: everyone who's about to download the software has to ask themselves: "Hmm, do I want that one or the other one?" Whichever one you are, the situation is messy, because a question has been introduced that wasn't there before. Some people maintain that forks are healthy for the software ecosystem as a whole, by a standard natural selection argument: the fittest will survive, which means that, in the end, everyone gets better software. This may be true from the ecosystem's point of view, but it's not true from the point of view of any individual project. Most forks do not succeed, and most projects are not happy to be forked.
gl: Tódolos consellos aquí asumen que pensamos en crear unha rama como último recurso, fartos doutras posibilidades xa tentadas. Crear unha rama case sempre implica perder desenvolvedores, con só unha pequena esperanza de gañar outros novos máis adiante. Tamén quere dicir comezar de novo con competencia por captar a atención do usuario: todo o que estiver a punto de descargar o software preguntarase "Hmmmm, prefiro este ou este outro?". En calquera caso, a situación é confusa, porque se introduce unha nova pregunta. Algunha xente sostén que as ramas son saudables para o ecosistema do software en conxunto, por un argumento de selección natural estándar: o máis capacitado sobrevive, o que significa que, ao final, todos conseguen un mellor software. Pode que isto sexa certo desde o punto de vista do ecosistema, mais non desde o punto de vista de calquera proxecto individual. A maioría das ramas non teñen éxito, e a maioría dos proxectos non se alegran de sufriren ramas.

source: A corollary is that you should not use the threat of a fork as an extremist debating technique&mdash;"Do things my way or I'll fork the project!"&mdash;because everyone is aware that a fork that fails to attract developers away from the original project is unlikely to survive long. All observers&mdash;not just developers, but users and operating system packagers too&mdash;will make their own judgement about which side to choose. You should therefore appear extremely reluctant to fork, so that if you finally do it, you can credibly claim it was the only route left.
gl: Un corolario disto é que non se debe empregar a ameaza dunha rama como una técnica extremista de debate&mdash;"Ou fas as cousas á miña maneira ou ramifico o proxecto!"&mdash;porque todos son conscientes de que unha rama que non logra atraer desenvolvedores do proxecto orixinal ten poucas probabilidades de sobrevivir. Tódolos observadores&mdash;non soamente desenvolvedores, senón tamén usuarios e empacotadores de sistemas operativos&mdash;farán o seu xuízo sobre que lado escoller. Polo tanto debemos ter moitas reticencias coa creación de ramas, de maneira que cando o fagamos sexa porque non vemos outra solución.

source: Do not neglect to take <emphasis>all</emphasis> factors into account in evaluating the potential success of your fork. For example, if many of the developers on a project have the same employer, then even if they are disgruntled and privately in favor of a fork, they are unlikely to say so out loud if they know that their employer is against it. Many free software programmers like to think that having a free license on the code means no one company can dominate development. It is true that the license is, in an ultimate sense, a guarantor of freedom&mdash;if others want badly enough to fork the project, and have the resources to do so, they can. But in practice, some projects' development teams are mostly funded by one entity, and there is no point pretending that that entity's support doesn't matter. If it is opposed to the fork, its developers are unlikely to take part, even if they secretly want to.
gl: Non debemos descoidarnos á hora de termos en conta <emphasis>tódolos</emphasis> factores cando avaliamos o éxito potencial da nosa rama. Por exemplo, se moitos desenvolvedores do proxecto teñen o mesmo xefe, mesmo se están molestos e persoalmente a favor da rama, será difícil que o demostren se saben que o seu xefe se mostra en contra dela. A moitos programadores de software libre gústalles pensar que ter unha licenza de software libre no código significa que ningunha compañía pode dominar no desenvolvemento. É verdade que a licenza é, en última instancia, unha garantía da liberdade&mdash;se outros teñen o suficiente interese en crear unha rama, e os recursos necesarios, poden facelo. Mais na práctica, algúns equipos de desenvolvedores de proxectos están fundados na súa maioría por unha entidade, e non podemos pretender que o seu soporte non importa. Se for contrario á rama, os desenvolvedores raramente tomarán parte, mesmo se en secreto así o queren.

source: If you still conclude that you must fork, line up support privately first, then announce the fork in a non-hostile tone. Even if you are angry at, or disappointed with, the current maintainers, don't say that in the message. Just dispassionately state what led you to the decision to fork, and that you mean no ill will toward the project from which you're forking. Assuming that you do consider it a fork (as opposed to an emergency preservation of the original project), emphasize that you're forking the code and not the name, and choose a name that does not conflict with the project's name. You can use a name that contains or refers to the original name, as long as it does not open the door to identity confusion. Of course it's fine to explain prominently on the fork's home page that it descends from the original program, and even that it hopes to supplant it. Just don't make users' lives harder by forcing them to untangle an identity dispute.
gl: Se, contodo, decidimos crear unha rama, en primeiro lugar buscaremos apoio de maneira privada, e logo o anunciaremos nun ton nada hostil, aínda que esteamos molestos ou decepcionados cos mantedores actuais. Simplemente explicaremos con desilusión os motivos que nos levaron a ramificar e que non desexamos ningún mal ao proxecto orixinal. Asumindo que realmente o consideramos unha rama (en contraposición a preservación de emerxencia do proxecto orixinal), faremos énfase en que estamos ramificando o código e non o nome, e escolleremos un novo que non sexa conflitivo co orixinal. Podemos empregar un que teña referencias ao nome orixinal mentres non leve a confusión á hora de identificalos. Por suposto podemos explicar na páxina web da rama que descende do programa orixinal, e mesmo que tenta substituílo. Soamente tentaremos non facer a vida dos usuarios máis difícil introducíndoos nunha disputa de identidades.

source: Finally, you can get things started on the right foot by automatically granting all committers of the original project commit access to the fork, including even those who openly disagreed with the need for a fork. Even if they never use the access, your message is clear: there are disagreements here, but no enemies, and you welcome code contributions from any competent source.
gl: Finalmente, podemos comezar as cousas con bo pé outorgando permisos de commit na rama a tódolos committers do proxecto orixinal, incluídos aqueles que estiveren manifestamente en contra da ramificación. Mesmo se nunca fixeren uso do seu acceso, a nosa mensaxe é clara: pode que haxa desacordos, mais non enemigos, e agradecemos as contribucións de código de calquera colaborador competente.
