Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: In the Subversion project, we choose committers primarily on the Hippocratic Principle: <emphasis>first, do no harm</emphasis>. Our main criterion is not technical skill or even knowledge of the code, but merely that the committer show good judgement. Judgement can mean simply knowing what not to take on. A person might post only small patches, fixing fairly simple problems in the code; but if the patches apply cleanly, do not contain bugs, and are mostly in accord with the project's log message and coding conventions, and there are enough patches to show a clear pattern, then an existing committer will usually propose that person for commit access. If at least three people say yes, and no one objects, then the offer is made. True, we might have no evidence that the person is able to solve complex problems in all areas of the code base, but that does not matter: the person has made it clear that he is capable of at least judging his own abilities. Technical skills can be learned (and taught), but judgement, for the most part, cannot. Therefore, it is the one thing you want to make sure a person has before you give him commit access.
gl: No proxecto Subversion escollemos os committers principalmente empregando o Principio Hipocrático:<emphasis>primeiro, non fagas dano</emphasis>. O noso criterio principal non son nin as capacidades técnicas nin o coñecemento do código, simplemente que o committer amose un bo criterio. Criterio pode simplemente significar saber o que non asumir. Unha persoa podería enviar soamente pequenos remendos, arranxando pequenos problemas no código; mais se os remendos se aplican limpamente, non conteñen erros, e están en harmonía co rexistro de mensaxes e as guías de estilo do proxecto, e hai remendos de abondo para consideralo un padrón evidente, entón un commiter existente habitualmente proporá esa persoa para darlle permiso de commit. Se un mínimo de tres persoas din que si, e ninguén se opón, faise a oferta. Certo, pode que non teñamos ningunha proba de que a persoa está capacitada para resolver problemas complexos en tódalas áreas do código, mais iso non importa: a persoa deixou claro que polo menos é quen de xulgar as súas propias habilidades. As capacidades técnicas pódense aprender (e ensinar), mais o criterio, as máis das veces, non. Polo tanto, esta é a única cousa da que te tes que asegurar que unha persoa ten antes de darlle permiso de commit.

source: When a new committer proposal does provoke a discussion, it is usually not about technical ability, but rather about the person's behavior on the mailing lists or in IRC. Sometimes someone shows technical skill and an ability to work within the project's formal guidelines, yet is also consistently belligerent or uncooperative in public forums. That's a serious concern; if the person doesn't seem to shape up over time, even in response to hints, then we won't add him as a committer no matter how skilled he is. In a volunteer group, social skills, or the ability to "play well in the sandbox", are as important as raw technical ability. Because everything is under version control, the penalty for adding a committer you shouldn't have is not so much the problems it could cause in the code (review would spot those quickly anyway), but that it might eventually force the project to revoke the person's commit access&mdash;an action that is never pleasant and can sometimes be confrontational.
gl: Cando unha proposta nova de committer provoca unha discusión, non adoita ser sobre as capacidades técnicas, senón máis ben sobre o comportamento desa persoa nas listas de correo ou no IRC. Ás veces, unha persoa amosa capacidades técnicas e habilidades para traballar conforme á filosofía do proxecto, mais tamén se amosa constantemente belixerante e non cooperativa nos foros públicos. Este é un asunto importante: se a persoa non se adaptar ao longo do tempo, mesmo como resposta a indirectas, entón non imos engadilo como commiter independentemente do capacitado que estiver. Nun grupo de voluntarios, as habilidades sociais, ou a habilidade de "xogar limpo na area", son tan importantes como as capacidades técnicas en estado puro. Xa que todo está baixo control de versións, as consecuencias de ter engadido a un commiter que non deberías non son tanto os problemas que pode causar no código (a revisión sacaríaos á luz) como que pode forzar finalmente a anular o permiso de committer desa persoa; unha medida que non é nunca agradable e pode ás veces causar confrontacións.

source: Many projects insist that the potential committer demonstrate a certain level of technical expertise and persistence, by submitting some number of nontrivial patches&mdash;that is, not only do these projects want to know that the person will do no harm, they want to know that she is likely to do good across the code base. This is fine, but be careful that it doesn't start to turn committership into a matter of membership in an exclusive club. The question to keep in everyone's mind should be "What will bring the best results for the code?" not "Will we devalue the social status associated with committership by admitting this person?" The point of commit access is not to reinforce people's self-worth, it's to allow good changes to enter the code with a minimum of fuss. If you have 100 committers, 10 of whom make large changes on a regular basis, and the other 90 of whom just fix typos and small bugs a few times a year, that's still better than having only the 10.
gl: Moitos proxectos insisten en que un commiter potencial ten que demostrar un certo nivel de experiencia técnica e persistencia, enviando un certo número de remendos non triviais; é dicir, estes proxectos non se conforman con saber que a persoa non fará dano, senón que queren saber que probablemente traballará ben ao longo do código. Isto está ben, mais hai que ter coidado de que non converta a pertenza ó grupo de committers nunha cuestión de pertenza a un grupo exclusivo. A pregunta que todo o mundo debería ter na cabeza é "Que traerá os mellores resultados para o código?" e non "Imos empeorar o status social asociado coa pertenza ao grupo de committers admitindo a esta persoa?" A idea do permiso de commit non é reforzar a autoestima da xente, senón permitir que as boas mudanzas entren no código cun mínimo esforzo. Se tiveres 100 committers, 10 dos cales fan grandes mudanzas por norma xeral, e os outros 90 só arranxan erros de escritura e pequenos erros poucas veces ao ano, isto é mellor que ter so ós 10 primeiros.

source: Revoking Commit Access
gl: Revocación do permiso de commit

source: The first thing to be said about revoking commit access is: try not to be in that situation in the first place. Depending on whose access is being revoked, and why, the discussions around such an action can be very divisive. Even when not divisive, they will be a time-consuming distraction from productive work.
gl: A primeira cousa que se debe dicir sobre revocar o permiso de commit é: tenta non chegar a esta situación, en primeiro lugar. Dependendo de a quen se lle retirar o permiso, e por que, as discusións en torno a está situación poden chegar a dividir. Mesmo se non chegaren a dividir, serán unha perda de tempo que nos distraerán do traballo produtivo.

source: However, if you must do it, the discussion should be had privately among the same people who would be in a position to vote for <emphasis>granting</emphasis> that person whatever flavor of commit access they currently have. The person herself should not be included. This contradicts the usual injunction against secrecy, but in this case it's necessary. First, no one would be able to speak freely otherwise. Second, if the motion fails, you don't necessarily want the person to know it was ever considered, because that could open up questions ("Who was on my side? Who was against me?") that lead to the worst sort of factionalism. In certain rare circumstances, the group may want someone to know that revocation of commit access is or was being considered, as a warning, but this openness should be a decision the group makes. No one should ever, on her own initiative, reveal information from a discussion and ballot that others assumed were secret.
gl: Porén, se tiveres que facelo, a discusión debería manterse en privado entre as mesmas persoas que estarían en posición de votar para concederlle o permiso a esa persoa, independentemente do tipo de permiso de commit que tiver. A persoa involucrada non debería estar incluída nesta discusión. Isto refuta o mandato habitual en contra do segredo, mais neste caso é preciso. Primeiro, ninguén sería quen de falar libremente no caso contrario. Segundo, se a moción fracasar, pode non interesarche que a persoa saiba que foi considerada, porque isto podería provocar que lle xurdisen preguntas. (Quen estivo do meu lado? Quen estivo na miña contra?) que conducirán ao peor dos sectarismos. En certas circunstancias estranas, o grupo pode querer que a persoa coñeza que a revocación do permiso de commit se considera ou se considerou, como un aviso, mais isto debe ser unha decisión do grupo. Ninguén debería, por iniciativa propia, revelar información relativa a unha discusión e votación que os demais supoñen secreta.

source: Once someone's access is revoked, that fact is unavoidably public (see <xref linkend="commit-access-openness"/><phrase output="printed"> later in this chapter</phrase>), so try to be as tactful as you can in how it is presented to the outside world.
gl: Unha vez que o permiso é revocado, debe facerse público inevitablemente (ver <xref linkend="commit-access-openness"/><phrase output="printed"> máis adiante neste capítulo), así que tenta ser o máis diplomático posible en canto á forma en que o anuncias ao mundo exterior.

source: Partial Commit Access
gl: Permiso de commit parcial

source: Some projects offer gradations of commit access. For example, there might be contributors whose commit access gives them free rein in the documentation, but who do not commit to the code itself. Common areas for partial commit access include documentation, translations, binding code to other programming languages, specification files for packaging (e.g., RedHat RPM spec files, etc.), and other places where a mistake will not result in a problem for the core project.
gl: Certos proxectos ofrecen graos de permiso de commit. Por exemplo, podería haber contribuíntes con permisos que lles proporcionen vía libre na documentación, mais que non poidan facer commits sobre o código. Áreas habituais para permisos de commit parciais son documentación, traducións, ligazóns de código con outras linguaxes de programación, especificación para o empacotado dos ficheiros (p.ex. especificación RPM de RedHat), e outras áreas onde un erro non causará un problema no núcleo do proxecto.

source: Since commit access is not only about committing, but about being part of an electorate (see <xref linkend="electorate"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase>), the question naturally arises: what can the partial committers vote on? There is no one right answer; it depends on what sorts of partial commit domains your project has. In Subversion we've kept things fairly simple: a partial committer can vote on matters confined exclusively to that committer's domain, and not on anything else. Importantly, we do have a mechanism for casting advisory votes (essentially, the committer writes "+0" or "+1&nbsp;(non-binding)" instead of just "+1" on the ballot). There's no reason to silence people entirely just because their vote isn't formally binding.
gl: Xa que o permiso de commit non implica só facer commits, senón tamén formar parte dun electorado (ver <xref linkend="electorate"/><phrase output="printed"> en <xref linkend="social-infrastructure"/></phrase>),a pregunta naturalmente xorde: en que poden votar os committers parciais? Non hai resposta correcta; depende do tipo de dominios de commit parcial do proxecto. No proxecto Subversion mantemos as cousas moi simples: un commiter parcial pode votar en temas relacionados exclusivamente co seu dominio de commit, e en nada máis. É importante destacar que temos mecanismos para emitirmois votos de asesoramento (basicamente o committer escribe "+0" ou "+1 (non vinculante)" en vez de "+1"). Non hai razón para silenciar a xente simplemente porque o seu voto non é formalmente vinculante.

source: Full committers can vote on anything, just as they can commit anywhere, and only full committers vote on adding new committers of any kind. In practice, though, the ability to add new partial committers is usually delegated: any full committer can "sponsor" a new partial committer, and partial committers in a domain can often essentially choose new committers for that same domain (this is especially helpful in making translation work run smoothly).
gl: Os committers con permiso total poden votar sobre calquera cuestión, do mesmo xeito que poden facer commits en calquera parte do código, e só eles poden votar para engadir novos committers de calquera tipo. Na práctica, porén, a capacidade para engadir novos commiter con permisos parciais é delegada. Calquera commiter total pode "patrocinar" un commiter parcial, e os commiters parciais poden ás veces escoller novos commiters para o seu dominio (isto axuda considerablemente a axilizar o traballo de tradución).

source: Your project may need a slightly different arrangement, depending on the nature of the work, but the same general principles apply to all projects. Each committer should be able to vote on matters that fall within the scope of her commit access, and not on matters outside that, and votes on procedural questions should default to the full committers, unless there's some reason (as decided by the full committers) to widen the electorate.
gl: O teu proxecto pode precisar dunha filosofía diferente, dependendo da natureza do traballo, mais estes mesmos principios xerais son válidos para tódolos proxectos. Cada committer debe poder votar nos temas que caen dentro do seu dominio de commit, e non en temas que caen fóra del, e os votos sobre cuestións relativas ao procedemento deben ser por defecto dos committers totais, a menos que exista algunha razón (decidida polos committers totais) para ampliar o electorado.

source: Regarding enforcement of partial commit access: it's often best <emphasis>not</emphasis> to have the version control system enforce partial commit domains, even if it can. See <xref linkend="vc-authz"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase> for the reasons why.
gl: Con respecto á aplicación de permiso de commit parcial: adoita ser mellor <emphasis>non</emphasis> empregar o sistema de control de versións para aplicar dominios de commit parcial, mesmo se for posible. Mira <xref linkend="vc-authz"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase> para saberes por que.

source: Dormant Committers
gl: Committers inactivos

source: Some projects automatically remove people's commit access if they go a certain amount of time (say, a year) without committing anything. I think this is usually unhelpful and even counterproductive, for two reasons.
gl: Algúns proxectos automaticamente revogan o permiso para facer commits da xente se pasaren un determinado período de tempo (por exemplo, un ano) sen faceren ningún commit. Penso que isto é normalmente erróneo e mesmo contraproducente, por dúas razóns.

source: First, it may tempt some people into committing acceptable but unnecessary changes, just to prevent their commit access from expiring. Second, it doesn't really serve any purpose. If the main criterion for granting commit access is good judgement, then why assume someone's judgement would deteriorate just because he's away from the project for a while? Even if he completely vanishes for years, not looking at the code or following development discussions, when he reappears he'll <emphasis>know</emphasis> how out of touch he is, and act accordingly. You trusted his judgement before, so why not trust it always? If high school diplomas do not expire, then commit access certainly shouldn't.
gl: Primeiro, pode tentar a xente a faceren commits de mudanzas aceptables, mais innecesarias, simplemente para evitaren que o permiso para facer commits expire. En segundo lugar, non serve realmente para ningún propósito. Se o principal motivo para outorgar permiso de commit é o bo xuízo, entón por que asumir que o xuízo sobre alguén se deteriora simplemente porque se afasta do proxecto por un tempo? Mesmo se desaparecer completamente por anos, sen atender ao código ou ás discusións dos desenvolvedores, cando reaparece quererá <emphasis>saber</emphasis> como de desconectado está realmente, e actuar en consecuencia. Confiaches nel anteriormente, así que por que non confiar nel sempre? Se os diplomas do instituto non caducan, é evidente que o acceso de commit tampouco debería.

source: Sometimes a committer may ask to be removed, or to be explicitly marked as dormant in the list of committers (see <xref linkend="commit-access-openness"/><phrase output="printed"> below</phrase> for more about that list). In these cases, the project should accede to the person's wishes, of course.
gl: Ás veces un committer pode pedir ser eliminado, ou ser marcado explicitamente como inactivo, na lista de committers (véxase <xref linkend="commit-access-openness"/><phrase output="printed"> máis adiante</phrase> para coñecer mellor esa lista). Nestes casos, o proxecto debería acceder aos desexos da persoa, evidentemente.

source: Avoid Mystery
gl: Evitar o misterio

source: Although the discussions around adding any particular new committer must be confidential, the rules and procedures themselves need not be secret. In fact, it's best to publish them, so people realize that the committers are not some mysterious Star Chamber, closed off to mere mortals, but that anyone can join simply by posting good patches and knowing how to handle herself in the community. In the Subversion project, we put this information right in the developer guidelines document, since the people most likely to be interested in how commit access is granted are those thinking of contributing code to the project.
gl: Embora as discusión acerca de aceptar novos comitters deban ser confidenciais, as propias regras e procedementos non deben selo. De feito, é mellor publicalos, de modo que a xente comprenda que os committers non son ningunha Cámara Celestial pechada aos meros mortais, senón que calquera pode unirse simplemente posteando bos remendos e sabendo como manexarse na comunidade. No proxecto Subversion poñemos esta información directamente no documento coas pautas para os desenvolvedores, xa que a xente máis interesada en coñecer como se outorgan permisos para commits é aquela que pensa en contribuír co proxecto.

source: In addition to publishing the procedures, publish the actual <emphasis>list</emphasis> of committers. The traditional place for this is a file called <filename>MAINTAINERS</filename> or <filename>COMMITTERS</filename> in the top level of the project's source code tree. It should list all the full committers first, followed by the various partial commit domains and the members of each domain. Each person should be listed by name and email address, though the address can be encoded to prevent spam (see <xref linkend="address-hiding"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>) if the person prefers that.
gl: Para alén de publicares os procedementos, publica a <emphasis>lista</emphasis> completa e actualizada de committers. O lugar onde se adoita facer é o arquivo <filename>MAINTAINERS</filename>, ou <filename>COMMITTERS</filename> no nivel máis alto da árbore de código fonte do proxecto. Debería ser unha lista que inclúa en primeiro lugar os committers globais, seguidos dos diferentes dominios de commit parciais e os membros de cada un deles. Cada persoa debe ser listada co nome e o enderezo de email, embora o enderezo se poida cifrar para evitar spam (véxase <xref linkend="address-hiding"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>) se a persoa o preferir.

source: Since the distinction between full commit and partial commit access is obvious and well defined, it is proper for the list to make that distinction too. Beyond that, the list should not try to indicate the informal distinctions that inevitably arise in a project, such as who is particularly influential and how. It is a public record, not an acknowledgments file. List committers either in alphabetical order, or in the order in which they arrived.
gl: Xa que a distinción entre acceso como committer global e parcial é obvia e ben definida, é aconsellable indicala na lista tamén. Para alén disto, a lista non debe tratar de indicar as diferenzas informais que inevitablemente xorden en cada proxecto, como quen son as persoas máis influíntes, e de que modo. Trátase dun rexistro público, non dun ficheiro de recoñecementos. Os committers lístanse en orde alfabética ou na orde en que se uniron ao proxecto.

source: Credit
gl: Recoñecemento

source: Credit is the primary currency of the free software world. Whatever people may say about their motivations for participating in a project, I don't know any developers who would be happy doing all their work anonymously, or under someone else's name. There are tangible reasons for this: one's reputation in a project roughly governs how much influence one has, and participation in an open source project can also indirectly have monetary value, because some employers now look for it on resum&eacute;s. There are also intangible reasons, perhaps even more powerful: people simply want to be appreciated, and instinctively look for signs that their work was recognized by others. The promise of credit is therefore one of best motivators the project has. When small contributions are acknowledged, people come back to do more.
gl: O recoñecemento é a principal moeda no mundo do software libre. Embora todo o que a xente diga sobre as súas motivacións para traballar nun proxecto, non coñezo ningún desenvolvedor que se sentise feliz facendo o seu traballo de maneira anónima ou co nome doutra persoa. Existen razóns tanxibles para isto: a reputación de cada un nun proxecto determina claramente a súa influencia, e a participación nun proxecto de software libre tamén pode indirectamente proporcionar beneficios económicos, porque actualmente algúns empresarios os buscan nos currículums. Hai tamén razóns intanxibles, quizais máis poderosas: a xente simplemente quere ser apreciada, e instintivamente buscan sinais de que o seu traballo é recoñecido por outros. A promesa do recoñecemento está aí e constitúe unha das maiores motivacións que un proxecto ten. Cando as pequenas contribución son recoñecidas, a xente volta para facer máis.
