Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: Most volunteer developers are willing to take the extra time to write regression tests, when the test system is comprehensible and easy to work with. Accompanying changes with tests is understood to be the responsible thing to do, and it's also an easy opportunity for collaboration: often two developers will divide up the work for a bugfix, with one writing the fix itself, and the other writing the test. The latter developer may often end up with more work, and since writing a test is already less satisfying than actually fixing the bug, it is imperative that the test suite not make the experience more painful than it has to be.
gl: A maioría dos desenvolvedores voluntarios están dispostos a empregaren tempo extra en escribiren probas de regresión, sempre e cando o sistema de comprobacións sexa comprensible e sexa fácil de traballar con el. O acompañamento das mudanzas coas comprobacións habitualmente enténdese como unha cuestión de responsabilidade, e a maiores tamén é unha boa oportunidade para que xurda a colaboración: habitualmente dous desenvolvedores divídense o traballo preciso para reparar un erro, cun deles escribindo a corrección en si mesma, e co outro escribindo a comprobación. O segundo desenvolvedor pode ter ao final máis traballo, e a maiores escribir a comprobación é menos satisfactorio que escribir a corrección do erro, polo que se torna imperativo que a experiencia de usuario coa colección de comprobacións non sexa máis dolorosa do imprescindible.

source: Some projects go even further, requiring that a new test accompany <emphasis>every</emphasis> bugfix or new feature. Whether this is a good idea or not depends on many factors: the nature of the software, the makeup of the development team, and the difficulty of writing new tests. The CVS (<ulink url="http://www.cvshome.org/"></ulink>) project has long had such a rule. It is a good policy in theory, since CVS is version control software and therefore very risk-averse about the possibility of munging or mishandling the user's data. The problem in practice is that CVS's regression test suite is a single huge shell script (amusingly named <filename>sanity.sh</filename>), hard to read and hard to modify or extend. The difficulty of adding new tests, combined with the requirement that patches be accompanied by new tests, means that CVS effectively discourages patches. When I used to work on CVS, I sometimes saw people start on and even complete a patch to CVS's own code, but give up when told of the requirement to add a new test to <filename>sanity.sh</filename>.
gl: Algúns proxectos aínda van máis alá, requirindo que unha nova comprobación acompañe <emphasis>cada</emphasis> solución de erros ou nova funcionalidade. Pode ser unha boa idea ou non en función de varios factores: a natureza do software, a predisposición do equipo de desenvolvemento, e a dificultade de escribir novas comprobacións. O proxecto CVS (<ulink url="http://www.cvshome.org/"></ulink>) hai tempo que tivo esta norma. En teoría é unha boa política, dado que CVS é un software de control de versións e por tanto debe ter unha alta aversión polos riscos e posibilidades de perder ou corromper os datos dos usuarios. Na práctica o problema está en que a colección de probas de regresión de CVS é un solitario script para consola de comandos (apropiadamente chamado <filename>sanity.sh</filename>) moi difícil de ler, modificar ou estender. A dificultade de engadir novos casos de proba, combinada co requisito de que os remendos deben estar acompañados de novas comprobacións, provoca que efectivamente CVS free o envío de remendos. Cando traballaba en CVS, ás veces vin xente comezar ou mesmo rematar un remendo para CVS, mais renderse e abandonar cando lles mencionaba o requisito de que tiñan que engadir un novo caso de proba ao ficheiro <filename>sanity.sh</filename>.

source: It is normal to spend more time writing a new regression test than on fixing the original bug. But CVS carried this phenomenon to an extreme: one might spend hours trying to design one's test properly, and still get it wrong, because there are just too many unpredictable complexities involved in changing a 35,000-line Bourne shell script. Even longtime CVS developers often grumbled when they had to add a new test.
gl: É normal empregares máis tempo escribindo un novo caso de proba de regresión que en solucionares o erro orixinal. Mais CVS levou este fenómeno ás súas últimas consecuencias: podías perder horas tentando deseñar convenientemente un novo caso de proba, e mesmo así non conseguilo debido a que había demasiadas complexidades imprevisibles á hora de mudar un ficheiro de liña de comandos composto por 35.000 liñas de código. Mesmo os desenvolvedores que participaban desde había moito tempo rosmaban cando tiñan que engadir un novo caso de proba.

source: This situation was due to a failure on all our parts to consider the automation ratio. It is true that switching to a real test framework&mdash;whether custom-built or off-the-shelf&mdash;would have been a major effort.<footnote><para>Note that there would be no need to convert all the existing tests to the new framework; the two could happily exist side by side, with old tests converted over only as they needed to be changed.</para></footnote> But neglecting to do so has cost the project much more, over the years. How many bugfixes and new features are <emphasis>not</emphasis> in CVS today, because of the impediment of an awkward test suite? We cannot know the exact number, but it is surely many times greater than the number of bugfixes or new features the developers might forgo in order to develop a new test system (or integrate an off-the-shelf system). That task would only take a finite amount of time, while the penalty of using the current test suite will continue forever if nothing is done.
gl: Esta situación debíase a un fallo de parte a parte na consideración da relación de automatización. É certo que facer a mudanza a un marco de comprobacións real&mdash;tanto fose personalizado como empregado así como saía da caixa&mdash;tería sido un esforzo moi grande.<footnote><para>. Ten en conta que non había a necesidade de converter todas as probas preexistentes ao novo marco/ferramenta de comprobación; os dous marcos/ferramentas poderían convivir, convertendo unicamente aquelas comprobacións que precisaran ser actualizadas.</para></footnote> Mais negarse a facelo tivo un custo moito maior para o proxecto, ao longo dos anos. Cantas correccións de erros e novas funcionalidades <emphasis>non</emphasis> están incluídas en CVS hoxe en día debido ás dificultades que producía unha colección de probas pouco axeitada? Non podemos saber o número exacto, mais seguramente sexa varias veces maior que o número de correccións de erros e novas funcionalidades que se perderían polo gasto do tempo preciso para desenvolver un novo sistema de comprobación (ou integrar un xa desenvolvido). Esta tarefa consumiría unicamente unha cantidade de tempo finita, mentres que a penalización derivada do uso do sistema de comprobacións que se emprega prolongarase para sempre se non se fai nada ao respecto.

source: The point is not that having strict requirements to write tests is bad, nor that writing your test system as a Bourne shell script is necessarily bad. It might work fine, depending on how you design it and what it needs to test. The point is simply that when the test system becomes a significant impediment to development, something must be done. The same is true for any routine process that turns into a barrier or a bottleneck.
gl: A cuestión non está en que ter requisitos estritos de escritura de comprobacións sexa malo, nin peor que escribir o teu sistema de comprobacións como un script por liña de comandos. Todo isto podería funcionar ben, dependendo de como o deseñes e do que necesites comprobar. A cuestión redúcese a que cando o sistema de comprobacións se convirte nun impedimento significativo para o desenvolvemento, debes facer algo. O mesmo pensamento pode estenderse para calquera proceso rotineiro que se converte nunha barreira ou gargalo.

source: Treat Every User as a Potential Volunteer
gl: Trata a cada usuario como un potencial voluntario

source: Each interaction with a user is an opportunity to get a new volunteer. When a user takes the time to post to one of the project's mailing lists, or to file a bug report, he has already tagged himself as having more potential for involvement than most users (from whom the project will never hear at all). Follow up on that potential: if he described a bug, thank him for the report and ask him if he wants to try fixing it. If he wrote to say that an important question was missing from the FAQ, or that the program's documentation was deficient in some way, then freely acknowledge the problem (assuming it really exists) and ask if he's interested in writing the missing material himself. Naturally, much of the time the user will demur. But it doesn't cost much to ask, and every time you do, it reminds the other listeners in that forum that getting involved in the project is something anyone can do.
gl: Todo contacto cun usuario é unha oportunidade para captares un novo voluntario. Cando un usuario se molesta en enviar unha mensaxe a unha lista de correo ou cubrir un erro no bugtracker, está amosando máis potencial de colaboración que a maioría de outros usuarios dos que nunca se saberá nada. Fomenta ese potencial: se enviar un erro, agradécelle o traballo e pregúntalle se desexa corrixilo. Se apuntou que á FAQ lle falta algunha cuestión importante ou que a documentación é mellorable en certo punto, entón recoñece abertamente o problema (se en verdade existir) e pregúntalle se está interesado en resolvelo el mesmo. Evidentemente, algúns porán obxeccións e non o farán. Mais non custa nada preguntar, e cada vez que o fas, estás recordándolle aos outros usuarios que participar no proxecto é algo que todo o mundo pode facer.

source: Don't limit your goals to acquiring new developers and documentation writers. For example, even training people to write good bug reports pays off in the long run, if you don't spend <emphasis>too</emphasis> much time per person, and if they go on to submit more bug reports in the future&mdash;which they are more likely to do if they got a constructive reaction to their first report. A constructive reaction need not be a fix for the bug, although that's always the ideal; it can also be a solicitation for more information, or even just a confirmation that the behavior <emphasis>is</emphasis> a bug. People want to be listened to. Secondarily, they want their bugs fixed. You may not always be able to give them the latter in a timely fashion, but you (or rather, the project as a whole) can give them the former.
gl: Non limites os teus obxectivos para conseguires novos desenvolvedores e persoas que documenten. Por exemplo, formar xente para escribir bos informes de erros paga a pena a longo prazo, se non empregares <emphasis>demasiado</emphasis> tempo por persoa e se eles van a enviar máis informes no futuro &mdash; o que é probable que fagan se teñen unha relación construtiva co proxecto desde o inicio. Unha relación construtiva non quere dicir que o erro se resolva, aínda que iso é o ideal; senón que pode ser simplemente unha solicitude de máis información ou unha confirmación de que <emphasis>si</emphasis> é un erro. A xente desexa que a escoiten. Ademais, desexa que os erros sexan resoltos. Aínda que non se poida resolver o erro de inmediato, sempre se pode escoitar os colaboradores.

source: A corollary of this is that developers should not express anger at people who file well-intended but vague bug reports. This is one of my personal pet peeves; I see developers do it all the time on various open source mailing lists, and the harm it does is palpable. Some hapless newbie will post a useless report:
gl: Un corolario disto é que os desenvolvedores non deberían expresar enfado ante a xente que envía informes ben intencionados aínda que vagos. Esta é a miña maior queixa; vexo a desenvolvedores facelo en todo momento en varias listas de correo de proxectos de software libre e o dano que iso fai é palpable. Algún usuario novo non informático pode escribir un informe non inútil, como o que segue:

source: <blockquote> <para>Hi, I can't get Scanley to run. Every time I start it up, it just errors. Is anyone else seeing this problem?</para> </blockquote> <para>Some developer&mdash;who has seen this kind of report a thousand times, and hasn't stopped to think that the newbie has not&mdash;will respond like this:</para> <blockquote> <para>What are we supposed to do with so little information? Sheesh. Give us at least some details, like the version of Scanley, your operating system, and the error.</para> </blockquote> <para>This developer has failed to see things from the user's point of view, and also failed to consider the effect such a reaction might have on all the <emphasis>other</emphasis> people watching the exchange. Naturally a user who has no programming experience, and no prior experience reporting bugs, will not know how to write a bug report. What is the right way to handle such a person? Educate them! And do it in such a way that they come back for more:</para> <blockquote> <para>Sorry you're having trouble. We'll need more information in order to figure out what's happening here. Please tell us the version of Scanley, your operating system, and the exact text of the error. The very best thing you can do is send a transcript showing the exact commands you ran, and the output they produced. See http://www.scanley.org/how_to_report_a_bug.html for more.</para> </blockquote> <para>This way of responding is far more effective at extracting the needed information from the user, because it is written to the user's point of view. First, it expresses sympathy: <emphasis>You had a problem; we feel your pain</emphasis>. (This is not necessary in every bug report response; it depends on the severity of the problem and how upset the user seemed.) Second, instead of belittling her for not knowing how to report a bug, it tells her how, and in enough detail to be actually useful&mdash;for example, many users don't realize that "show us the error" means "show us the exact text of the error, with no omissions or abridgements." The first time you work with such a user, you need to be specific about that. Finally, it offers a pointer to much more detailed and complete instructions for reporting bugs. If you have successfully engaged with the user, she will often take the time to read that document and do what it says. This means, of course, that you have to have the document prepared in advance. It should give clear instructions about what kind of information your development team wants to see in every bug report. Ideally, it should also evolve over time in response to the particular sorts of omissions and misreports users tend to make for your project.</para> <para>The Subversion project's bug reporting instructions are a fairly standard example of the form (see <xref linkend="bug-reporting"/>). Notice how they close with an invitation to provide a patch to fix the bug. This is not because such an invitation will lead to a greater patch/report ratio&mdash;most users who are capable of fixing bugs already know that a patch would be welcome, and don't need to be told. The invitation's real purpose is to emphasize to all readers, especially those new to the project or new to free software in general, that the project runs on volunteer contributions. In a sense, the project's current developers are no more responsible for fixing the bug than is the person who reported it. This is an important point that many new users will not be familiar with. Once they realize it, they're more likely to help make the fix happen, if not by contributing code then by providing a more thorough reproduction recipe, or by offering to test fixes that other people post. The goal is to make every user realize that there is no <emphasis>innate</emphasis> difference between herself and the people who work on the project&mdash;that it's a question of how much time and effort one puts in, not a question of who one is.</para> <para>The admonition against responding angrily does not apply to rude users. Occasionally people post bug reports or complaints that, regardless of their informational content, show a sneering contempt at the project for some failing. Often such people are alternately insulting and flattering, such as the person who posted this to a Subversion mailing list:</para> <blockquote> <para>Why is it that after almost 6 days there still aren't any binaries posted for the windows platform?!? It's the same story every time and it's pretty frustrating. Why aren't these things automated so that they could be available immediately?? When you post an "RC" build, I think the idea is that you want users to test the build, but yet you don't provide any way of doing so. Why even have a soak period if you provide no means of testing??</para> </blockquote> <para>Initial response to this rather inflammatory post was surprisingly restrained: people pointed out that the project had a published policy of not providing official binaries, and said, with varying degrees of annoyance, that he ought to volunteer to produce them himself if they were so important to him. Believe it or not, his next post started with these lines:</para> <blockquote> <para>First of all, let me say that I think Subversion is awesome and I really appreciate the efforts of everyone involved. [...]</para> </blockquote>
gl: <blockquote><para>Ei, non son capaz de arrincar Scanley. Cada vez que arrinco, só aparecen erros. Sofre alguén este mesmo problema?</para><blockquote><para>Algún desenvolvedor &mdash; que ten visto este tipo de informes máis dunha vez e non se parou a pensar que o novato non&mdash; responderá algo como isto:</para><blockquote><para>Que pensas que podemos facer con tan pouca información? A ver. Indícanos algúns detalles como a versión de Scanley, que sistema operativo usas e os erros que amosa</para></blockquote><para>Este desenvolvedor non se parou a observar o problema desde o punto de vista do usuario e tampouco ten considerado o efecto nocivo que pode ter unha resposta dese estilo en toda a <emphasis>outra</emphasis> xente vendo o intercambio de correos. Evidentemente, un usuario sen experiencia en programación nin en informes de erros, non saberá como enviar un. O mellor modo de xestionar a súa aportación é aprenderlle. E facelo dun modo que volvan por máis.</para><blockquote><para>Sinto que esteas tendo problemas. Precisaremos máis información para averiguarmos que está a ocorrer no teu caso. Poderías dicirnos que versión de Scanley usas, o sistema operativo e o texto exacto do erro? O mellor que podes facer é enviarnos os comandos que estás tratando de executar e a saída que producen. Bótalle un ollo a http://www.scanley.org/how_to_report_a_bug.html para máis información.</para></blockquote><para>Esta resposta é moito máis efectiva xa que está escrita desde o punto de vista do usuario. Punto un, expresa empatía: <emphasis>tes un problema e nós sentímolo</emphasis>. (Isto non é preciso en cada resposta; depende da severidade do problema e como de frustrado se mostre o usuario). Punto dous, en vez de botarlle en cara que non sabe como enviar un informe de erro, a resposta dille como facelo, con suficiente detalle para que sexa útil &mdash; por exemplo, moitos usuarios non se decatan de que "móstranos o erro" significa "móstranos o texto exacto do erro". A primeira vez que respondes a un usuario así, é preciso ser específico. Finalmente, a resposta ofrece unha orientación a instrucións máis completas e detalladas para enviar informes. Se coa resposta tes creado confianza co usuario é altamente probable que se moleste en botarlle un ollo ao documento e facer o que alí se indica. Isto quere dicir que é preciso ter o documento escrito por adiantado, o cal debe indicar claramente a información que o equipo de desenvolvemento precisa para resolver o erro. Idealmente, o documento vai evoluír co tempo en resposta ás omisións e equivocacións máis habituais dos usuarios.</para><para>As instrucións para enviar erros do proxecto Subversion son un bo exemplo (ver <xref linkend="bug-reporting"/>). Nótese como se finaliza cunha invitación para resolver o erro. Isto non se fai porque leve a mellores relacións de informes/remendos enviados &mdash; a maioría dos usuarios que saben arranxar os erros, tamén saben que os remendos son benvidos. O verdadeiro propósito da invitación é que os novos participantes no proxecto o saiban tamén, que o proxecto se nutre das contribucións de voluntarios. Dalgún xeito, os actuais desenvolvedores non son máis responsables de resolveren o erro do que a persoa que o reportou. É este un punto importante co que non todo o mundo estará familiarizado. Facéndoo explícito estamos favorecendo que os usuarios axuden a arranxalo: se non é contribuíndo con código, pode ser ofrecéndose a testar remendos que outros envían, etc. A chave reside en facer explícito que non hai diferencia <emphasis>innata</emphasis> entre o usuario que informa do erro e a persoas que colaboran no proxecto &dash; a diferencia radica en canto tempo e esforzo un pon no proxecto, non en quen é.</para><para>A política de non responder duramente non se aplica a usuarios maleducados. De cando en vez, a xente postea informes de erro ou quéixase con ton burlón de que o proxecto falla nalgún punto. Habitualmente esa xente trata de insultar e louvar, como a persoa que posteou a seguinte mensaxe na lista de correo do proxecto Subversion:</para><blockquote><para>Por que despois de 6 días non están aínda subidos os binarios para Windows? Cada vez ocorre o mesmo e é moi frustrante. Por que non está iso automatizado para que poida estar dispoñible de inmediato tras cada actualización?Cando se sobe unha "RC" creo que a idea é que os usuarios a proben para comprobaren erros, porén, non se dispón dunha maneira para que os usuarios poidan facelo. Para que ofrecer un período de proba se non se ofrece ningún método para probalo?</para></blockquote>A resposta inicial a esta mensaxe foi sorprendentemente contida: a xente indicou que o proxecto tiña establecido unha política de non ofrecer binarios oficiais, e dito isto con diferentes graos de irritación, invitábase a este usuario a producir por si mesmo os binarios se eran tan importantes para el. Créase ou non, a seguinte mensaxe deste usuario comezou así:</para><blockquote><para>Antes de nada, dicir que creo que o proxecto Subversion é un gran proxecto e realmente aprecio os esforzos de todo o mundo que colabora nel. [...]</para></blockquote>
