Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: When you ask someone to do something, remember that you have done so, and follow up with him no matter what. Most requests are made in public forums, and are roughly of the form "Can you take care of X? Let us know either way; no problem if you can't, just need to know." You may or may not get a response. If you do, and the response is negative, the loop is closed&mdash;you'll need to try some other strategy for dealing with X. If there is a positive response, then keep an eye out for progress on the issue, and comment on the progress you do or don't see (everyone works better when they know someone else is appreciating their work). If there is no response after a few days, ask again, or post saying that you got no response and are looking for someone else to do it. Or just do it yourself, but still make sure to say that you got no response to the initial inquiry.
gl: Cando lle pidas a alguén que faga algo, lembra que o fixeches, e persevera pase o que pasar. A maioría das solicitudes son feitas en foros públicos, máis ou menos do seguinte xeito: "Poderías encargarte de X? Dinos algo en calquera caso; non hai problema se non podes, só fáinolo saber". Podes recibir ou non unha resposta. Se a recibires, e a resposta é negativa, o círculo péchase&mdash;precisarás intentar algunha outra estratexia para emparellalo con X. Se houber unha resposta positiva, entón non perdas de vista o progreso da incidencia, e comenta o progreso que vexas ou que non vexas (todo o mundo traballa mellor cando sabe que alguén aprecia o seu traballo). Se non houber resposta despois dun poucos días, volve a preguntar, ou envía unha mensaxe dicindo que no recibiches resposta e que estades a procurar algún outro que o faga. Ou simplemente faino ti mesmo. Mais asegúrate de dicires que non recibiches resposta á solicitude inicial.

source: The purpose of publicly noting the lack of response is <emphasis>not</emphasis> to humiliate the person, and your remarks should be phrased so as not to have that effect. The purpose is simply to show that you keep track of what you have asked for, and that you notice the reactions you get. This makes people more likely to say yes next time, because they will observe (even if only unconsciously) that you are likely to notice any work they do, given that you noticed the much less visible event of someone failing to respond.
gl: O motivo de amosares publicamente a falta de resposta <emphasis>non</emphasis> é humillar á persoa á que se lle fixo a petición, e cando comentes o tema debes facelo de xeito que isto quede claro. O motivo é simplemente amosar que segues a pista daquilo que pides, e que notificas as reaccións que obtés. Esta forma de traballo torna máis probable que alguén che diga si a seguinte vez, porque van decatarse (aínda que só sexa de xeito inconsciente) de que vas apreciar o traballo que fagan, dado que prestas atención a detalles moito menos visibles como que alguén non responda unha solicitude.

source: Notice what people are interested in
gl: Fíxate no que lle interesa á xente

source: Another thing that makes people happy is to have their interests noticed&mdash;in general, the more aspects of someone's personality you notice and remember, the more comfortable he will be, and the more he will want to work with groups of which you are a part.
gl: Outra cousa que fai feliz á xente é que te fixes nos seus intereses&mdash;en xeral, cantos máis aspectos da personalidade de alguén teñas presentes e lembres, máis cómodo vai estar este alguén, e máis vai querer traballar en grupos dos que ti formes parte.

source: For example, there was a sharp distinction in the Subversion project between people who wanted to reach a definitive 1.0 release (which we eventually did), and people who mainly wanted to add new features and work on interesting problems but who didn't much care when 1.0 came out. Neither of these positions is better or worse than the other; they're just two different kinds of developers, and both kinds do lots of work on the project. But we swiftly learned that it was important to <emphasis>not</emphasis> assume that the excitement of the 1.0 drive was shared by everyone. Electronic media can be very deceptive: you may sense an atmosphere of shared purpose when, in fact, it's shared only by the people you happen to have been talking to, while others have completely different priorities.
gl: Por exemplo, había unha nítida diferencia no proxecto Subversion entre a xente que quería chegar a unha versión 1.0 (cousa que finalmente fixemos), e a xente que principalmente quería engadir novas funcionalidades e traballar en problemas interesantes sen importarlles moito cando iamos lanzar a versión 1.0. Ningunha destas dúas posturas é mellor ou peor que a outra; simplemente son dous tipos distintos de desenvolvedores, e ambos tipos levan a cabo moito traballo no proxecto. Mais aprendemos rapidamente que era moi importante <emphasis>non</emphasis> asumir que o interese por ter unha versión 1.0 era compartido por todos. As comunicacións electrónicas poden enganar; podes pensar que hai unha atmosfera de propósito común cando, realmente, dito propósito só é compartido pola xente coa que ti tes falado, mentres outras persoas teñen prioridades completamente distintas.

source: The more aware you are of what people want out of the project, the more effectively you can make requests of them. Even just demonstrating an understanding of what they want, without making any associated request, is useful, in that it confirms to each person that she's not just another particle in an undifferentiated mass.
gl: Canto máis consciente sexas do que a xente quere obter do proxecto, máis eficiente e efectivamente podes facerlles solicitudes. Simplemente demostrares comprensión do que queren, sen faceres ningunha solicitude asociada, xa é útil, dado que lle confirma a cada persoa que non é simplemente unha partícula máis nunha masa amorfa.

source: Praise and Criticism
gl: Louvanzas e críticas

source: Praise and criticism are not opposites; in many ways, they are very similar. Both are primarily forms of attention, and are most effective when specific rather than generic. Both should be deployed with concrete goals in mind. Both can be diluted by inflation: praise too much or too often and you will devalue your praise; the same is true for criticism, though in practice, criticism is usually reactive and therefore a bit more resistant to devaluation.
gl: Louvanzas e críticas non son antónimos; de feito son moi similares en varias facetas. Ambos son formas de atención primarias, e son máis efectivos cando son específicos que cando son xenéricos. Ambos deben ser empregados con obxectivos concretos na mente. Ambos poden diluírse por uso en exceso: louva demasiado ou demasiado pouco e restaraslle forza ás túas louvanzas; o mesmo para o caso das críticas, aínda que na práctica a crítica adoita ser reactiva e por tanto un pouco máis resistente a perder forza.

source: An important feature of technical culture is that detailed, dispassionate criticism is often taken as a kind of praise (as discussed in <xref linkend="rudeness"/><phrase output="printed"> in <xref linkend="communications"/></phrase>), because of the implication that the recipient's work is worth the time required to analyze it. However, both of those conditions&mdash;<emphasis>detailed</emphasis> and <emphasis>dispassionate</emphasis>&mdash;must be met for this to be true. For example, if someone makes a sloppy change to the code, it is useless (and actually harmful) to follow up saying simply "That was sloppy." Sloppiness is ultimately a characteristic of a <emphasis>person</emphasis>, not of their work, and it's important to keep your reactions focused on the work. It's much more effective to describe all the things wrong with the change, tactfully and without malice. If this is the third or fourth careless change in a row by the same person, it's appropriate to say that&mdash;again without anger&mdash;at the end of your critique, to make it clear that the pattern has been noticed.
gl: Un cuestión interesante da cultura tecnolóxica é que a detallada e desapaixonada crítica a miúdo tómase como una especie de louvanza (como se viu en <xref linkend="rudeness"/><phrase output="printed"> en <xref linkend="communications"/></phrase>), isto débese á implicación subxacente de que o traballo que se está criticando vale suficientemente a pena como para ser analizado polo miúdo. En calquera caso, ambos aspectos; <emphasis>detallada</emphasis> e <emphasis>desapaixonada</emphasis> deben cumprirse para que esta afirmación sexa verdade. Por exemplo, se alguén fixer algunha mudanza chapuceira no código, é inútil (e de feito é contraproducente) comentares o asunto simplemente dicindo "Fixeches unha chapuza". Ser un chapuzas é, ao final, unha característica da <emphasis>persoa</emphasis>, non do seu traballo, e é importante acoutar a túa atención e opinión ao traballo feito. É moito máis eficiente describires todas as cousas mal feitas que se introduciron ao facer a mudanza, e hai que facelo con tacto e sen malicia. Se esta for a terceira ou cuarta mudanza descoidada da mesma persoa, entón o máis apropiado sería mencionares o feito, despois da crítica sobre o traballo realizado, e de novo sen ningún signo de enfado, para así deixares claro que dito padrón de comportamento foi advertido.

source: If someone does not improve in response to criticism, the solution is not more or stronger criticism. The solution is for the group to remove that person from the position of incompetence, in a way that minimizes hurt feelings as much as possible; see <xref linkend="transitions"/><phrase output="printed"> later in this chapter</phrase> for examples. That is a rare occurrence, however. Most people respond pretty well to criticism that is specific, detailed, and contains a clear (even if unspoken) expectation of improvement.
gl: Se alguén non mellorar tras as críticas, a solución non é máis, ou peor crítica. A solución é que o grupo elimine esa persoa do traballo non que é incompetente, nun xeito no que se minimice tanto como for posible ferir os seus sentimentos; en <xref linkend="transitions"/><phrase output="printed"> ao final deste capítulo </phrase> podes ver uns exemplos. Este adoita ser un caso raro. A maioría da xente responde bastante ben á crítica específica, detallada e que contén unha clara (mesmo aínda que non sexa explícita) esperanza de mellora.

source: Praise won't hurt anyone's feelings, of course, but that doesn't mean it should be used any less carefully than criticism. Praise is a tool: before you use it, ask yourself <emphasis>why</emphasis> you want to use it. As a rule, it's not a good idea to praise people for doing what they usually do, or for actions that are a normal and expected part of participating in the group. If you were to do that, it would be hard to know when to stop: should you praise <emphasis>everyone</emphasis> for doing the usual things? After all, if you leave some people out, they'll wonder why. It's much better to express praise and gratitude sparingly, in response to unusual or unexpected efforts, with the intention of encouraging more such efforts. When a participant seems to have moved permanently into a state of higher productivity, adjust your praise threshold for that person accordingly. Repeated praise for normal behavior gradually becomes meaningless anyway. Instead, that person should sense that her high level of productivity is now considered normal and natural, and only work that goes beyond that should be specially noticed.
gl: As lovanzas non feren os sentimentos de ninguén, por suposto, mais iso non significa que deban ser empregadas con menor coidado que as críticas. A louvanzas son unha ferramenta: antes de usala, pregúntate a ti mesmo <emphasis>por que</emphasis> queres usala. Como regra, non é unha boa idea louvar a xente por facer aquelo que adoitan facer, ou por accións que son normais ou parte da súa participación no grupo. Se fixeras isto, sería difícil saber cando parar: deberías gabar a <emphasis>todo o mundo</emphasis> por facer as cousas habituais? Despois de todo, se deixas algunha xente fóra, preguntaranse por que. É moito mellor expresar gabanzas e gratitude ocasionalmente en resposta a esforzos non usuarios ou inesperados, coa intencións de fomentar máis deses esforzos. Cando un participante parece terse movido a un estado permanente de alta produtividade, axusta as túas gabanzas consecuentemente. As gabanzas repetidas por comportamentos normais acaban gradualmente perdendo o seu significado. En lugar diso, esa persoa debe sentir que o seu alto nivel de produtividade agora é considerado normal e natural, e só o traballo que vaia máis alá debe ser especialmente considerado.

source: This is not to say that the person's contributions shouldn't be acknowledged, of course. But remember that if the project is set up right, everything that person does is already visible anyway, and so the group will know (and the person will know that the rest of the group knows) everything she does. There are also ways to acknowledge someone's work by means other than direct praise. You could mention in passing, while discussing a related topic, that she has done a lot of work in the given area and is the resident expert there; you could publicly consult her on some question about the code; or perhaps most effectively, you could conspicuously make further use of the work she has done, so she sees that others are now comfortable relying on the results of her work. It's probably not necessary to do these things in any calculated way. Someone who regularly makes large contributions in a project will know it, and will occupy a position of influence by default. There's usually no need to take explicit steps to ensure this, unless you sense that, for whatever reason, a contributor is underappreciated.
gl: Isto non quere dicir que a contribución desta persoa non deba ser recoñecida, por suposto. Mais recorda que se o proxecto está ben configurado, todo o que esa persoa faga xa é visible de tódolos xeitos, e por tanto o grupo verá (e esta persoa saberá que o resto do grupo sabe) todo o que ela fai. Tamén hai outros xeitos de recoñecer o traballo de alguén mediante outros medios distintos da gabanza directa. Poderías mencionar de pasada, cando se discuta un tema relacionado, que esa persoa fixo unha cantidade enorme de traballo nesa área e por tanto é o experto na mesma; poderías consultarlle publicamente algunhas cuestións sobre o código;ou quizais sexa máis eficaz empregar o seu traballo de xeito ostensible para que a persoa poida ver que os demais se senten cómodos cos resultados do seu traballo. Probablemente non sexa necesario facer estas cousas dun xeito calculado. Alguén que regularmente faga grandes contribucións nun proxecto saberao, e ocupará por defecto unha posición de influencia. Normalmente non é necesario dar pasos explícitos para asegurar isto, a non ser que sintas que, pola razón que sexa, un contribuínte está sendo infravalorado.

source: Prevent Territoriality
gl: Evita a territorialidade

source: Watch out for participants who try to stake out exclusive ownership of certain areas of the project, and who seem to want to do all the work in those areas, to the extent of aggressively taking over work that others start. Such behavior may even seem healthy at first. After all, on the surface it looks like the person is taking on more responsibility, and showing increased activity within a given area. But in the long run, it is destructive. When people sense a "no trespassing" sign, they stay away. This results in reduced review in that area, and greater fragility, because the lone developer becomes a single point of failure. Worse, it fractures the cooperative, egalitarian spirit of the project. The theory should always be that any developer is welcome to help out on any task at any time. Of course, in practice things work a bit differently: people do have areas where they are more and less influential, and non-experts frequently defer to experts in certain domains of the project. But the key is that this is all voluntary: informal authority is granted based on competence and proven judgement, but it should never be actively <emphasis>taken</emphasis>. Even if the person desiring the authority really is competent, it is still crucial that she hold that authority informally, through the consensus of the group, and that the authority never cause her to exclude others from working in that area.
gl: Ten coidado cos participantes que intentan apropiarse en exclusividade da propiedade de certas área do proxecto, e que parece que queren facer todo o traballo nesas áreas, ata o punto de apropiárense do traballo que outros comezaron. Este comportamento pode parecer saudable ao comezo, despois de todo superficialmente parece que a persoa está collendo máis responsabilidade e amosando un incremento da actividade dentro dunha área dada, mais a longo prazo é destrutivo. Cando a xente ve un "prohibido o paso", apártase. Isto provoca unha redución da supervisión nesa área, e unha fraxilidade maior, dado que se depende da dispoñibilidade dun único desenvolvedor. Aínda peor, esta actitude rompe o espírito cooperativo e igualitario do proxecto. En teoría calquera desenvolvedor é benvido para axudar en calquera tarefa en calquera momento, na práctica por suposto as cousas funcionan dun xeito algo diferente: a xente ten áreas nas que é máis ou menos influínte, e os non expertos adoitan deixar que os expertos manexen certos dominios do proxecto. Mais a chave atópase en que todo isto é voluntario: a autoridade informal é obtida en base á competencia demostrada, mais nunca debería ser activamente <emphasis>conquistada</emphasis>. Incluso se a persoa que desexa a autoridade realmente é competente, segue sendo crucial que atesoure esa autoridade dun xeito informal, a través do consenso do grupo, e que a autoridade nunca provoque que exclúa aos demais do traballo nesa área.

source: Rejecting or editing someone's work for technical reasons is an entirely different matter, of course. There, the decisive factor is the content of the work, not who happened to act as gatekeeper. It may be that the same person happens to do most of the reviewing for a given area, but as long as he never tries to prevent someone else from doing that work too, things are probably okay.
gl: Rexeitar ou editar o traballo de alguén por motivos técnicos é unha cuestión totalmente diferente, por suposto. Aquí o factor decisivo é o contido do traballo, non o que sucede ao actuar como gardameta. Podería suceder que a mesma persoa faga a maior parte da revisión para unha área dada, mais mentres non tente evitar que os demais poidan facer tamén ese traballo, probablemente as cousas vaian ben.

source: In order to combat incipient territorialism, or even the appearance of it, many projects have taken the step of banning the inclusion of author names or designated maintainer names in source files. I wholeheartedly agree with this practice: we follow it in the Subversion project, and it is more or less official policy at the Apache Software Foundation. ASF member Sander Striker puts it this way:
gl: Para combater unha incipiente territorialidade, ou mesmo a súa aparición, moitos proxectos teñen tomada a decisión de prohibir a inclusión dos nomes dos autores, ou dos mantedores designados, non ficheiros fonte. Eu estou de acordo de todo corazón con esta práctica: nós seguímola no proxecto Subversion, e é unha directiva máis ou menos oficial na Apache Software Foundation. Sander Striker, membro da ASF, explícao deste xeito:
