Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: From time to time, a volunteer in a position of ongoing responsibility (e.g., patch manager, translation manager, etc.) will become unable to perform the duties of the position. It may be because the job turned out to be more work than he anticipated, or it may be due to completely external factors: marriage, a new baby, a new employer, or whatever.
gl: A veces ocorre que, un voluntario nunha posición de responsabilidade (por exemplo: xestor de remendos, de tradución, etc) será incapaz de levar a cabo as tarefas requiridas. Isto pode deberse a que son maiores que as que se anticiparan, ou por outro tipo de factores externos: mudanza do estado civil, situacións familiares novas como ter un fillo, un novo emprego, etc.

source: When a volunteer gets swamped like this, he usually doesn't notice it right away. It happens by slow degrees, and there's no point at which he consciously realizes that he can no longer fulfill the duties of the role. Instead, the rest of the project just doesn't hear much from him for a while. Then there will suddenly be a flurry of activity, as he feels guilty for neglecting the project for so long and sets aside a night to catch up. Then you won't hear from him for a while longer, and then there might or might not be another flurry. But there's rarely an unsolicited formal resignation. The volunteer was doing the job in his spare time, so resigning would mean openly acknowledging to himself that his spare time is permanently reduced. People are often reluctant to do that.
gl: Cando isto ocorre, o propio voluntario non se decata de inmediato. A mudanza prodúcese de modo progresivo, cunha redución das tarefas que leva a cabo e talvez non sexa consciente de que xa non é capaz de satisfacer tódolos requirimentos que o propio rol acarreta. Por outra banda, o resto do proxecto simplemente non ten noticias del nun tempo. Soe ocorrer que entón o proxecto ve un pico repentino de actividade, que soe vir dado porque a persoa se sente culpable por deixar de lado o traballo no proxecto e se senta un día a facer tarefas e poñerse ao día. Despois diso. é habitual que non se saiba nada del durante un tempo máis longo que o anterior, para ter de novo -ou talvez non- outro pico de actividade. Raramente acontece unha resignación voluntaria do posto. O voluntario estaba a facer o traballo no seu tempo libre, polo que resignar significaría recoñecer abertamente a si mesmo que ten menos tempo libre do que pensaba. Á xente habitualmente lle costa asumir iso.

source: Therefore, it's up to you and the others in the project to notice what's happening&mdash;or rather, not happening&mdash;and to ask the volunteer what's going on. The inquiry should be friendly and 100% guilt-free. Your purpose is to find out a piece of information, not to make the person feel bad. Generally, the inquiry should be visible to the rest of the project, but if you know of some special reason why a private inquiry would be better, that's fine too. The main reason to do it publicly is so that if the volunteer responds by saying that he won't be able to do the job anymore, there's a context established for your <emphasis>next</emphasis> public post: a request for a new volunteer to fill that role.
gl: Polo tanto, depende totalmente de ti e das outras persoas no proxecto decatarvos do que está a ocorrer &mdash; ou do que non está a ocorrer&mdash; e preguntarlle ao voluntario o que está pasando. A pregunta debe ser totalmente amigable e sen que implique un sentimento de culpa para el. O propósito é saber o que acontece, non facer que a persoa se sinta mal. En xeral, é mellor que isto se faga publicamente, mais é perfectamente válido que se faga en privado se existir algunha razón para tal cousa. A razón de facelo usando os canais públicos reside en que se o voluntario contesta que non pode levar a cabo as tarefas encomendadas, existe un contexto xa para a túa <emphasis>seguinte</emphasis> mensaxe pública: unha petición de novos voluntarios para que ocupen ese rol.

source: Sometimes, a volunteer is unable to do the job he's taken on, but is either unaware or unwilling to admit that fact. Of course, anyone may have trouble at first, especially if the responsibility is complex. However, if someone just isn't working out in the task he's taken on, even after everyone else has given all the help and suggestions they can, then the only solution is for him to step aside and let someone new have a try. And if the person doesn't see this himself, he'll need to be told. There's basically only one way to handle this, I think, but it's a multistep process and each step is important.
gl: Ás veces, o voluntario non é capaz de levar a cabo as tarefas encomendadas, mais tampouco está disposto ou é capaz de recoñecer ese feito. Evidentemente, calquera pode ter problemas ao principio, especialmente se a responsabilidade for complexa. Porén, se a cousa simplemente non funcionar, mesmo despois de recibir toda a axuda posible, só existe unha solución apropiada: que o voluntario deixe paso a outra persoa. E se el non o ve por si mesmo, necesitará que alguén llo diga. Creo que só hai un modo de manexar isto, mais é un proceso de múltiples pasos, onde cada un deles é importante.

source: First, make sure you're not crazy. Privately talk to others in the project to see if they agree that the problem is as serious as you think it is. Even if you're already positive, this serves the purpose of letting others know that you're considering asking the person to step aside. Usually no one will object to that&mdash;they'll just be happy you're taking on the awkward task, so they don't have to!
gl: Primeiro, asegúrate de que non está errado. Fala en privado con outras persoas do proxecto para ver se eles concordan contigo e o problema é tan serio como ti pensas que é. Embora xa esteas seguro, isto serve para facerlle ver aos demais que estás a considerar pedirlle á persoa que dea o relevo do rol. Habitualmente ninguén terá obxeccións &mdash; a xente estará contenta de que deas a cara para facer unha tarefa ingrata, e así eles non teñen que facelo!

source: Next, <emphasis>privately</emphasis> contact the volunteer in question and tell him, kindly but directly, about the problems you see. Be specific, giving as many examples as possible. Make sure to point out how people had tried to help, but that the problems persisted without improving. You should expect this email to take a long time to write, but with this sort of message, if you don't back up what you're saying, you shouldn't say it at all. Say that you would like to find a new volunteer to fill the role, but also point out that there are many other ways to contribute to the project. At this stage, don't say that you've talked to others about it; nobody likes to be told that people were conspiring behind his back.
gl: A continuación, contacta <emphasis>en privado</emphasis> coa persoa e coméntalle o que pensas, directa, mais amablemente. Sé específico, dando tantos exemplos como for posible. Asegúrate de facer explícito como o resto da xente fixo o posible por axudar, mais que o problema continúa. É probable que este correo che tome un tempo escribilo, e se non estiveres seguro do que estás a dicir, non deberías dicilo. Unha vez o fixeres, explica que che gustaría atopar un novo voluntario para o rol, mais tamén deixa claro que existen outras maneiras de contribuír ao proxecto. Nesta etapa, non digas que falaches con outra xente; a ninguén lle gusta ouvir que outros estiveron conspirando ás súas costas.

source: There are a few different ways things can go after that. The most likely reaction is that he'll agree with you, or at any rate not want to argue, and be willing to step down. In that case, suggest that he make the announcement himself, and then you can follow up with a post seeking a replacement.
gl: Isto pode dar lugar a diferentes respostas pola súa parte. A máis probable é que estea de acordo contigo ou que non desexe discutir, polo que está disposto a dar o relevo. Nese caso, o mellor sería que el fixese o anuncio por si mesmo, e despois diso podes facer unha petición para atopares un novo voluntario.

source: Or, he may agree that there have been problems, but ask for a little more time (or for one more chance, in the case of discrete-task roles like release manager). How you react to that is a judgement call, but whatever you do, don't agree to it just because you feel like you can't refuse such a reasonable request. That would prolong the agony, not lessen it. There is often a very good reason to refuse the request, namely, that there have already been plenty of chances, and that's how things got to where they are now. Here's how I put it in a mail to someone who was filling the release manager role but was not really suited for it:
gl: Outra delas, sería que estea de acordo en que non puido levar a cabo o traballo encomendado, mais que pida un pouco máis de tempo (ou unha nova oportunidade, para roles con tarefas discretas como por exemplo o xestor da publicación). A reposta a isto depende do teu xuízo, mais decidas o que decidires, non o fagas unicamente porque sentes que non podes rexeitar unha petición tan razoable como esa. Ese enfoque prolongaría a agonía, non a eliminaría. Unha boa razón para rexeitares a petición é que xa existiron un bo número de oportunidades, as que vos levaron ao punto no que estades agora. A continuación podes ver o correo-e que lle enviei a alguén que estaba ocupando o posto de xestor da publicación, mais que en verdade non estaba feito para el:

source: &gt; If you wish to replace me with some one else, I will gracefully &gt; pass on the role to who comes next. I have one request, which &gt; I hope is not unreasonable. I would like to attempt one more &gt; release in an effort to prove myself. I totally understand the desire (been there myself!), but in this case, we shouldn't do the "one more try" thing. This isn't the first or second release, it's the sixth or seventh... And for all of those, I know you've been dissatisfied with the results too (because we've talked about it before). So we've effectively already been down the one-more-try route. Eventually, one of the tries has to be the last one... I think [this past release] should be it.
gl: &gt; Se desexas substituírme por algunha outra persoa, enténdoo e &gt; farei o relevo o mellor que poida. Porén, teño unha petición, &gt; que penso que é razoable. Gustaríame facer unha publicación máis &gt; para poñerme a proba. Comprendo perfectamente o teu desexo (pasoume a min mesmo!), mais creo que neste caso non deberíamos intentalo de novo. Esta non é a primeira ou segunda publicación do programa, é a sexta ou sétima ... e para todas elas, sei que tamén ti non estás satisfeito cos resultados (temos falado diso antes). Pódese dicir que xa o temos intentado unha vez máis. E un deses intentos ten que ser o último. Creo que [a pasada publicación] debería ter sido este último intento.

source: In the worst case, the volunteer may disagree outright. Then you have to accept that things are going to be awkward and plow ahead anyway. Now is the time to say that you talked to other people about it (but still don't say who until you have their permission, since those conversations were confidential), and that you don't think it's good for the project to continue as things are. Be insistent, but never threatening. Keep in mind that with most roles, the transition really happens the moment someone new starts doing the job, <emphasis>not</emphasis> the moment the old person stops doing it. For example, if the contention is over the role of, say, issue manager, at any point you and other influential people in the project can solicit for a new issue manager. It's not actually necessary that the person who was previously doing it stop doing it, as long as he does not sabotage (deliberately or otherwise) the efforts of the new volunteer.
gl: No peor caso, a persoa pode estar en desacordo. Tes que aceptar entón que as cousas van ser incómodas e tirar para diante. É momento de dicir que tes falado xa con outra xente (mais non dicir con quen a non ser que teñas o seu permiso, xa que esas conversas foron confidenciais), e non cres que sexa bo para o proxecto que as cousas continúen dese modo. Sé insistente, mais non ameazador. Ten en conta que para a maioría dos roles, a transición ocorre no momento en que alguén novo ocupa o rol, <emphasis>non</emphasis> cando a antiga persoa deixa de facelo. Por exemplo, se a discusión versar sobre, digamos, o xestor das incidencias, en calquera momento ti e outras persoas do proxecto podedes facer explícito o teu desexo de ter outra persoa para o posto. Non é necesario obrigatoriamente que a persoa que estaba facendo o traballo deixe de facelo, sempre e cando non sabote (deliberadamente ou doutro modo) os esforzos do novo voluntario.

source: Which leads to a tempting thought: instead of asking the person to resign, why not just frame it as a matter of getting him some help? Why not just have two issue managers, or patch managers, or whatever the role is?
gl: O que nos leva a unha idea tentadora: por que en troca de pedirlle á persoa que abandone o posto, non o enfocamos como simplemente unha cuestión de darlle máis axuda? Por que non ter dous xestores de incidencias ou de remendos, ou calquera que for o rol?

source: Although that may sound nice in theory, it is generally not a good idea. What makes the manager roles work&mdash;what makes them useful, in fact&mdash;is their centralization. Those things that can be done in a decentralized fashion are usually already being done that way. Having two people fill one managerial role introduces communications overhead between those two people, as well as the potential for slippery displacement of responsibility ("I thought you brought the first aid kit!" "Me? No, I thought <emphasis>you</emphasis> brought the first aid kit!"). Of course, there are exceptions. Sometimes two people work extremely well together, or the nature of the role is such that it can easily be spread across multiple people. But these are not likely to be of much use when you see someone flailing in a role he is not suited for. If he'd appreciated the problem in the first place, he would have sought such help before now. In any case, it would be disrespectful to let someone waste time continuing to do a job no one will pay attention to.
gl: Aínda que esa idea poida soar tentadora a primeira vista, xeralmente non é unha boa idea. O que fai que rol de coordinador funcione &mdash; o que o fai útil, de feito &mdash; é a súa centralización. As cousas que poden facerse dun modo descentralizado xa son feitas dese modo. Ter dúas persoas facendo un traballo que pode facer unha, introduce unha sobrecarga comunicativa entre ambos, ademais do potencial desentendemento da responsabilidade (un polo outro e a casa sen varrer). Dende logo, hai excepcións. Ás veces, dúas persoas traballan moi ben xuntas, ou pode que que a propia natureza do rol pode ser distribuída entre varios dun modo sinxelo. Mais non soe ocorrer iso cando ves alguén fracasar nun rol para o que non ten as capacidades adecuadas. Se o voluntario tiver visto o problema por si mesmo, tería pedido axuda por si mesmo. En calquera caso, sería unha falta de respecto deixar que alguén esbanxase o seu tempo nun traballo que ninguén vai ter en consideración.

source: The most important factor in asking someone to step down is privacy: giving him the space to make a decision without feeling like others are watching and waiting. I once made the mistake&mdash;an obvious mistake, in retrospect&mdash;of mailing all three parties at once in order to ask Subversion's release manager to step aside in favor of two other volunteers. I'd already talked to the two new people privately, and knew that they were willing to take on the responsibility. So I thought, na&iuml;vely and somewhat insensitively, that I'd save some time and hassle by sending one mail to all of them to initiate the transition. I assumed that the current release manager was already fully aware of the problems and would see the reasonableness of my point immediately.
gl: O factor máis importante de pedirlle a alguén que dea o relevo é a privacidade: darlle espazo para que tome unha decisión sen que sinta que os demais o están mirando ou esperado. Unha vez, eu cometín o erro &mdash; un erro bastante obvio, en retrospectiva&mdash; de enviarlle un correo ás tres partes implicadas para pedir que o xestor da publicación de Subversion dese o relevo en favor de outras dúas persoas. Xa tiña falado cos dous novos voluntarios e estaban dispostos a asumir a responsabilidade. Dun modo inocente, crin que aforraría algún tempo si lle enviaba o email aos tres á vez para que iniciasen a transición. Asumín que o actual coordinador era plenamente consciente do problema e vería razoable a miña petición.

source: I was wrong. The current release manager was very offended, and rightly so. It's one thing to be asked to hand off the job; it's another thing to be asked that <emphasis>in front of</emphasis> the people you'll hand it off to. Once I got it through my head why he was offended, I apologized. He eventually did step aside gracefully, and continues to be involved with the project today. But his feelings were hurt, and needless to say, this was not the most auspicious of beginnings for the new volunteers either.
gl: Estaba equivocado. O xestor da publicación ofendeuse moito, e con razón. Unha cousa é facerlle ver que ten que deixar o seu rol; outra moi distinta é facelo <emphasis>diante</emphasis> da xente que dará o relevo. Unha vez me decatei de por que estaba ofendido, pedín desculpas. El deu o relevo dun modo elegante para todos e a día de hoxe segue a participar no proxecto. Mais os seus sentimentos foron feridos, e é necesario dicir, que tampouco foi o mellor dos comezos que imaxinaran os novos voluntarios.

source: As the only formally distinct class of people found in all open source projects, committers deserve special attention here. Committers are an unavoidable concession to discrimination in a system which is otherwise as non-discriminatory as possible. But "discrimination" is not meant as a pejorative here. The function committers perform is utterly necessary, and I do not think a project could succeed without it. Quality control requires, well, control. There are always many people who feel competent to make changes to a program, and some smaller number who actually are. The project cannot rely on people's own judgement; it must impose standards and grant commit access only to those who meet them<footnote><para>Note that the commit access means something a bit different in decentralized version control systems, where anyone can set up a repository that is linked into the project, and give themselves commit access to that repository. Nevertheless, the <emphasis>concept</emphasis> of commit access still applies: "commit access" is shorthand for "the right to make changes to the code that will ship in the group's next release of the software." In centralized version control systems, this means having direct commit access; in decentralized ones, it means having one's changes pulled into the main distribution by default. It is the same idea either way; the mechanics by which it is realized are not terribly important.</para></footnote>. On the other hand, having people who can commit changes directly working side-by-side with people who cannot sets up an obvious power dynamic. That dynamic must be managed so that it does not harm the project.
gl: Debido a que formalmente son a única clase de voluntarios que atopamos en calquera proxecto de software libre, os commiters merecen unha especial atención aquí. Os commiters son unha inevitable concesión discriminatoria, nun sistema que por outra banda é o menos discriminatorio dos posibles. Mais non tomes "discriminación" no senso pexorativo. A función que teñen os commiters é necesaria e non creo que un proxecto puidese sobrevivir sen eles. Evidentemente o control de calidade require control. Hai moita xente que se sente competente para facer mudanzas a un programa, e algúns poucos que realmente o son. O proxecto non pode depender do propio xuízo da xente; deben impoñerse estándares e conceder unicamente acceso só a aqueles que os cumpriren. <footnote><para>Obsérvese que ter acceso de commiter ten un significado diferente en sistemas de control de versións descentralizados, onde calquera pode configurar un repositorio que enlace ao proxecto e outorgarse a si mesmo acceso de commiter nese repositorio. Porén, o <emphasis>concepto</emphasis> de commit ten validez mesmo neses entornos: "acceso de commit" é un modo resumido de dicir "o dereito de facer mudanzas no programa que se empacotará na seguinte versión do mesmo". En sistemas de control de versións centralizados, isto quere dicir ter acceso de commit directo; en sistemas descentralizados, quere dicir que as mudanzas que un fai son integradas directamente no repositorio principal. En ambos casos é a mesma idea, a mecánica de como se fai non é realmente importante </para></footnote> Por outro lado, conseguir que a xente que ten acceso de commiter traballe ombro con ombro coa xente que non o ten outórgalle ao proxecto unha dinámica moi boa de traballo. E debe ser xestionada para que non dane o proxecto.

source: In <xref linkend="electorate"/><phrase output="printed"> in <xref linkend="social-infrastructure"/></phrase>, we already discussed the mechanics of considering new committers. Here we will look at the standards by which potential new committers should be judged, and how this process should be presented to the larger community.
gl: En <xref linkend="electorate"/><phrase output="printed"> en <xref linkend="social-infrastructure"/></phrase>, xa se ten debatido a mecánica de incluír novos commiters. A continuación botaráselle un ollo aos estándares polos cales o potenciais commiters deben ser xulgados e como este proceso debe ser presentado ante a comunidade que rodea o proxecto.

source: Choosing Committers
gl: Escollendo os commiters
