Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: Managing Volunteers
gl: Xestionando voluntarios

source: Getting people to agree on what a project needs, and to work together to achieve it, requires more than just a genial atmosphere and a lack of obvious dysfunction. It requires someone, or several someones, consciously managing all the people involved. Managing volunteers may not be a technical craft in the same sense as computer programming, but it is a craft in the sense that it can be improved through study and practice.
gl: Conseguir que a xente se poña de acordo sobre o que un proxecto precisa, e que traballe xunta para acadalo, require de máis que unha atmosfera xenial e sen disfuncións obvias. Require unha, ou varias, persoas que xestionen concienciudamente toda a xente involucrada. Xestionar voluntarios pode non ser unha arte técnica no mesmo senso que a programación, msis é unha arte no senso de que pode mellorarse a través do estudo e da práctica.

source: This chapter is a grab-bag of specific techniques for managing volunteers. It draws, perhaps more heavily than previous chapters, on the Subversion project as a case study, partly because I was working on that project as I wrote this and had all the primary sources close at hand, and partly because it's more acceptable to cast critical stones into one's own glass house than into others'. But I have also seen in various other projects the benefits of applying&mdash;and the consequences of not applying&mdash;the recommendations that follow; when it is politically feasible to give examples from some of those other projects, I will do so.
gl: Este capítulo é un caixón de xastre con técnicas específicas para xestionar voluntarios. Aliméntase como caso de estudo, quizais dun xeito aínda máis forte que en capítulos anteriores, do proxecto Subversion, en parte porque estiven traballando nese proxecto mentres escribía este libro (o que facía que tivera as fontes primarias preto da man), e tamén en parte porque é máis aceptable tirar pedras ao propio tellado que non ao dos demais. Aínda así. tamén teño visto noutros proxectos os beneficios de aplicar&mdash;e as consecuencias de non aplicar&mdash;as recomendacións que seguen. Sempre que for politicamente correcto fornecer exemplos derivados destes outros proxectos, fareino.

source: Speaking of politics, this is as good a time as any to drag that much-maligned word out for a closer look. Many engineers like to think of politics as something other people engage in. "<emphasis>I'm</emphasis> just advocating the best course for the project, but <emphasis>she's</emphasis> raising objections for political reasons." I believe this distaste for politics (or for what is imagined to be politics) is especially strong in engineers because engineers are bought into the idea that some solutions are objectively superior to others. Thus, when someone acts in a way that seems motivated by outside considerations&mdash;say, the maintenance of his own position of influence, the lessening of someone else's influence, outright horse-trading, or avoiding hurting someone's feelings&mdash;other participants in the project may get annoyed. Of course, this rarely prevents them from behaving in the same way when their own vital interests are at stake.
gl: Falando de política, este é un momento tan bo como calquera outro para inspeccionarmos a devandita palabra maligna. A moitos enxeñeiros gústalles pensar que a política é algo no que está envolvida outra xente, ao xeito de "<emphasis>Eu</emphasis> estou avogando polo mellor camiño para o proxecto, mais <emphasis>Ela</emphasis> pon atrancos por razóns políticas." Creo que este distanciamento derivado da política (ou derivado do que se pensa que é a política) é especialmente forte nos enxeñeiros debido a que os enxeñeiros edúcanse coa idea de que algunhas solucións son obxectivamente superiores a outras. Por tanto, cando alguén actúa dun xeito que parece motivado por consideracións externas&mdash;o mantemento da súa posición de influencia, minar a influencia dun terceiro, "vender motos", ou evitar ferir os sentimentos de alguén&mdash;outros integrantes do proxecto poden anoxarse. Por suposto, isto raramente evita que se comporten do mesmo xeito cando son os seus propios intereses os que están en xogo.

source: If you consider "politics" a dirty word, and hope to keep your project free of it, give up right now. Politics are inevitable whenever people have to cooperatively manage a shared resource. It is absolutely rational that one of the considerations going into each person's decision-making process is the question of how a given action might affect his own future influence in the project. After all, if you trust your own judgement and skills, as most programmers do, then the potential loss of future influence has to be considered a technical result, in a sense. Similar reasoning applies to other behaviors that might seem, on their face, like "pure" politics. In fact, there is no such thing as pure politics: it is precisely because actions have multiple real-world consequences that people become politically conscious in the first place. Politics is, in the end, simply an acknowledgment that <emphasis>all</emphasis> consequences of decisions must be taken into account. If a particular decision leads to a result that most participants find technically satisfying, but involves a change in power relationships that leaves key people feeling isolated, the latter is just as important a result as the former. To ignore it would not be high-minded, but shortsighted.
gl: Se consideras que "política" é unha palabra porca, e tes esperanzas de manter o teu proxecto libre dela, abandona agora mesmo. A política é algo que aparece inevitablemente onde a xente teña que xestionar cooperativamente un recurso compartido. É absolutamente racional que unha das consideracións que se teñan en conta durante o proceso de toma de decisións de cada persoa sexa a cuestión de como unha acción dada pode afectarlle á súa futura influencia no proxecto. Despois de todo, se cres no teu propio xuízo e capacidades, e moitos programadores fano, a potencial perda futura de influencia ten que ser considerada como unha cuestión técnica, en certo senso. Un razoamento similar é aplicable a outros comportamentos que poden ser vistos, superficialmente, como "pura" política. De feito, non hai nada como a tal pura política: é precisamente debido a que as accións teñen múltiples consecuencias no mundo real polo que a xente chega a ser politicamente consciente nun primeiro momento. A política é simplemente, ao final, un recoñecemento de que <emphasis>todas</emphasis> as consecuencias das decisións deben ser tidas en conta. Se unha decisión concreta conduce a un resultado que a maioría dos participantes atopan tecnicamente satisfactorio, mais implica unha mudanza nas relacións de poder que provoca o isolamento de xente clave, entón debemos telo en conta e darlle importancia a ambas consecuencias. Ignoralo non só sería pouco xuizoso, senón tamén curto de miras.

source: So as you read the advice that follows, and as you work with your own project, remember that there is <emphasis>no one</emphasis> who is above politics. Appearing to be above politics is merely one particular political strategy, and sometimes a very useful one, but it is never the reality. Politics is simply what happens when people disagree, and successful projects are those that evolve political mechanisms for managing disagreement constructively.
gl: Así, mentres leas os consellos que seguen, e mentres traballes no teu propio proxecto, lembra que <emphasis>ninguén</emphasis> está por enriba da política. Amosarse como alguén por enriba da política é só unha mera estratexia política, sendo moi útil ás veces, mais nunca é a realidade. A política é simplemente o que pasa cando a xente está en desacordo, e os proxectos exitosos son aqueles que desenvolven os mecanismos políticos para xestionar construtivamente o desacordo.

source: Getting the Most Out of Volunteers
gl: Conseguir o máximo de voluntarios

source: Why do volunteers work on free software projects?
gl: Por que os voluntarios traballan en proxectos de software libre?

source: This question was studied in detail, with interesting results, in a paper by Karim Lakhani and Robert G. Wolf, entitled <citetitle>Why Hackers Do What They Do: Understanding Motivation and Effort in Free/Open Source Software Projects</citetitle>. See <ulink url="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf"></ulink>.
gl: Esta cuestión foi estudada en detalle, con resultados interesantes, nun estudo de Karim Lakhani e Robert G. Wolf titulado <citetitle>Why Hackers Do What They Do: Understanding Motivation and Effort in Free/Open Source Software Projects</citetitle> (Por que os Hackers fan o que fan: entendendo a motivación e o esforzo en Proxectos de Software Libre e de Fontes Abertas). Bótalle unha ollada a <ulink url="http://freesoftware.mit.edu/papers/lakhaniwolf.pdf"></ulink>.

source: When asked, many claim they do it because they want to produce good software, or want to be personally involved in fixing the bugs that matter to them. But these reasons are usually not the whole story. After all, could you imagine a volunteer staying with a project even if no one ever said a word in appreciation of his work, or listened to him in discussions? Of course not. Clearly, people spend time on free software for reasons beyond just an abstract desire to produce good code. Understanding volunteers' true motivations will help you arrange things so as to attract and keep them. The desire to produce good software may be among those motivations, along with the challenge and educational value of working on hard problems. But humans also have a built-in desire to work with other humans, and to give and earn respect through cooperative activities. Groups engaged in cooperative activities must evolve norms of behavior such that status is acquired and kept through actions that help the group's goals.
gl: Cando lles preguntas, moitos expoñen que o fan porque queren producir bo software, ou queren participar persoalmente na reparación dos erros que lles afectan. Mais estas razóns son habitualmente só unha parte da historia. Despois de todo, podes imaxinar un voluntario traballando nun proxecto mesmo se nunca ninguén lle dirixiu unha palabra de aprecio sobre o seu traballo no proxecto, ou escoitou a súa opinión nunha discusión? Claro que non. Claramente, a xente emprega tempo no software libre por razóns que van para alén do desexo abstracto de producir bo código. Comprender as motivacións reais dos voluntarios vaiche axudar a arranxar as cousas de xeito que che permita atraelos e mantelos. O desexo de producir bo software pode ir no medio desas motivacións, da man do desafío e do valor educativo de traballar en problemas difíciles. Mais os humanos tamén temos un desexo intrínseco de traballar con outros humanos, e de dar e gañar respecto a través de actividades cooperativas. Os grupos involucrados en actividades cooperativas deben desenvolver normas de comportamento de xeito que o status sexa adquirido e mantido a través de accións que axuden a obter os obxectivos do grupo.

source: Those norms won't always arise by themselves. For example, on some projects&mdash;experienced open source developers can probably name several off the tops of their heads&mdash;people apparently feel that status is acquired by posting frequently and verbosely. They don't come to this conclusion accidentally; they come to it because they are rewarded with respect for making long, intricate arguments, whether or not that actually helps the project. Following are some techniques for creating an atmosphere in which status-acquiring actions are also constructive actions.
gl: Estas normas non sempre xorden por si soas. Por exemplo, nalgúns proxectos&mdash;os desenvolvedores experimentados de software libre probablemente poidan nomear varios de memoria&mdash;a xente aparentemente sente que o status é adquirido mediante o envío de mensaxes frecuentes e longas. Habitualmente non chegan a esta conclusión dun xeito accidental, senón que chegan a ela porque son recompensados con respecto por faceren longas e intricadas argumentacións, axúdenlle ou non ao proxecto. A continuación amósanse algunhas técnicas apropiadas para xerar unha atmosfera na que as accións que permitan adquirir status tamén sexan construtivas.

source: Delegation
gl: Delegación

source: Delegation is not merely a way to spread the workload around; it is also a political and social tool. Consider all the effects when you ask someone to do something. The most obvious effect is that, if he accepts, he does the task and you don't. But another effect is that he is made aware that you trusted him to handle the task. Furthermore, if you made the request in a public forum, then he knows that others in the group have been made aware of that trust too. He may also feel some pressure to accept, which means you must ask in a way that allows him to decline gracefully if he doesn't really want the job. If the task requires coordination with others in the project, you are effectively proposing that he become more involved, form bonds that might not otherwise have been formed, and perhaps become a source of authority in some subdomain of the project. The added involvement may be daunting, or it may lead him to become engaged in other ways as well, from an increased feeling of overall commitment.
gl: Delegar non é simplemente un xeito de repartir a carga de traballo; tamén é unha ferramenta política e social. Considera todos os efectos cando lle pides a alguén que faga algo. O efecto máis obvio é que, se acepta, el fai a tarefa e ti non. Mais outro efecto é que se decata de que ti confías nel para manexar a tarefa. Máis aínda, se fixeres a petición nun foro público, entón tamén saberá que outras persoas do grupo tamén se decataron desa confianza. Tamén é posible que se sinta presionado para aceptar, o que quere dicir que debes facerlle a petición de xeito que lle permitas declinala dun xeito apropiado se realmente non quere ese traballo. Se a tarefa require coordinación con outra xente do proxecto, entón tamén lle estás pedindo que participe dun xeito maior no proxecto, creando lazos que doutro xeito non se terían formado, e quizais que se converta nunha fonte de autoridade nalgún subdominio do proxecto. A participación adicional pode ser asoballante, ou pode conducilo a participar doutros xeitos a maiores, grazas a un renovado sentimento de compromiso.

source: Because of all these effects, it often makes sense to ask someone else to do something even when you know you could do it faster or better yourself. Of course, there is sometimes a strict economic efficiency argument for this anyway: perhaps the opportunity cost of doing it yourself would be too high&mdash;there might be something even more important you could do with that time. But even when the opportunity cost argument doesn't apply, you may <emphasis>still</emphasis> want to ask someone else to take on the task, because in the long run you want to draw that person deeper into the project, even if it means spending extra time watching over them at first. The converse technique also applies: if you occasionally volunteer for work that someone else doesn't want or have time to do, you will gain his good will and respect. Delegation and substitution are not just about getting individual tasks done; they're also about drawing people into a closer committment to the project.
gl: Debido a todos estes efectos, a miúdo ten sentido pedirlle a alguén que faga algo aínda que saibas que ti poderías facelo máis rápido ou mellor. Por suposto, ás veces de tódolos xeitos hai un argumento de estrita eficiencia económica: pode que o custe de oportunidade de facelo por ti mesmo sexa demasiado alto&mdash;pode haber algo mesmo máis importante que poidas facer con ese tempo que aforras. Mais mesmo cando o argumento do custe de oportunidade non for relevante, <emphasis>aínda así</emphasis> podes queres pedirlle a alguén que faga unha tarefa concreta debido a que no longo prazo queres que esa persoa participe máis profundamente no proxecto, mesmo se iso significa empregar un tempo extra en supervisar o seu traballo ao comezo. A técnica oposta tamén funciona: se ocasionalmente fas voluntariamente o traballo que outra persoa non quere ou non ten tempo para facer, vas gañar a súa simpatía e respecto. A delegación e a substitución non teñen a ver unicamente con conseguir que tarefas individuais sexan levadas a cabo; tamén teñen a ver con aumentar o grao de compromiso da xente co proxecto.

source: Distinguish clearly between inquiry and assignment
gl: Distingue claramente entre solicitar e asignar

source: Sometimes it is fair to expect that a person will accept a particular task. For example, if someone writes a bug into the code, or commits code that fails to comply with project guidelines in some obvious way, then it is enough to point out the problem and thereafter behave as though you assume the person will take care of it. But there are other situations where it is by no means clear that you have a right to expect action. The person may do as you ask, or may not. Since no one likes to be taken for granted, you need to be sensitive to the difference between these two types of situations, and tailor your requests accordingly.
gl: En ocasións é lóxico ter a expectativa de que unha persoa vaia aceptar unha tarefa concreta. Por exemplo, se alguén insire un erro dentro do código, ou fai commit de código que incumpre dun xeito obvio as directrices do proxecto, entón debería ser suficiente con sinalar o problema para asumir que a persoa implicada se fará cargo do mesmo. Mais hai outras situacións nas que non está claro que as expectativas sexan correctas. A persoa pode facer o que lle pides, ou non. Como a ninguén lle gusta que se dea por feito que vai obedecer, debes ter a sensibilidade de distinguires entre estes dous tipos de situacións, e formular a túa petición dun xeito acorde á situación que se presentar.

source: One thing that almost always causes people instant annoyance is being asked to do something in a way that implies that you think it is clearly their responsibility to do it, when they feel otherwise. For example, assignment of incoming issues is particularly fertile ground for this kind of annoyance. The participants in a project usually know who is expert in what areas, so when a bug report comes in, there will often be one or two people whom everyone knows could probably fix it quickly. However, if you assign the issue over to one of those people without her prior permission, she may feel she has been put into an uncomfortable position. She senses the pressure of expectation, but also may feel that she is, in effect, being punished for her expertise. After all, the way one acquires expertise is by fixing bugs, so perhaps someone else should take this one! (Note that issue trackers that automatically assign issues to particular people based on information in the bug report are less likely to offend, because everyone knows that the assignment was made by an automated process, and is not an indication of human expectations.)
gl: Algo que adoita sentar mal é que lle requiras a alguén facer algo dun xeito que implique que pensas que claramente é a súa responsabilidade facelo, cando el non o pensa do mesmo xeito. Por exemplo, a asignación de incidencias entrantes adoita ser un terreo fértil para este tipo de cabreos. Os participantes dun proxecto adoitan saber quen é experto en que áreas, de tal xeito que cando se recibe unha notificación de erro, haberá unha ou dúas persoas que todo o mundo saiba que probablemente poidan solucionalo rapidamente. Aínda así, se asignares a incidencia a unha destas persoas sen o seu previo consentimento, podería sentirse posta nunha situación incómoda, dado que sente a presión das expectativas e tamén podería sentirse penalizada polo seu coñecemento e experiencia. Despois de todo, o xeito no que un adquire experiencia é mediante a resolución de erros, polo que quizais algún outro membro do grupo podería resolver este! (Ten en conta que os sistemas de notificación de erros que automaticamente asignan incidencias a persoas concretas, en base á información presente no sistema, adoitan ser menos ofensivos debido a que todo o mundo sabe que a asignación foi feita por un proceso automático, e non é un indicativo de expectativas humanas).

source: While it would be nice to spread the load as evenly as possible, there are certain times when you just want to encourage the person who can fix a bug the fastest to do so. Given that you can't afford a communications turnaround for every such assignment ("Would you be willing to look at this bug?" "Yes." "Okay, I'm assigning the issue over to you then." "Okay."), you should simply make the assignment in the form of an inquiry, conveying no pressure. Virtually all issue trackers allow a comment to be associated with the assignment of an issue. In that comment, you can say something like this:
gl: Aínda que o desexable sexa repartir a carga o máis equitativamente posible, hai algúns momentos concretos nos que simplemente queres envolver a persoa que pode arranxar o erro o máis axiña posible. Dado que non podes afrontar un diálogo en quendas para cada asignación ("Importaríache botarlle unha ollada a este erro?" "Si." "De acordo. Daquela vou asignarche a incidencia" "De acordo"), o máis sinxelo é que fagas a asignación na forma dunha solicitude, sen exercer presión. Virtualmente todos os sistemas de notificación de erros permiten asociar un comentario coa asignación das incidencias. Nese comentario, podes dicir algo como o seguinte:

source: Assigning this over to you, jrandom, because you're most familiar with this code. Feel free to bounce this back if you don't have time to look at it, though. (And let me know if you'd prefer not to receive such requests in the future.)
gl: Tarefa asignada para ti, X, debido a que es o que está máis familiarizado con este código. Séntete libre de devolveres a asignación se non tiveres tempo de revisala. (E faime saber se prefires non recibir este tipo de solicitudes no futuro).

source: This distinguishes clearly between the <emphasis>request</emphasis> for assignment and the recipient's <emphasis>acceptance</emphasis> of that assignment. The audience here isn't only the assignee, it's everyone: the entire group sees a public confirmation of the assignee's expertise, but the message also makes it clear that the assignee is free to accept or decline the responsibility.
gl: Así distínguese claramente a <emphasis>solicitude</emphasis> da tarefa da <emphasis>aceptación</emphasis> da mesma. A audiencia nestes procesos non é unicamente o delegado, senón todo o mundo; o grupo enteiro observa unha confirmación pública do coñecemento e experiencia do delegado, mais a mensaxe tamén deixa claro que o delegado é libre de aceptar ou declinar a responsabilidade.

source: Follow up after you delegate
gl: Persevera no delegado
