Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: Internationalization Versus Localization
gl: Internacionalización versus localización

source: <firstterm>Internationalization</firstterm> (<firstterm>I18N</firstterm>) and <firstterm>localization</firstterm> (<firstterm>L10N</firstterm>) both refer to the process of adapting a program to work in linguistic and cultural environments other than the one for which it was originally written. The terms are often treated as interchangeable, but in fact they are not quite the same thing. As <ulink url="http://en.wikipedia.org/wiki/G11n"></ulink> writes:
gl: <firstterm>Internacionalización</firstterm> (<firstterm>I18N</firstterm>) e <firstterm>localización</firstterm> (<firstterm>L10N</firstterm>) refírense ao proceso de adaptación dun programa a outros entornos lingüísticos e culturais diferentes do orixinal onde foi creado. Embora habitualmente o uso dos termos se troque, non se refiren ao mesmo. Como <ulink url="http://en.wikipedia.org/wiki/G11n"></ulink> describe:

source: The distinction between them is subtle but important: Internationalization is the adaptation of products for <emphasis>potential</emphasis> use virtually everywhere, while localization is the addition of special features for use in a <emphasis>specific</emphasis> locale.
gl: A distinción entre eles é sutil aínda que importante: a internacionalización é a adaptación de produtos para o seu <emphasis>potencial</emphasis> uso en todas partes, mentres a localización ten a ver con engadir funcionalidades <emphasis>específicas</emphasis> para o seu uso en determinados entornos.

source: For example, changing your software to losslessly handle Unicode (<ulink url="http://en.wikipedia.org/wiki/Unicode"></ulink>) text encodings is an internationalization move, since it's not about a particular language, but rather about accepting text from any of a number of languages. On the other hand, making your software print all error messages in Slovenian, when it detects that it is running in a Slovenian environment, is a localization move.
gl: Por exemplo, o feito de mudar o teu programa para que use Unicode (<ulink url="http://en.wikipedia.org/wiki/Unicode"></ulink>) como formato de codificación de texto é un movemento de internacionalización, xa que non se refire a unha linguaxe particular senón a facilitar o procesamento de texto en múltiples linguaxes. Por outra banda, facer que o programa imprima tódalas mensaxes de erro en esloveno, cando se detecta que está sobre un entorno configurado para tal linguaxe, é un movemento de localización.

source: Thus, the translation manager's task is principally about localization, not internationalization.
gl: Así, as tarefas do xestor de traducións refírense principalmente á localización, non á internacionalización.

source: Documentation Manager
gl: Xestor de documentación

source: Keeping software documentation up-to-date is a never-ending task. Every new feature or enhancement that goes into the code has the potential to cause a change in the documentation. Also, once the project's documentation reaches a certain level of completeness, you will find that a lot of the patches people send in are for the documentation, not for the code. This is because there are many more people competent to fix bugs in prose than in code: all users are readers, but only a few are programmers.
gl: O mantemento da documentación é unha tarefa que nunca remata. Cada nova funcionalidade ou mellora introducida no código pode esixir unha mudanza na documentación. Ademais, cando a documentación dun proxecto atinxe un certo nivel de completitude, verás que moitos dos remendos que a xente envía son para a documentación, non para o código. Isto débese a que hai máis xente competente para resolver erros na prosa que no código: tódolos usuarios son lectores, mais só uns poucos son programadores.

source: Documentation patches are usually much easier to review and apply than code patches. There is little or no testing to be done, and the quality of the change can be evaluated quickly just by review. Since the quantity is high, but the review burden fairly low, the ratio of administrative overhead to productive work is greater for documentation patches than for code patches. Furthermore, most of the patches will probably need some sort of adjustment, in order to maintain a consistent authorial voice in the documentation. In many cases, patches will overlap with or affect other patches, and need to be adjusted with respect to each other before being committed.
gl: Os remendos de documentación son máis sinxelos de revisar e aplicar que os de código. Hai pouco que revisar ou testar, e a calidade da mudanza pode ser avaliada rapidamente mediante a revisión do texto. Xa que a cantidade é alta e a carga de revisión é baixa, a relación de carga administrativa en relación ao traballo produtivo é maior para remendos de documentación que para os de código. Por outra banda, a maioría dos remendos probablemente precisarán de algún axuste, de cara a manter unha voz única ao longo de toda a documentación. En moitos casos, os remendos estarán solapados ou afectarán a outros remendos, e precisarán ser axustados antes de facerse commit con eles.

source: Given the exigencies of handling documentation patches, and the fact that the code base needs to be constantly monitored so the documentation can be kept up-to-date, it makes sense to have one person, or a small team, dedicated to the task. They can keep a record of exactly where and how the documentation lags behind the software, and they can have practiced procedures for handling large quantities of patches in an integrated way.
gl: Dadas as esixencias de xestión dos remendos de documentación, e o feito de que o código precisa ser monitorizado constantemente para que a documentación estea actualizada, ten sentido que unha persoa ou un equipo se dedique á tarefa. Eles poden facer seguimento de onde e como a documentación vai atrasada con respecto do código, ademais de que poden ter desenvolvido procedementos eficientes para manexar grandes cantidades de remendos dun modo integrado.

source: Of course, this does not preclude other people in the project from applying documentation patches on the fly, especially small ones, as time permits. And the same patch manager (see <xref linkend="patch-manager"/><phrase output="printed"> earlier in this chapter</phrase>) can track both code and documentation patches, filing them wherever the development and documentation teams want them, respectively. (If the total quantity of patches ever exceeds one human's capacity to track, though, switching to separate patch managers for code and documentation is probably a good first step.) The point of a documentation team is to have people who think of themselves as responsible for keeping the documentation organized, up-to-date, and consistent with itself. In practice, this means knowing the documentation intimately, watching the code base, watching the changes <emphasis>others</emphasis> commit to the documentation, watching for incoming documentation patches, and using all these information sources to do whatever is necessary to keep the documentation healthy.
gl: Evidentemente, isto non impide que outras persoas poidan enviar e aplicar mudanzas na documentación, especialmente os pequenos. O mesmo xestor de remendos (ver <xref linkend="patch-manager"/><phrase output="printed"> anteriormente neste mesmo capítulo</phrase>) pode facer seguimento tanto dos remendos de código como dos de documentación, cubríndoos onde os equipos de desenvolvemento e documentación estiveren habituados a recibilos. (Se a cantidade de remendos en total excede o que unha persoa pode seguir, dividir o traballo entre un xestor de remendos de código e outro de documentación é probablemente un bo primeiro paso). A vantaxe de ter un equipo de documentación é ter persoas que teñan en mente a tarefa de manter a documentación organizada, actualizada e coherente. Na práctica, isto quere dicir coñecer a documentación en profundidade, revisar o código, ver tamén as mudanzas que <emphasis>outros</emphasis> fan sobre a documentación, revisar remendos á documentación e usar toda esas fontes de información para facer o que for necesario para manter a documentación nun bo estado.

source: Issue Manager
gl: Xestor de incidencias

source: The number of issues in a project's bug tracker grows in proportion to the number of people using the software. Therefore, even as you fix bugs and ship an increasingly robust program, you should still expect the number of open issues to grow essentially without bound. The frequency of duplicate issues will also increase, as will the frequency of incomplete or poorly described issues.
gl: O número de incidencias no sistema de xestión de erros do proxecto crece proporcionalmente co número de xente que usa o programa. Embora arranxes erros e distribúas unha aplicación cada vez máis robusta, deberías esperar que o número de erros abertos medre. Tamén se incrementará a frecuencia de erros duplicados, así como a de aqueles incompletos ou pobremente descritos.

source: Issue managers help alleviate these problems by watching what goes into the database, and periodically sweeping through it looking for specific problems. Their most common action is probably to fix up incoming issues, either because the reporter didn't set some of the form fields correctly, or because the issue is a duplicate of one already in the database. Obviously, the more familiar an issue manager is with the project's bug database, the more efficiently she will be able to detect duplicate issues&mdash;this is one of the main advantages of having a few people specialize in the bug database, instead of everyone trying to do it <foreignphrase>ad hoc</foreignphrase>. When the group tries to do it in a decentralized manner, no single individual acquires a deep expertise in the content of the database.
gl: Os xestores de erros axudan a aliviar eses problemas mediante a revisión de todo o que se vai introducindo na base de datos, e de forma periódica buscando problemas específicos. A tarefa máis común probablemente sexa a de revisar tódolos erros novos e comprobar que non son duplicados de outros ou que os campos están correctamente preenchidos. Obviamente, canto máis familiarizada estiver esta persoa coa base de datos do proxecto, máis eficientemente será capaz de detectar duplicados &mdash; o que é unha das principais vantaxes de ter unha pouca xente especializada, en vez de ter a todo o mundo tratando de facelo <foreignphrase>ad hoc</foreignphrase>. Cando un grupo trata de facelo dun modo descentralizado, ninguén adquire un coñecemento profundo do contido da base de datos.

source: Issue managers can also help map between issues and individual developers. When there are a lot of bug reports coming in, not every developer may read the issue notification mailing list with equal attention. However, if someone who knows the development team is keeping an eye on all incoming issues, then she can discreetly direct certain developers' attention to specific bugs when appropriate. Of course, this has to be done with a sensitivity to everything else going on in development, and to the recipient's desires and temperament. Therefore, it is often best for issue managers to be developers themselves.
gl: Os xestores de erros poden tamén axudar tamén a diminuír a fenda existente entre usuarios e desenvolvedores. Cando se notifican moitos erros, non tódolos desenvolvedores poden seguir con igual atención a lista de correo. Porén, si alguén próximo ao equipo de desenvolvemento revisa tódolos erros entrantes, pode chamar a atención dun desenvolvedor sobre un problema concreto que a este se lle pasou. Desde logo, isto ten que facerse coa sensibilidade adecuada. É unha boa práctica que os xestores de erros sexan á súa vez desenvolvedores.

source: Depending on how your project uses the issue tracker, issue managers can also shape the database to reflect the project's priorities. For example, in Subversion we schedule issues into specific future releases, so that when someone asks "When will bug X be fixed?" we can say "Two releases from now," even if we can't give an exact date. The releases are represented in the issue tracker as target milestones, a field available in IssueZilla.<footnote><para>IssueZilla is the issue tracker we use; it is a descendant of BugZilla.</para></footnote> As a rule, every Subversion release has one major new feature and a list of specific bug fixes. We assign the appropriate target milestone to all the issues planned for that release (including the new feature&mdash;it gets an issue too), so that people can view the bug database through the lens of release scheduling. These targets rarely remain static, however. As new bugs come in, priorities sometimes get shifted around, and issues must be moved from one milestone to another so that each release remains manageable. This, again, is best done by people who have an overall sense of what's in the database, and how various issues relate to each other.
gl: En función de como o proxecto use o sistema de envío de erros, os coordinadores poden tamén darlle forma á base de datos para reflectir as prioridades actuais do proxecto. Por exemplo, no proxecto Subversion programabamos certas funcionalidades/corrección de erros para certas versións futuras do proxecto. Seguindo esta política, cando alguén pregunta "Cando será resolto este erro?" podemos dicir "dentro de 2 versións", mesmo se non for posible dar unha data exacta. As versións estaban representadas no sistema como milestones (marcos), un campo dispoñible na aplicación que nos usabamos IssueZilla.<footnote><para>IssueZilla é un sistema xestor de erros descendente de BugZilla</para></footnote> Como norma, cada nova versión de Subversion ten unha nova funcionalidade e un conxunto de erros resoltos. Nós asignamos o milestone adecuado a tódalas incidencias planeadas para esa versión (incluíndo a nova funcionalidade &mdash; nós considerámola tamén como unha incidencia), así a xente pode navegar na base de datos a través das diferentes versións sabendo que mudanzas incluirán. Porén, eses obxectivos raramente se manteñen estáticos. A medida que chegan novos erros, as prioridades teñen que ser repensadas e as incidencias deben ser re-planeadas dun milestone a outro, de cara a que a nova versión sexa manexable. Este traballo, é mellor que o faga xente que teña unha visión global do que hai na base de datos e de como as diferentes incidencias se relacionan entre si.

source: Another thing issue managers do is notice when issues become obsolete. Sometimes a bug is fixed accidentally as part of an unrelated change to the software, or sometimes the project changes its mind about whether a certain behavior is buggy. Finding obsoleted issues is not easy: the only way to do it systematically is by making a sweep over all the issues in the database. Full sweeps become less and less feasible over time, however, as the number of issues grows. After a certain point, the only way to keep the database sane is to use a divide-and-conquer approach: categorize issues immediately on arrival and direct them to the appropriate developer's or team's attention. The recipient then takes charge of the issue for the rest of its lifetime, shepherding it to resolution or oblivion as necessary. When the database is that large, the issue manager becomes more of an overall coordinator, spending less time looking at each issue herself and more time getting it into the right person's hands.
gl: Outra das tarefas que leva a cabo un coordinador é ver cando unha incidencia é obsoleta. A veces, un erro é corrixido accidentalmente como parte dunha mudanza no programa, ou a veces a xente implicada muda de opinión sobre se un comportamento é erróneo. Atopar incidencias obsoletas non é sinxelo: o único modo de facelo é rastreando sistematicamente a base de datos do proxecto. Os rastrexos completos son menos prácticos a medida que aumenta o número de incidencias. Chegado a certo punto, a única aproximación para manter unha lista de erros adecuada é usar a estratexia de divide e vencerás: categorizar as incidencias a medida que cheguen e dirixilas directamente ao desenvolvedor ou equipo adecuado. Esa persoa ou grupo de persoas faise cargo desa incidencia desde entón, ficando obrigado a resolvela ou encamiñala cando for necesario. Cando a base de datos é moi grande, o xestor de incidencias parécese máis a un coordinador, invertendo menos tempo revisando cada incidencia e máis en encamiñala á persoa adecuada.

source: FAQ Manager
gl: Xestor da FAQ (Preguntas Frecuentes)

source: FAQ maintenance is a surprisingly difficult problem. Unlike most other documents in a project, whose content is planned out in advance by the authors, a FAQ is a wholly reactive document (see <xref linkend="starting-a-faq"/>). No matter how big it gets, you still never know what the next addition will be. And because it is always added to piecemeal, it is very easy for the document as a whole to become incoherent and disorganized, and even to contain duplicate or semi-duplicate entries. Even when it does not have any obvious problems like that, there are often unnoticed interdependencies between items&mdash;links that should be made but aren't&mdash;because the related items were added a year apart.
gl: Contra todo prognóstico, o mantemento da FAQ é un problema complexo. A diferencia da maioría dos documentos dun proxecto, cuxos contidos son planeados por adiantado polos propios autores, a FAQ é un documento reactivo (ver <xref linkend="starting-a-faq"/>). Non importa como de grande sexa, é imposible coñecer cal será o seguinte engadido. E debido a que vai crecendo por pequenas mudanzas, é sinxelo que se converta nun documento desorganizado e incoherente, mesmo contendo duplicados ou semi-duplicados. Mesmo cando non existan obvios problemas como eses, haberá interdependencias entre os temas &mdash; ligazóns que deberían estar mais non están&mdash; debido a que os items relacionados foron engadidos un ano atrás.

source: The role of a FAQ manager is twofold. First, she maintains the overall quality of the FAQ by staying familiar with at least the topics of all the questions in it, so that when people add new items that are duplicates of, or related to, existing items, the appropriate adjustments can be made. Second, she watches the project mailing lists and other forums for recurring problems or questions, and to write new FAQ entries based on this input. This latter task can be quite complex: one must be able to follow a thread, recognize the core questions raised in it, post a proposed FAQ entry, incorporate comments from others (since it's impossible for the FAQ manager to be an expert in every topic covered by the FAQ), and sense when the process is finished so the item can at last be added.
gl: O rol do xestor da FAQ ten dúas caras. A primeira, consiste en manter a calidade global da FAQ e estar familiarizado con tódolos temas que hai en ela, para que cando a xente engada novos temas que son duplicados de, ou relacionados con outros, se poidan levar a cabo os axustes necesarios. A segunda, consiste en revisar a lista de correo do proxecto e outros foros buscando preguntas recorrentes, escribindo novas entradas na FAQ baseadas nesta información. Esta última tarefa pode ser bastante complexa: un debe ser capaz de seguir un fío de correos, recoñecer as cuestións clave, enviar para debate unha entrada na FAQ que explique o anterior, incorporar os comentarios doutras persoas (xa que é imposible para o xestor da FAQ ser un experto en cada tema cuberto pola FAQ) e saber cando o proceso de debate finaliza para poder engadir o novo ítem á FAQ.

source: The FAQ manager usually also becomes the default expert in FAQ formatting. There are a lot of little details involved in keeping a FAQ in shape (see <xref linkend="all-as-archives"/><phrase output="printed"> in <xref linkend="communications"/></phrase>); when random people edit the FAQ, they will sometimes forget some of these details. That's okay, as long as the FAQ manager is there to clean up after them.
gl: Esta persoa, habitualmente convértese no experto por defecto no formato da FAQ. Hai un montón de pequenos detalles ao redor de manter unha FAQ (ver <xref linkend="all-as-archives"/><phrase output="printed"> en <xref linkend="communications"/></phrase>); cando xente aleatoria a edita, algunhas veces van esquecer certos detalles. Non hai problema por iso, sempre e cando o xestor da FAQ estea aí para resolver o problema.

source: Various free software is available to help with the process of FAQ maintenance. It's fine to use it, as long as it doesn't compromise the quality of the FAQ, but beware of over-automation. Some projects try to fully automate the process of FAQ maintenance, allowing everyone to contribute and edit FAQ items in a manner similar to a wiki (see <xref linkend="wikis"/><phrase output="printed"> in <xref linkend="technical-infrastructure"/></phrase>). I've seen this happen particularly with Faq-O-Matic (<ulink url="http://faqomatic.sourceforge.net/"></ulink>), though it may be that the cases I saw were simply abuses that went beyond what Faq-O-Matic was originally intended for. In any case, while complete decentralization of FAQ maintenance does reduce the workload for the project, it also results in a poorer FAQ. There's no one person with a broad view of the entire FAQ, no one to notice when certain items need updating or become obsolete entirely, and no one keeping watch for interdependencies between items. The result is a FAQ that often fails to provide users what they were looking for, and in the worst cases misleads them. Use whatever tools you need to to maintain your project's FAQ, but never let the convenience of the tools seduce you into compromising the quality of the FAQ.
gl: Existen varias ferramentas de software libre para manter a FAQ. Paga a pena usalas sempre e cando non comprometa a calidade da FAQ nin supoña unha sobre-automatización. Algúns proxectos tratan de automatizar o proceso por completo, permitindo que todo o mundo contribúa e a edite dun modo similar a un wiki (ver <xref linkend="wikis"/><phrase output="printed"> en <xref linkend="technical-infrastructure"/></phrase>). Particularmente, isto ocorre con Faq-O-Matic (<ulink url="http://faqomatic.sourceforge.net/"></ulink>), aínda que é posible que os casos que teño visto foran simplemente abusos que foron máis alá das intencións orixinais para o que Faq-O-Matic fora pensado. En calquera caso, aínda que a descentralización da edición e mantemento da FAQ reduce a carga de traballo do proxecto, iso tamén produce unha FAQ de peor calidade. Non hai ninguén cunha visión completa do documento, ninguén para observar cando certos ítems son obsoletos, duplicados ou precisan actualización, non hai ninguén que se encargue de ver as interdependencias entre os ítems. Como resultado obtense un documento que non satisface as necesidades do usuario, e no peor caso, o confunde. Usa as ferramentas que consideres necesarias para manter o documento, mais nunca te deixes cegar polas mesmas comprometendo a calidade da FAQ.

source: See Sean Michael Kerner's article, <citetitle>The FAQs on FAQs</citetitle>, at <ulink url="http://osdir.com/Article1722.phtml"></ulink>, for descriptions and evaluations of open source FAQ maintenance tools.
gl: Bótalle un ollo ao artigo de Michael Kerner <citetitle>A FAQ das FAQs</citetitle>, en <ulink url="http://osdir.com/Article1722.phtml"></ulink>, para obteres descricións e avaliacións detalladas de ferramentas de mantemento de FAQs con software libre.

source: Transitions
gl: Transicións
