Repository: amaneiro/poss-gl
Catalog: po/*/ch08.po
Languages: gl

source: ...and then he went on to berate the project <emphasis>again</emphasis> for not providing binaries, while still not volunteering to do anything about it. After that, about 50 people just jumped all over him, and I can't say I really minded. The "zero-tolerance" policy toward rudeness advocated in <xref linkend="prevent-rudeness"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase> applies to people with whom the project has (or would like to have) a sustained interaction. But when someone makes it clear from the start that he is going to be a fountain of bile, there is no point making him feel welcome.
gl: ... e entón voltou <emphasis>de novo</emphasis> a reprender a xente do proxecto por non proporcionar os binarios, aínda que non se propuxo voluntario para facer nada. Despois diso, unhas 50 persoas se abalanzaron sobre el, e non podo dicir que me preocupase demasiado. A política de "tolerancia cero" contra a mala educación predicada anteriormente <xref linkend="prevent-rudeness"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase> aplícase ás persoas coas que o proxecto ten (o debería ter) unha interacción sostida no tempo, mais cando alguén se postula como unha fonte de malos modais dende o comezo, non paga a pena facer que se sinta como na casa.

source: Such situations are fortunately quite rare, and they are noticeably rarer in projects that make an effort to engage users constructively and courteously from their very first interaction.
gl: Afortunadamente, tales situacións son raras e son aínda moito máis estranas naqueles proxectos que fan o esforzo de integrar os novos participantes de modo construtivo e cortesmente desde o inicio.

source: Share Management Tasks as Well as Technical Tasks
gl: Comparte as tarefas de xestión así como as técnicas

source: Share the management burden as well as the technical burden of running the project. As a project becomes more complex, more and more of the work is about managing people and information flow. There is no reason not to share that burden, and sharing it does not necessarily require a top-down hierarchy either&mdash;what happens in practice tends to be more of a peer-to-peer network topology than a military-style command structure.
gl: Comparte tanto o traballo de xestión así como o técnico do día a día do proxecto. A medida que un proxecto se fai máis complexo, cada vez máis traballo ten que ver con xestión da xente e fluxo de información. Non hai razón para non compartir esas tarefas, e por compartir non quero dicir necesariamente unha xerarquía top-down &mdash; na práctica dáse máis unha topoloxía de redes igualitarias antes que unha estrutura de estilo militar.

source: Sometimes management roles are formalized, and sometimes they happen spontaneously. In the Subversion project, we have a patch manager, a translation manager, documentation managers, issue managers (albeit unofficial), and a release manager. Some of these roles we made a conscious decision to initiate, others just happened by themselves; as the project grows, I expect more roles to be added. Below we'll examine these roles, and a couple of others, in detail (except for release manager, which was already covered in <xref linkend="release-manager"/> and <xref linkend="release-owner"/><phrase output="printed"> earlier in this chapter</phrase>).
gl: Algunhas veces, os roles de xestión están formalizados e outros emerxen de modo espontáneo. No proxecto Subversion, temos un xestor de remendos, outro de traducións, de documentación, xestión de incidencias (aínda que non oficial) e un xestor das publicacións do software. Algúns deses roles saíron dunha decisión consciente, outros simplemente emerxeron por si mesmos; a medida que o proxecto medre, supoño que máis roles aparecerán. A continuación examinaranse ese roles e outros en detalle (a excepción do xestor de publicación, o do que xa se falou en <xref linkend="release-manager"/> e <xref linkend="release-owner"/><phrase output="printed"></phrase>).

source: As you read the role descriptions, notice that none of them requires exclusive control over the domain in question. The issue manager does not prevent other people from making changes in the issues database, the FAQ manager does not insist on being the only person to edit the FAQ, and so on. These roles are all about responsibility without monopoly. An important part of each domain manager's job is to notice when other people are working in that domain, and train them to do the things the way the manager does, so that the multiple efforts reinforce rather than conflict. Domain managers should also document the processes by which they do their work, so that when one leaves, someone else can pick up the slack right away.
gl: A medida que vexas as descrición dos roles, observa como ningún deles require control exclusivo sobre o dominio en cuestión. O xestor de incidencias non evita que outra xente faga mudanzas na base de datos de incidencias, a persoa encargada da FAQ non pretende ser a única persoa en editar a FAQ, etc. Eses roles versan sobre responsabilidades, non sobre monopolio. Unha parte importante sobre o traballo de cada un dos xestores é observar cando a xente está a traballar nese dominio e axudalos para que fagan mellor as cousas, de cara a que os múltiples esforzos se vexan multiplicados e non entren en conflito. Os xestores deberían tamén documentar os procesos mediante os que fan o seu traballo, para que cando un queira deixalo, algún outro poida retomar o seu traballo.

source: Sometimes there is a conflict: two or more people want the same role. There is no one right way to handle this. You could suggest that each volunteer post a proposal (an "application") and have all the committers vote on which is best. But this is cumbersome and potentially awkward. I find that a better technique is just to ask the multiple candidates to settle it among themselves. They usually will, and will be more satisfied with the result than if a decision had been imposed on them from the outside.
gl: A veces existe un conflito: dúas ou máis persoas desexan o mesmo rol. Non hai un modo correcto de xestionar isto. Pódese suxerir que cada voluntario propoña unha candidatura e tódalas persoas con acceso ao repositorio voten sobre cal lles parece a mellor. Mais esta técnica é potencialmente nociva. Unha mellor é falar cos múltiples candidatos para que entre eles cheguen a un consenso. Habitualmente chegarán a el, e esta solución sentirase como máis xusta que se viñer imposta por alguén de fóra.

source: Patch Manager
gl: Xestor de remendos

source: In a free software project that receives a lot of patches, keeping track of which patches have arrived and what has been decided about them can be a nightmare, especially if done in a decentralized way. Most patches arrive as posts to the project's development mailing list (though some may appear first in the issue tracker, or on external web sites), and there are a number of different routes a patch can take after arrival.
gl: Nun proxecto de software libre que recibe moitos remendos, facer seguimento de cada un deles pode ser un pesadelo, especialmente se se fixer dun modo descentralizado. A maioría dos remendos son enviados como mensaxes á lista de correo (aínda que algún deles pode ser enviado ao xestor de incidencias, ou ter aparecido nalgún sitio web), e existen varios camiños que poden seguir desde ese momento.

source: Sometimes someone reviews the patch, finds problems, and bounces it back to the original author for cleanup. This usually leads to an iterative process&mdash;all visible on the mailing list&mdash;in which the original author posts revised versions of the patch until the reviewer has nothing more to criticize. It is not always easy to tell when this process is done: if the reviewer commits the patch, then clearly the cycle is complete. But if she does not, it might be because she simply didn't have time, or doesn't have commit access herself and couldn't rope any of the other developers into doing it.
gl: Ás veces, alguén revisa o remendos atopa algún problema e encamíñao ao autor orixinal para que corrixa os erros. Este proceso habitualmente leva a un proceso iterativo &mdash;sempre visible a través da lista de correo&mdash; no que o autor orixinal envía versións sucesivas do remendo ata que ninguén ten nada máis que criticar. Non sempre é sinxelo saber cando remata o proceso: se o revisor fixer commit do remendo, claramente o proceso está completo. Mais se non for así, podo ser porque non tivo tempo, ou non ten acceso de commit e non puido falar con outros desenvolvedores para que o fixesen.

source: Another frequent response to a patch is a freewheeling discussion, not necessarily about the patch itself, but about whether the concept behind the patch is good. For example, the patch may fix a bug, but the project prefers to fix that bug in another way, as part of solving a more general class of problems. Often this is not known in advance, and it is the patch that stimulates the discovery.
gl: Outra resposta frecuente é un debate espontáneo, non necesariamente sobre o remendo, senón sobre se o concepto detrás do remendo é adecuado. Por exemplo, o remendo pode ter un erro, mais o proxecto prefire arranxalo doutro modo, como parte dunha estratexia para resolver unha clase máis xeral de problemas. Habitualmente, isto non se sabe por adiantado, é o mesmo remendo o que fai o descubrimento.

source: Occasionally, a posted patch is met with utter silence. Usually this is due to no developer having time <emphasis>at that moment</emphasis> to review the patch, so each hopes that someone else will do it. Since there's no particular limit to how long each person waits for someone else to pick up the ball, and meanwhile other priorities are always coming up, it's very easy for a patch to slip through the cracks without any single person intending for that to happen. The project might miss out on a useful patch this way, and there are other harmful side effects as well: it is discouraging to the author, who invested work in the patch, and it makes the project as a whole look a bit out of touch, especially to others considering writing patches.
gl: Ocasionalmente, o remendo atópase con silencio absoluto. Isto soe acontecer porque ningún desenvolvedor ten tempo <emphasis>nese preciso instante</emphasis> para revisalo, e cada un deles espera que outro o revise. Debido a que non hai un límite específico sobre canto unha persoa pode esperar para que alguén responda e que poden chegar novas prioridades ao proxecto, é moi sinxelo que un remendo pase desapercibido. O proxecto pode estar perdendo un bo remendo, mais existen outros efectos colaterais peores que este: é desalentador para o autor -quen ten invertido traballo no remendo- e transmite que o proxecto non está ó día, sobre todo con esa xente que escribe e envía remendos.

source: The patch manager's job is to make sure that patches don't "slip through the cracks." This is done by following every patch through to some sort of stable state. The patch manager watches every mailing list thread that results from a patch posting. If it ends in a commit of the patch, he does nothing. If it goes into a review/revise iteration, ending with a final version of the patch but no commit, he files an issue pointing to the final version, and to the mailing list thread around it, so that there is a permanent record for developers to follow up on later. If the patch addresses an existing issue, he annotates that issue with the relevant information, instead of opening a new issue.
gl: O traballo do xestor de remendos é asegurarse de que os remendos non se perden no vacuo. Isto faise seguindo a evolución de cada remendo con algunha clase de táboa de estado. O xestor de remendos vixía cada lista de correo na que se envían remendos. Se o envío do remendo finaliza en commit, non fai nada. Se entra nun proceso interactivo de revisión, tendo unha versión do remendo definitiva mais non se fai comit, preocúpase de cubrir unha incidencia que apunte a esa versión final do remendo e á lista de correo na que sucedeu, para que sexa sinxelo que os desenvolvedores o revisen máis tarde. Se o remendo ten a ver cunha incidencia concreta, anota toda esa información baixo a incidencia existente.

source: When a patch gets no reaction at all, the patch manager waits a few days, then follows up asking if anyone is going to review it. This usually gets a reaction: a developer may explain that she doesn't think the patch should be applied, and give the reasons why, or she may review it, in which case one of the previously described paths is taken. If there is still no response, the patch manager may or may not file an issue for the patch, at his discretion, but at least the original submitter got <emphasis>some</emphasis> reaction.
gl: Cando un remendo non xera ningunha reacción, o xestor de remendos espera uns poucos días, e entón pregunta se alguén vai a revisalo. En xeral, isto xera algunha reacción: un desenvolvedor pode explicar que o remendo non debería ser aplicado ou pode revisalo el mesmo, dando lugar a un dos camiños expostos anteriormente. Se a pesar diso, non hai resposta, o xestor de remendo pode (ou non) cubrir unha incidencia para o remendo segundo mellor vexa, mais polo menos o autor orixinal obtén <emphasis>algún</emphasis> feedback.

source: Having a patch manager has saved the Subversion development team a lot of time and mental energy. Without a designated person to take responsibility, every developer would constantly have to worry "If I don't have time to respond to this patch right now, can I count on someone else doing it? Should I try to keep an eye on it? But if other people are also keeping an eye on it, for the same reasons, then we'd have needlessly duplicated effort." The patch manager removes the second-guessing from the situation. Each developer can make the decision that is right for her at the moment she first sees the patch. If she wants to follow up with a review, she can do that&mdash;the patch manager will adjust his behavior accordingly. If she wants to ignore the patch completely, that's fine too; the patch manager will make sure it isn't forgotten.
gl: Para o proxecto Subversion, ter un xestor de remendos supuxo un aforro de tempo e enerxía mental. Sen unha persoa especialmente dedicada a estes temas, cada desenvolvedor tería que preocuparse constantemente sobre a xestión do mesmo: "Se non teño tempo de respondelo agora, podo confiar en alguén para que o faga? Debería botarlle un ollo? E se outra xente xa o está revisando? Entón estaríamos duplicando esforzos de modo innecesario". O xestor de remendos elimina este tipo de dúbidas e cuestións. Cada desenvolvedor toma a decisión que mellor lle veña no mesmo momento en que ve o remendo: se desexa seguilo e revisalo, pode facelo. Se vai ignoralo, iso tamén está ben, xa que o xestor do remendo fará que non fique no olvido.

source: Because this system works only if people can depend on the patch manager being there without fail, the role should be held formally. In Subversion, we advertised for it on the development and users mailing lists, got several volunteers, and took the first one who replied. When that person had to step down (see <xref linkend="transitions"/><phrase output="printed"> later in this chapter</phrase>), we did the same thing again. We've never tried having multiple people share the role, because of the communications overhead that would be required between them; but perhaps at very high volumes of patch submission, a multiheaded patch manager might make sense.
gl: Este sistema funciona só se a xente pode confiar en que o xestor de remendo vai estar aí sempre, o rol debe ser formalmente declarado. En Subversion, publicitámolo nas listas de correo de usuarios e desenvolvedores, obtendo bastantes voluntarios e escollendo ó primeiro que respondeu. Cando esta persoa tivo que deixalo (ver <xref linkend="transitions"/><phrase output="printed"> máis adiante</phrase>), fixemos o mesmo de novo. Nunca se tentou ter varias persoas co mesmo rol, debido á sobrecarga en comunicacións que requiriría entre ambos, mais talvez en proxectos con moita carga de remendos, un equipo de xestores de remendos teña sentido.

source: Translation Manager
gl: Xestor das traducións

source: In software projects, "translation" can refer to two very different things. It can mean translating the software's documentation into other languages, or it can mean translating the software itself&mdash;that is, having the program display errors and help messages in the user's preferred language. Both are complex tasks, but once the right infrastructure is in place, they are largely separable from other development. Because the tasks are similar in some ways, it may make sense (depending on your project) to have a single translation manager handle both, or it may be better to have two different managers.
gl: Nos proxectos de software, "tradución" pode referirse a cousas moi diferentes. Por un lado, pode ter que ver coa tradución da documentación a outras linguaxes, polo outro, pode referirse á tradución da aplicación &mdash; é dicir, facer que as mensaxes que emite o programa estean dispoñibles na linguaxe preferida polo usuario. Ambas son tarefas complexas, mais unha vez a infraestrutura estiver lista, son tarefas ben diferenciadas de outras de desenvolvemento. Xa que son similares entre elas, pode ter sentido (dependendo do proxecto) ter un xestor de traducións que manexe as dúas, ou polo contrario pode ter sentido ter dous diferentes.

source: In the Subversion project, we have one translation manager handle both. He does not actually write the translations himself, of course&mdash;he may help out on one or two, but as of this writing, he would need to speak ten languages (twelve counting dialects) in order to work on all of them! Instead, he manages teams of volunteer translators: he helps them coordinate among each other, and he coordinates between the teams and the rest of the project.
gl: No proxecto Subversion, temos a unha única persoa xestionando ambas. Esta persoa non escribe as traducións por si mesmo, desde logo &mdash; pode botar unha man nunha ou dúas, mais precisaría falar 10 linguas (12 dialectos) para traballar en todas elas! O seu labor ten que ver coa xestión de voluntarios e equipos de tradución: axúdaos a coordinárense entre eles, e esta persoa é o punto común entre todos os equipos e o resto do proxecto.

source: Part of the reason the translation manager is necessary is that translators are a different demographic from developers. They sometimes have little or no experience working in a version control repository, or indeed with working as part of a distributed volunteer team at all. But in other respects they are often the best kind of volunteer: people with specific domain knowledge who saw a need and chose to get involved. They are usually willing to learn, and enthusiastic to get to work. All they need is someone to tell them how. The translation manager makes sure that the translations happen in a way that does not interfere unnecessarily with regular development. He also serves as a sort of representative of the translators as a unified body, whenever the developers must be informed of technical changes required to support the translation effort.
gl: Unha das razóns principais polas que o xestor de tradución é necesario, é que en xeral, os tradutores son bastante diferentes dos desenvolvedores. Ás veces, teñen pouca ou ningunha experiencia traballando con sistemas de control de versións, ou mesmo de traballo dentro dun grupo distribuído de voluntarios. Mais noutros aspectos son os mellores voluntarios: xente con coñecemento do dominio que viu unha necesidade e desexa participar na súa resolución. Habitualmente están dispostos a aprenderen todo o necesario e son entusiastas do seu traballo. Todo o que precisan é que alguén os guíe. O xestor de traducións asegúrase de que as mesmas evolúan correctamente sen interferiren no desenvolvemento regular do proxecto. Tamén exerce de representante dos tradutores como un grupo en si mesmo, cando se comunica con desenvolvedores de cara a informalos de mudanzas técnicas necesarias para mellorar o traballo de tradución.

source: Thus, the position's most important skills are diplomatic, not technical. For example, in Subversion we have a policy that all translations should have at least two people working on them, because otherwise there is no way for the text to be reviewed. When a new volunteer shows up offering to translate Subversion to, say, Malagasy, the translation manager has to either hook him up with someone who posted six months ago expressing interest in doing a Malagasy translation, or else politely ask the volunteer to go find <emphasis>another</emphasis> Malagasy translator to work with as a partner. Once enough people are available, the manager sets them up with the proper kind of commit access, informs them of the project's conventions (such as how to write log messages), and then keeps an eye out to make sure they adhere to those conventions.
gl: Sendo así, as capacidades máis valiosas para este posto son diplomáticas, non técnicas. Por exemplo, no proxecto Subversion temos a política de que tódalas traducións deben ter polo menos 2 persoas traballando nelas, debido a que doutro xeito o texto non será revisado. Cando un novo voluntario se ofrece a traducir o proxecto a, por exemplo, Malagasy, o xestor de tradución ten que presentarlle a alguén quen informou 6 meses atrás de que quería traducir o proxecto a Malagasy ou amablemente indicarlle que busque <emphasis>outro</emphasis> tradutor. Unha vez que se consegue a xente suficiente, o xestor ocúpase de todo o relativo a darlle acceso de commiter, informalos sobre as convencións do proxecto (tales como escribir mensaxes de log) e fai o seguimento oportuno para que sigan esas convencións.

source: Conversations between the translation manager and the developers, or between the translation manager and translation teams, are usually held in the project's original language&mdash;that is, the language from which all the translations are being made. For most free software projects, this is English, but it doesn't matter what it is as long as the project agrees on it. (English is probably best for projects that want to attract a broad international development community, though.)
gl: As conversas entre os desenvolvedores e o xestor de traducións, ou entre este e os equipos de tradución, mantéñense na lingua franca do proxecto &mdash; é dicir, na lingua orixe desde a que se fan tódalas traducións. Para a maioría de proxectos de software libre, esta lingua é o inglés, mais non importa cal sexa sempre e cando o proxecto teña un acordo sobre a mesma (o inglés é probablemente mellor para proxectos que desexen atraer unha comunidade de desenvolvedores internacional).

source: Conversations <emphasis>within</emphasis> a particular translation team usually happen in their shared language, however, and one of the other tasks of the translation manager is to set up a dedicated mailing list for each team. That way the translators can discuss their work freely, without distracting people on the project's main lists, most of whom would not be able to understand the translation language anyway.
gl: As conversas <emphasis>dentro </emphasis>dun equipo de tradución, habitualmente teñen lugar na súa lingua compartida. Unha das tarefas que debe levar a cabo o xestor de traducións é encargarse de que o equipo teña unha lista de correo exclusiva para eles. Deste modo, os tradutores poden debater o seu traballo libremente, sen distraeren outras persoas que están noutras listas de correo, a maioría das cales non entenderán a lingua.
