Repository: amaneiro/poss-gl
Catalog: po/*/ch09.po
Languages: es

source: Although it is useful, both legally and politically, to build patent defenses into free software licenses this way, in the end these steps will not be enough to dispel the chilling effect that the threat of patent lawsuits has on free software. Only changes in the substance or interpretation of international patent law will do that. To learn more about the problem, and how it's being fought, go to <ulink url="http://www.nosoftwarepatents.com/"></ulink>. The Wikipedia article <ulink url="http://en.wikipedia.org/wiki/Software_patent"></ulink> also has a lot of useful information on software patents. I've also written a blog post summarizing the arguments against software patents, at <ulink url="http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/"></ulink>.
es: <citetitle>Make Your Open Source Software GPL-Compatible. Or Else.</citetitle> por David A. Wheeler, en <ulink url="http://www.dwheeler.com/essays/gpl-compatible.html"></ulink>.

source: Further Resources
es: Se trata de un completo artículo bien escrito sobre por qué es importante usar una licencia compatible con la GPL incluso cuando no usamos la propia GPL. El artículo también trata otras muchas preguntas acerca de licencias de software, y tiene una gran cantidad de excelentes enlaces.

source: This chapter has only been an introduction to free software licensing issues. Although I hope it contains enough information to get you started on your own open source project, any serious investigation of licensing issues will quickly exhaust what this book can provide. Here is a list of further resources on open source licensing:
es: Creative Commons es una organización que promociona una serie de copyrights más flexibles y liberales que las que la práctica más tradicional del copyright propone. Ofrecen licencias no sólo para software, sino también para textos, arte y música, todas accesibles mediante una selección fácil de usar. Algunas de estas licencias son copyleft, otras no son no-copyleft pero son libres, y otras son simplemente copyright con algunas restricciones relajadas. La página web de Creative Commons proporciona claras instrucciones de sobre qué va. Si tuviera que elegir un sitio para demostrar las implicaciones filosóficas más amplias del movimiento del software libre, sería éste.
