Repository: amaneiro/poss-gl
Catalog: po/*/ch09.po
Languages: es

source: compatibility with proprietary licenses
es: Compatibilidad con licencias propietarias

source: Some free licenses allow the covered code to be used in proprietary programs. This does not affect the licensing terms of the proprietary program: it is still as proprietary as ever, it just happens to contain some code from a non-proprietary source. The Apache License, X Consortium License, BSD-style license, and the MIT-style license are all examples of proprietary-compatible licenses.
es: Algunas licencias libres permiten que el código que cubren se utilice en software propietario. Esto no afecta a los términos de la licencia del software propietario: sigue siendo propietario como siempre, sólo que contiene código de una fuente no propietaria. La Apache License, X Consortium License, licencias estilo BSD, y licencias estilo MIT son ejemplos de licencias compatibles con licencias propietarias.

source: compatibility with other free licenses
es: Compatibilidad con otras licencias libres

source: Most free licenses are compatible with each other, meaning that code under one license can be combined with code under another, and the result distributed under either license without violating the terms of the other. The major exception to this is the GNU General Public License, which requires that any work using GPLed code be itself distributed under the GPL, and without adding any further restrictions beyond what the GPL requires. The GPL is compatible with some free licenses, but not with others. This is discussed in more detail in <xref linkend="license-compatibility"/><phrase output="printed"> later in this chapter</phrase>.
es: Muchas licencias libres son compatibles con las demás, significando que el código bajo una licencia puede combinarse con código bajo otra, y el resultado se distribuye bajo otra licencia sin violar los términos de las otras. La mayor excepción a esto es la GNU General Public License, que requiere que cualquier trabajo que utilice código GPL se distribuya bajo la GPL, y sin añadir ninguna restricción más aparte de las de la GPL. La GPL es compatible con algunas licencias libres, pero no con todas. Esto se trata con más detalle <xref linkend="license-compatibility"/><phrase output="printed">más tarde en este capítulo</phrase>.

source: enforcement of crediting
es: Obligación de acreditación

source: Some free licenses stipulate that any use of the covered code be accompanied by a notice, whose placement and display is usually specified, giving credit to the authors or copyright holders of the code. These licenses are often still proprietary-compatible: they do not necessarily demand that the derivative work be free, merely that credit be given to the free code.
es: Algunas licencias libres estipulan que cualquier uso del código que cubren debe ir acompañado de un aviso, cuya colocación y exhibición se suele especificar, dando crédito a los autores o titulares del copyright del código. Estas licencias son generalmente compatibles con licencias propietarias: no necesariamente requieren que el trabajo derivado sea libre, simplemente que se dé crédito al código libre.

source: protection of trademark
es: Protección de la marca

source: A variant of credit enforcement. Trademark-protecting licenses specify that the name of the original software (or its copyright holders, or their institution, etc.) may <emphasis>not</emphasis> be used by derivative works without prior written permission. Although credit enforcement insists that a certain name be used, and trademark protection insists that it not be used, they are both expressions of the same desire: that the original code's reputation be preserved and transmitted, but not tarnished by association.
es: Una variante de la obligación de acreditación. Las licencias que protegen las marcas especifican que el nombre del software original (o los titulares del copyright, o su institución, etc.) <emphasis>no</emphasis> deben ser utilizados por trabajos derivados sin el permiso previo por escrito. Aunque la obligación de acreditación insiste en que se utilice cierto nombre, y la protección de la marca insiste en que no, son expresiones de un mismo deseo: que la reputación del código original se preserve y transmita, pero no sea empañada por asociación.

source: protection of "artistic integrity"
es: Protección de la "integridad artística"

source: Some licenses (the Artistic License, used for the most popular implementation of the Perl programming language, and Donald Knuth's TeX license, for example) require that modification and redistribution be done in a manner that distinguishes clearly between the pristine original version of the code and any modifications. They permit essentially the same freedoms as other free license, but impose certain requirements that make the integrity of the original code easy to verify. These licenses have not caught on much beyond the specific programs they were made for, and will not be discussed in this chapter; they are mentioned here only for the sake of completeness.
es: Algunas licencias (la Artistic License, usada para la implementación más popular del lenguaje de programación Perl, y la licencia TeX de Donald Knuth, por ejemplo) requieren que la modificación y redistribución se haga de modo que se distinga claramente entre la versión original del código y cualquier modificación. Permiten esencialmente las mismas libertades que las demás licencias libres, pero imponen una serie de requisitos que hacen fácil verificar la integridad del código original. Estas licencias no han despertado mucho interés más allá de los programas para los cuáles se hicieron, y no serán tratadas en este capítulo. Se mencionan aquí sólo con el propósito de exhaustividad.

source: Most of these stipulations are not mutually exclusive, and some licenses include several. The common thread among them is that they place demands on the recipient in exchange for the recipient's right to use and/or redistribute the code. For example, some projects want their name and reputation to be transmitted along with the code, and this is worth imposing the extra burden of a credit or trademark clause; depending on its onerousness, that burden may result in some users choosing a package with a less demanding license.
es: La mayoría de estas disposiciones no son mutuamente excluyentes, y algunas licencias incluyen varias. El hilo común entre ellas es que imponen unas exigencias al beneficiario a cambio del derecho de los destinatarios a usar y/o redistribuir el código. Por ejemplo, algunos proyectos desean que su nombre y reputación se transmita con el código, y esto hace que impongan las claúsulas de crédito o de protección de la marca. Dependiendo de éstas, la carga añadida puede resultar en que algunos usuarios elijan un paquete con una licencia menos exigente.

source: The GPL and License Compatibility
es: La GPL y compatibilidad entre licencias

source: By far the sharpest dividing line in licensing is that between proprietary-incompatible and proprietary-compatible licenses, that is, between the GNU General Public License and everything else. Because the primary goal of the GPL's authors is the promotion of free software, they deliberately crafted the license to make it impossible to mix GPLed code into proprietary programs. Specifically, among the GPL's requirements (see <ulink url="http://www.fsf.org/licensing/licenses/gpl.html"></ulink> for its full text) are these two:
es: De largo la mayor línea divisoria en cuanto a licencias es entre las licencias compatibles y las incompatibles con las licencias propietarias, es decir, entre la GNU General Public License y todas las demás. Debido a que el objetivo primordial de los autores de la GPL es la promoción del software libre, deliberadamente crearon con sumo cuidado la licencia para hacer imposible la mezcla de código GPL en software propietario. Específicamente, entre las claúsulas de la GPL (veáse <ulink url="http://www.fsf.org/licensing/licenses/gpl.html"></ulink> para obtener el texto completo) están estos dos:

source: Any derivative work&mdash;that is, any work containing a nontrivial amount of GPLed code&mdash;must itself be distributed under the GPL.
es: Todo trabajo derivado&mdash;es decir, todo trabajo que contenga una cantidad no trivial de código GPL &mdash;debe ser distribuído bajo la GPL.

source: No additional restrictions may be placed on the redistribution of either the original work or a derivative work. (The exact language is: "You may not impose any further restrictions on the exercise of the rights granted or affirmed under this License.")
es: Ninguna restricción adicional debe ser añadida a la redistribución del trabajo original o de un trabajo derivado (la frase literal es: "Usted no puede imponer ninguna restricción adicional a los beneficiarios en el ejercicio de los derechos otorgados en este documento.").

source: With these conditions, the GPL succeeds in making freedom contagious. Once a program is copyrighted under the GPL, its terms of redistribution are <firstterm>viral</firstterm>&mdash;they are passed on to anything else the code gets incorporated into, making it effectively impossible to use GPLed code in closed-source programs. However, these same clauses also make the GPL incompatible with certain other free licenses. The usual way this happens is that the other license imposes a requirement&mdash;for example, a credit clause requiring the original authors to be mentioned in some way&mdash;that is incompatible with the GPL's "You may not impose any further restrictions..." language. From the point of view of the Free Software Foundation, these second-order consequences are desirable, or at least not regrettable. The GPL not only keeps your software free, but effectively makes your software an agent in pushing <emphasis>other</emphasis> software to enforce freedom as well.
es: Con estas claúsulas, la GPL triunfa al hacer la libertad contagiosa. Una vez que un programa se licencia con la GPL, sus términos de distribución son <firstterm>virales</firstterm> &mdash;se pasan a cualquier sitio donde el código se incorpore, haciendo efectivamente imposible usar código GPL en programas de código cerrado. Sin embargo, estas mismas claúsulas hacen a la GPL incompatible con algunas otras licencias libres. La manera común de que esto ocurra es que la otra licencia impone un requisito &mdash;por ejemplo, una claúsula de crédito requiriendo que se mencione a los autores originales de algún modo&mdash; que es incompatible con el "Ninguna restricción adicional debe ser añadida..." de la GPL. Desde el punto de vista de la Free Software Foundation, estas consecuencias secundarias son deseables o, al menos, no lamentables. La GPL no sólo mantiene el software libre, sino que hace de tu software un agente para impulsar que <emphasis>otro</emphasis> software sea libre también.

source: The question of whether or not this is a good way to promote free software is one of the most persistent holy wars on the Internet (see <xref linkend="holy-wars"/><phrase output="printed"> in <xref linkend="communications"/></phrase>), and we won't investigate it here. What's important for our purposes is that GPL compatibility is an important issue when choosing a license. The GPL is by far the most popular open source license; at <ulink url="http://freshmeat.net/stats/#license"></ulink>, it is at 68%, and the next highest license is at 6%. If you want your code to be able to be mixed freely with GPLed code&mdash;and there's a lot of GPLed code out there&mdash;then you should pick a GPL-compatible license. Most of the GPL-compatible open source licenses are also proprietary-compatible: that is, code under such a license can be used in a GPLed program, and it can be used in a proprietary program. Of course, the <emphasis>results</emphasis> of these mixings would not be compatible with each other, since one would be under the GPL and the other would be under a closed-source license. But that concern applies only to the derivative works, not to the code you distribute in the first place.
es: La cuestión de si éste es o no un buen modo de promover el software libre es una de las guerras santas más persistentes en Internet (veáse <xref linkend="holy-wars"/> <phrase output="printed"> en <xref linkend="communications"/></phrase>), y no la vamos a tratar aquí. Lo que importante para nuestro objetivos es que la compatibilidad con la GPL es un problema importante cuando elegimos una licencia. La GPL es de lejos la licencia de software libre más popular; en <ulink url="http://freshmeat.net/stats/#license"></ulink>, tiene un 68%, y la siguiente en el ranking tiene un 6%. Si quieres que tu código se puede emplear libremente con código GPL &mdash; y hay mucho código GPL ahí fuera &mdash; debes elegir una licencia compatible con la GPL. Algunas de las licencias compatibles con la GPL son también compatibles con software propietario: es decir, código bajo esa licencia puede usarse en un programa GPL, y también en un programa propietario. Por supuesto, los <emphasis>resultados</emphasis> de estas mezclas no serán compatibles con la otra, ya que una estará bajo la GPL y otra estará bajo una licencia de código cerrado. Pero esa preocupación se aplica únicamente a las obras derivadas, y no al código que se distribuya en primer lugar.

source: Fortunately, the Free Software Foundation maintains a list showing which licenses are compatible with the GPL and which are not, at <ulink url="http://www.gnu.org/licenses/license-list.html"></ulink>. All of the licenses discussed in this chapter are present on that list, on one side or the other.
es: Afortunadamente, la Free Software Foundation mantiene una lista que muestra qué licencias son compatibles con la GPL y cuáles no, en <ulink url="http://www.gnu.org/licenses/license-list.html"></ulink>. Todas las licencias tratadas en este capítulo están presentes en esa lista, en un lado u en otro.

source: Choosing a License
es: Eligiendo una licencia

source: When choosing a license to apply to your project, if at all possible use an existing license instead of making up a new one. There are two reasons why existing licenses are better:
es: Cuando eliges una licencia para aplicarla a tu proyecto, si es posible usa una licencia existente en vez de crear una nueva. Hay dos razones por la que licencias existentes son una mejor opción:

source: Familiarity. If you use one of the three or four most popular licenses, people won't feel they have to read the legalese in order to use your code, because they'll have already done so for that license a long time ago.
es: Familiaridad. Si utilizas una de las tres o cuatro licencias más populares, la gente no sentirá que debe leer textos legales para utilizar tu código, porque ya lo habrán hecho para esa licencia hace tiempo.

source: Quality. Unless you have a team of lawyers at your disposal, you are unlikely to come up with a legally solid license. The licenses mentioned here are the products of much thought and experience; unless your project has truly unusual needs, it is unlikely you would do better.
es: Calidad. A menos que tengas un equipo de abogados a tu disposición, seguramente no consigas una licencia sólida legalmente. Las licencias mencionadas aquí son producto de mucho trabajo y experiencia. A menos que tu proyecto tenga necesidades poco comunes, es poco probable que lo hagas mejor.

source: To apply one of these licenses to your project, see <xref linkend="license-quickstart-applying"/><phrase output="printed"> in <xref linkend="getting-started"/></phrase>.
es: Para aplicar una de estas licencias a tu proyecto, lee <xref linkend="license-quickstart-applying"/><phrase output="printed"> en <xref linkend="getting-started"/></phrase>.

source: The MIT / X Window System License
es: La MIT / X Window System License

source: If your goal is that your code be accessible by the greatest possible number of developers and derivative works, and you do not mind the code being used in proprietary programs, choose the MIT / X Window System license (so named because it is the license under which the Massachusetts Institute of Technology released the original X Window System code). This license's basic message is "You are free to use this code however you want." It is compatible with the GNU GPL, and it is short, simple, and easy to understand:
es: Si tu objetivo es que tu código sea accesible para el mayor número de desarrolladores y trabajos derivados posible, y no te importa que el código se pueda utilizar en software propietario, elije la MIT / X Window System license (llamada así debido a que es la licencia bajo la cual el Massachusetts Institute of Technology lanzó el código original del sistema de ventanas X). El mensaje básico de esta licencia es "Eres libre para usar este código como quieras.". Es compatible con la GNU GPL, y es corta, sencilla, y fácil de entender:

source: (Taken from <ulink url="http://www.opensource.org/licenses/mit-license.php"></ulink>.)
es: (Tomada de <ulink url="http://www.opensource.org/licenses/mit-license.php"></ulink>.)

source: The GNU General Public License
es: La GNU General Public License

source: If you prefer that your project's code not be used in proprietary programs, or if you at least don't care whether or not it can be used in proprietary programs, choose the GNU General Public License (<ulink url="http://www.fsf.org/licensing/licenses/gpl.html"></ulink>). The GPL is probably the most widely-used free software license in the world today; this instant recognizability is itself one of the GPL's major advantages.
es: Si prefieres que tu código no sea utilizado en software propietario, o si, al menos, no te importa si puede o no usarse en éstos, elije la GNU General Public License (<ulink url="http://www.fsf.org/licensing/licenses/gpl.html"></ulink>). La GPL es probablemente la licencia de software libre más utilizada en el mundo a día de hoy; este capacidad de reconocerse en ella es una de las mayores ventajas de la GPL.

source: When writing a code library that is meant mainly to be used as part of other programs, consider carefully whether the restrictions imposed by the GPL are in line with your project's goals. In some cases&mdash;for example, when you're trying to unseat a competing, proprietary library that does the same thing&mdash;it may make more strategic sense to license your code in such a way that it can be mixed into proprietary programs, even though you would otherwise not wish this. The Free Software Foundation even fashioned an alternative to the GPL for such circumstances: the <firstterm>GNU Library GPL</firstterm>, later renamed to the <firstterm>GNU Lesser GPL</firstterm> (most people just use the acronym <firstterm>LGPL</firstterm>, in any case). The LGPL has looser restrictions than the GPL, and can be mixed more easily with non-free code. However, it's also a bit complex and takes some time to understand, so if you're not going to use the GPL, I recommend just using the MIT/X-style license.
es: Cuando programamos una biblioteca cuyo fin es ser usada en otros programas, considera detenidamente si las restricciones que la GPL impone concuerdan con los objetivos de tu proyecto. En algunos casos &mdash; por ejemplo, si intentas desbancar una biblioteca propietaria competidora que realiza la misma función &mdash; tiene un sentido más estratégico el licenciar tu código de modo que pueda ser utilizada en software propietario, incluso aunque no lo desearas. La Free Software Foundation preparó una alternativa a la GPL para esas circunstancias: la <firstterm>GNU Library GPL</firstterm>, después renombrada como <firstterm>GNU Lesser GPL</firstterm> (la mayoría de la gente utiliza directamente el acrónimo <firstterm>LGPL</firstterm>, de todos modos). La LGPL tiene restricciones menos estrictas que la GPL, y puede mezclarse más fácilmente con código no libre. Sin embargo, también es más compleja y toma más tiempo entenderla, por lo que si no vas a utilizar la GPL, te recomiendo utilizar una licencia tipo MIT/X.

source: The GNU Affero GPL: A Version of the GNU GPL for Server-Side Code
es: ¿Es la GPL libre o no?

source: In 2007, the Free Software Foundation released a variant of the GPL called the <firstterm>GNU Affero GPL</firstterm> (<ulink url="http://www.fsf.org/licensing/licenses/agpl.html"></ulink>)<footnote><para> The history of the license and its name is a bit complicated. The first version of the license was originally released by Affero, Inc, who based it on the GNU GPL version 2. This was commonly referred to as the AGPL. Later, the Free Software Foundation decided to adopt the idea, but by then they had released version 3 of their GNU GPL, so they based their new Affero-ized license on that and called it the "GNU AGPL". The old Affero license is more or less deprecated now. If you want Affero-like provisions, you should use the GNU version. To avoid ambiguity, call it the "AGPLv3", the "GNU AGPL", or for maximum precision, "GNU AGPLv3".</para></footnote>. Its purpose is to enforce GPL-like sharing provisions on the growing number of companies that offered hosted services&mdash;software that runs on their servers, that users interact with only over the network, and that therefore is never directly distributed to users as executable or source code. Many such services had been using GPL'd software, often with modifications, yet didn't have to share their changes with the world because they weren't distributing any code.
es: Una consecuencia de elegir la GPL es la posibilidad &mdash;pequeña, pero no infinitesimal&mdash; de encontrarte a ti o a tu proyecto envueltos en una disputa acerca de si la GPL es o no realmente libre, dado que exige ciertas restricciones en qué puedes hacer con el código&mdash;a saber, la restricción de que el código no puede ser redistribuído bajo ninguna otra licencia. Para algunos, la existencia de esta restricción significa que la GPL es "menos libre" que otras licencias más permisivas como la licencia MIT/X. El fin de este argumento generalmente es, por supuesto, que dado que "más libre" debe ser mejor que "menos libre" (después de todo, ¿quién no está a favor de la libertad?), esas licencias son mejores que la GPL.

source: The GNU AGPLv3's solution to this was to take the regular GPL and add a "Remote Network Interaction" clause, stating "<emphasis>...if you modify the Program, your modified version must prominently offer all users interacting with it remotely through a computer network ... an opportunity to receive the Corresponding Source of your version ... at no charge, through some standard or customary means of facilitating copying of software.</emphasis>" This expanded the GPL's enforcement powers into the new world of application service providers. The Free Software Foundation recommends that the GNU AGPLv3 be used for any software that will commonly be run over a network.
es: Este debate es otra guerra santa (veáse <xref linkend="holy-wars"/><phrase output="printed"> en <xref linkend="communications"/></phrase>) muy popular. Evita participar en ella, al menos en foros del proyecto. No intentes probar que la GPL es menos libre, tan libre o más libre que otras licencias. En vez de eso, explica las razones específicas por las que elegiste la GPL para tu proyecto. Si fue el conocimiento de la licencia, di eso. Si también fue por las restricciones de licencia libre para trabajos derivados, dilo también, pero niégate a discutir acerca de si esto hace al código más o menos libre. La libertad es un tema complejo, y no tiene mucho sentido hablar de ella si la terminología que va a ser utilizada como alimento para un caballo de acecho.
