Repository: amaneiro/poss-gl
Catalog: po/*/ch09.po
Languages: es

source: Note that the AGPLv3 is not directly compatible with GPLv2 (though it is compatible with GPLv3, of course). However, most software licensed under the GPLv2 includes the "or any later version" clause anyway, so you can just shift it to GPLv3 if and when you need to mix it with AGPLv3 code. However, if you need to mix with programs licensed strictly under the GPLv2 (that is, without the "or any later version" clause), then the AGPLv3 won't work.
es: Dado que esto es un libro y no un hilo de una lista de correo, sin embargo, admitiré que nunca entendí el argumento "la GPL no es libre". La única restricción que la GPL impone previene a la gente de imponer <emphasis>mayores</emphasis> restricciones. Decir que eso significa tener menos libertad siempre me ha parecido como decir que la abolición de la esclavitud reduce la libertad, porque previene que cierta gente posea esclavos.

source: Although the history of the AGPLv3 is a bit complicated, the license itself is simple: it's just the GPLv3 with one extra clause about network interaction. The Wikipedia article on the AGPLv3 is excellent: <ulink url="http://en.wikipedia.org/wiki/Affero_General_Public_License"></ulink>
es: (Oh, y si te ves inmerso en un debate sobre ello, no subas la apuesta haciendo analogías incendiarias.)

source: Is the GPL free or not free?
es: ¿Qué tal la licencia BSD?

source: One consequence of choosing the GPL is the possibility&mdash;small, but not infinitely small&mdash;of finding yourself or your project embroiled in a dispute about whether or not the GPL is truly "free", given that it places some restrictions on what you can do with the code&mdash;namely, the restriction that the code cannot be distributed under any other license. For some people, the existence of this restriction means the GPL is "less free" than more permissive licenses such as the MIT/X license. Where this argument usually goes, of course, is that since "more free" must be better than "less free" (after all, who's not in favor of freedom?), it follows that those licenses are better than the GPL.
es: Una gran cantidad de software libre se distribuye bajo la <firstterm>licencia BSD</firstterm> (o algunas veces una <firstterm>licencia estilo BSD</firstterm>). La licencia original BSD fue usada por la Berkeley Software Distribution, en la que la Universidad de California lanzó partes importantes de una implementación de Unix. Esta licencia (el texto exacto puede verse en la sección 2.2.2 de <ulink url="http://www.xfree86.org/3.3.6/COPYRIGHT2.html#6"></ulink>) era similar en esencia a la licencia MIT/X, excepto por una claúsula:

source: This debate is another popular holy war (see <xref linkend="holy-wars"/><phrase output="printed"> in <xref linkend="communications"/></phrase>). Avoid participating in it, at least in project forums. Don't attempt to prove that the GPL is less free, as free, or more free than other licenses. Instead, emphasize the specific reasons your project chose the GPL. If the recognizability of license was a reason, say that. If the enforcement of a free license on derivative works was also a reason, say that too, but refuse to be drawn into discussion about whether this makes the code more or less "free". Freedom is a complex topic, and there is little point talking about it if terminology is going to be used as a stalking horse for substance.
es: <blockquote> <para><emphasis>Todo material publicitado que mencione características o use este software debe mostrar la siguiente advertencia: "Este producto contiene software desarrollado por la Universidad de California, Lawrence Berkeley Laboratory. </emphasis></para> </blockquote> <para>La presencia de esta claúsula no sólo hace a la BSD incompatible con la GPL, sino que también sienta un peligroso precedente: mientras otras organizaciones pongan claúsulas publicitarias similares en <emphasis>su</emphasis> software libre &mdash;sustituyendo su propio nombre en lugar de "la Universidad de California, Lawrence Berkeley Laboratory"&mdash; los redistribuidores del software se enfrentan a una creciente carga en cuanto a lo que se ven requeridos a mostrar. Afortunadamente, muchos de los proyectos que usaron esta licencia se percataron del problema, y simplemente eliminaron esa claúsula. En 1999, incluso la Universidad de California lo hizo.</para> <para>El resultado es la licencia BSD revisada, que es simplemente la licencia BSD original sin la claúsula publicitaria. Sin embargo, la historia hace a la expresión "licencia BSD" un poco ambigua: ¿se refiere a la original, o a la versión revisada? Por esto es por lo que prefiero la licencia MIT/X, que es equivalente en esencia, y no sufre ninguna ambigüedad. Sin embargo, quizá hay una razón para preferir la BSD revisada frente a la licencia MIT/X, que es que la BSD incluye esta claúsula: </para> <blockquote> <para><emphasis>Ni el nombre de la &lt;ORGANIZACIÓN&gt; ni los nombres de sus contribuyentes debe usarse para apoyar o promocionar productos derivados de este software sin permiso previo por escrito explícito.</emphasis></para> </blockquote>

source: Since this is a book and not a mailing list thread, however, I will admit that I've never understood the "GPL is not free" argument. The only restriction the GPL imposes is that it prevents people from imposing <emphasis>further</emphasis> restrictions. To say that this results in less freedom has always seemed to me like saying that outlawing slavery reduces freedom, because it prevents some people from owning slaves.
es: No queda claro que sin esa claúsula, un receptor del software podría tener el derecho a usar el nombre del autor, pero esa claúsula borra cualquier tipo de duda. Para organizaciones preocupadas por el control de marcas registradas, por lo tanto, la licencia BSD puede ser preferible a la MIT/X. En general, sin embargo, una licencia de copyright liberal no implica que los receptores tengan ningún derecho a usar sus marcas &mdash; las leyes de copyright y las leyes de marcas son dos cosas diferentes.

source: (Oh, and if you do get drawn into a debate about it, don't raise the stakes by making inflammatory analogies.)
es: Si quieres utilizar la licencia BSD revisada, una plantilla está disponible en <ulink url="http://www.opensource.org/licenses/bsd-license.php"></ulink>.

source: What About The BSD License?
es: Asignación y propiedad del Copyright

source: A fair amount of open source software is distributed under a <firstterm>BSD license</firstterm> (or sometimes a <firstterm>BSD-style license</firstterm>). The original BSD license was used for the Berkeley Software Distribution, in which the University of California released important portions of a Unix implementation. This license (the exact text may be seen in section 2.2.2 of <ulink url="http://www.xfree86.org/3.3.6/COPYRIGHT2.html#6"></ulink>) was similar in spirit to the MIT/X license, except for one clause:
es: Hay tres maneras de gestionar la propiedad del copyrighy en el software libre contribuído por mucha gente. La primera es ignorar totalmente el asunto del copyright (no recomiendo esta). La segunda es recoger un <firstterm>acuerdo del contribuyente a la licencia</firstterm>(<firstterm>CLA</firstterm>, de las iniciales de <emphasis>contributor license agreement</emphasis>) de cada persona que trabaja en el proyecto, garantizando explícitamente al proyecto el derecho de usar el código de esa persona. Generalmente esto es suficiente para la mayoría de proyectos, y algo positivo está en que en algunas jurisdicciones, los CLAs pueden ser enviados por correo electrónico. El tercer modo es obtener asignaciones de propiedad del copyright de parte de los contribuyentes, de modo que el proyecto (por ejemplo, alguna entidad legal, generalmente sin ánimo de lucro) es la propietaria de todo el copyright. Esta es la manera más hermética legalmente, pero es también la más onerosa para los contribuyentes, sólo algunos proyectos insisten en ella.

source: <blockquote> <para><emphasis>All advertising materials mentioning features or use of this software must display the following acknowledgement: This product includes software developed by the University of California, Lawrence Berkeley Laboratory.</emphasis></para> </blockquote> <para>The presence of that clause not only made the original BSD license GPL-incompatible, it also set a dangerous precedent: as other organizations put similar advertising clauses into <emphasis>their</emphasis> free software&mdash;substituting their own organization's name in place of "the University of California, Lawrence Berkeley Laboratory"&mdash;software redistributors faced an ever-increasing burden in what they were required to display. Fortunately, many of the projects that used this license became aware of the problem, and simply dropped the advertising clause. In 1999, even the University of California did so.</para> <para>The result is the revised BSD license, which is simply the original BSD license with the advertising clause removed. However, this history makes the phrase "BSD license" a bit ambiguous: does it refer to the original, or the revised version? This is why I prefer the MIT/X license, which is essentially equivalent, and which does not suffer from any ambiguity. However, there is perhaps one reason to prefer the revised BSD license to the MIT/X license, which is that the BSD includes this clause:</para> <blockquote> <para><emphasis>Neither the name of the &lt;ORGANIZATION&gt; nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.</emphasis></para> </blockquote>
es: Nótese que incluso bajo la propiedad centralizada del copyright, el código permanece libre, porque las licencias de software libre no dan al propietario del copyrifht el derecho a apropiarse retroactivamente de todas las copias del código. Por lo tanto, incluso si el proyecto, como entidad jurídica, de repente decide cambiar y empezar a distribuir el código bajo una licencia restrictiva, eso no causaría un problema a la comunidad. Los otros desarrolladores podrían simplemente comenzar un fork basado en la última copia libre del código, y continuar como si nada hubiera pasado. Debido a que saben que pueden hacer eso, muchos contribuyentes cooperan cuando se les pide firmar un CLA o asignar el copyright.

source: It's not clear that without such a clause, a recipient of the software would have had the right to use the licensor's name anyway, but the clause removes any possible doubt. For organizations worried about trademark control, therefore, the revised BSD license may be slightly preferable to MIT/X. In general, however, a liberal copyright license does not imply that recipients have any right to use or dilute your trademarks &mdash; copyright law and trademark law are two different beasts.
es: No hacer nada

source: If you wish to use the revised BSD license, a template is available at <ulink url="http://www.opensource.org/licenses/bsd-license.php"></ulink>.
es: Algunos proyectos nunca recogen CLAs o asignaciones de copyright de sus contribuyentes. En lugar de eso, aceptan el código siempre que quede razonablemente claro que el contribuyente pretendía que fuera incluído en el proyecto.

source: Copyright Assignment and Ownership
es: Bajo circunstancias normales, eso es suficiente. Pero de vez en cuando alguien puede decidir demandar por infringimiento del copyright, alegando que ellos son los verdaderos propietarios del código en cuestión y que nunca accedieron a que fuera distribuído por el proyecto bajo una licencia libre. Por ejemplo, el Grupo SCO hizo algo como esto con el proyecto Linux, veáse <ulink url="http://en.wikipedia.org/wiki/SCO-Linux_controversies"></ulink> para más detalles. Cuando esto ocurre, el proyecto no tiene documentación que demuestre que el contribuyente formalmente ha garantizado el derecho a utilizar el código, que puede hacer la defensa legal más complicada.

source: There are three ways to handle copyright ownership for free code and documentation that were contributed to by many people. The first is to ignore the issue of copyright entirely (I don't recommend this). The second is to collect a <firstterm>contributor license agreement</firstterm> (<firstterm>CLA</firstterm>) from each person who works on the project, explicitly granting the project the right to use that person's contributions. This is usually enough for most projects, and the nice thing is that in some jurisdictions, CLAs can be sent in by email. The third way is to get actual copyright assignments from contributors, so that the project (i.e., some legal entity, usually a nonprofit) is the copyright owner for everything. This is the most legally airtight way, but it's also the most burdensome for contributors; only a few projects insist on it.
es: Contributor License Agreements

source: Also, actual copyright transferral is subject to national law, and licenses designed for the United States may encounter problems elsewhere (e.g., in Germany, where it's apparently not possible to transfer copyright).
es: Los CLAs probablemente ofrecen el mejor compromiso entre seguridad y conveniencia.Un CLA es habitualmente un formulario electrónico que un desarrollador rellena y envía al proyecto. En muchas jurisdicciones, el envío por correo electrónico es suficiente. Una firma digital segura puede o no ser requerida; consulta a un abogado para encontrar que método encaja mejor con tu proyecto.

source: Note that even under centralized copyright ownership, the code<footnote><para>I'll use "code" to refer to both code and documentation, from now on.</para></footnote> remains free, because open source licenses do not give the copyright holder the right to retroactively proprietize all copies of the code. So even if the project, as a legal entity, were to suddenly turn around and started distributing all the code under a restrictive license, that wouldn't cause a problem for the public community. The other developers would simply start a fork based on the latest free copy of the code, and continue as if nothing had happened. Because they know they can do this, most contributors cooperate when asked to sign a CLA or an assignment of copyright.
es: Muchos proyectos usan dos CLAs ligeramente diferentes, uno para individuos, y otra para contribuyentes corporativos. Pero en ambos casos, el mensaje es el mismo: el contribuyente garantiza al proyecto el derecho <emphasis>"perpetuo, mundial, no exclusivo, sin cargo, libre royalties por derechos de autor, licencia de copyright irrevocable para reproducir, hacer trabajos derivados, mostrar públicamente, ejecución pública, sublicenciar, y distribuir las contribuciones y los trabajos derivados."</emphasis> De nuevo, deberías tener un abogado para aprobar cualquier CLA, pero si introduces todos estos adjetivos en él, probablemente esté bien.

source: Doing Nothing
es: Cuando solicites CLAs a los contribuyentes, asegúrate de remarcar que <emphasis>no</emphasis> estás solicitando transferencia de copyright. De hecho, muchos CLAs empiezan recordando esto al lector:

source: Most projects never collect CLAs or copyright assignments from their contributors. Instead, they accept code whenever it seems reasonably clear that the contributor intended it to be incorporated into the project.
es: Esto sólo es un acuerdo de licencia: no transfiere la propiedad intelectual y no cambia tus derechos a usar tus propias contribuciones para cualquier otro propósito.

source: Under normal circumstances, this is okay. But every now and then, someone may decide to sue for copyright infringement, alleging that they are the true owner of the code in question and that they never agreed to its being distributed by the project under an open source license. For example, the SCO Group did something like this to the Linux project, see <ulink url="http://en.wikipedia.org/wiki/SCO-Linux_controversies"></ulink> for details. When this happens, the project will have no documentation showing that the contributor formally granted the right to use the code, which could make some legal defenses more difficult.
es: Aquí hay algunos ejemplos:

source: Contributor License Agreements
es: CLAs para individuales:

source: CLAs probably offer the best tradeoff between safety and convenience. A CLA is typically an electronic form that a developer fills out and sends in to the project. In many jurisdictions, email submission is enough. A secure digital signature may or may not be required; consult a lawyer to find out what method would be best for your project.
es: CLAs para corporaciones:

source: Most projects use two slightly different CLAs, one for individuals, and one for corporate contributors. But in both types, the core language is the same: the contributor grants the project <emphasis>"...perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable copyright license to reproduce, prepare derivative works of, publicly display, publicly perform, sublicense, and distribute [the] Contributions and such derivative works."</emphasis> Again, you should have a lawyer approve any CLA, but if you get all those adjectives into it, you're probably fine.
es: Transferencia de Copyright

source: When you request CLAs from contributors, make sure to emphasize that you are <emphasis>not</emphasis> asking for actual copyright assignment. In fact, many CLAs start out by reminding the reader of this:
es: La transferencia de Copyright significa que el contribuyente asigna al proyecto la propiedad intelectual en sus contribuciones. Idealmente, se realiza sobre papel y envíado mediante fax o correo postal al proyecto.

source: This is a license agreement only; it does not transfer copyright ownership and does not change your rights to use your own Contributions for any other purpose.
es: Algunos proyectos insisten en la transferencia total porque que una sola entidad legal posea el copyright de todo el código puede ser útil si alguna vez los términos de la licencia de código abierto deben hacerse valer en un tribunal. Si no existe una entidad única que tenga el derecho de hacerlo, todos los contribuyentes deberían cooperar, pero algunos podrían no tener tiempo o no poder ser contactados cuando el problema surja.

source: Here are some examples:
es: Distintas organizaciones aplican diferentes cantidades de rigor en la tarea de recolectar asignaciones. Algunas simplemente solicitan un manifiesto informal del contribuyente en una lista de correo pública &mdash; algo en la línea de "Por la presente otorgo los derechos de autor en este código al proyecto, con arreglo a las mismas condiciones que el resto del código". Algún abogado de aquellos con los que he hablado dice que es suficiente, presumiblemente porque ocurre en un contexto en el que la asignación de los derechos de autor es habitual y esperada, y porque representa un esfuerzo de buena fé por parte del proyecto para determinar las verdaderas intenciones del desarrollador. Por otro lado, la Free Software Foundation va al otro extremo: solicitan a los contribuyentes a firmar físicamente y enviar por correo postal un documento con un manifiesto formal de asignación de copyright, algunas veces sólo por la contribución en cuestión, otras por la presente y futuras contribuciones. Si el desarrollador está empleado, la FSF solicita al empleador que lo firme también.

source: Individual contributor CLAs:
es: La paranoia de la FSF es comprensible. Si alguien viola los términos de la GPL incorporando parte de su software en software propietario, la FSG necesitará demandar en un juzgado, y querrán que sus derechos de autor sean lo más herméticos posible cuando esto suceda. Dado que la FSF es titular de los derechos de autor de gran cantidad de software muy popular, esto se ve como una posibilidad real. Si tú organización necesita ser igualmente escrupulosa es algo que sólo tú puedes decidir, en consulta con los abogados. En general, a menos que exista alguna razón específica para que tu proyecto requiera asignación de todos los derechos de autor, utiliza los CLAs: son más cómodos para todo el mundo.

source: Corporate contributor CLAs:
es: Concesión de licencias dual

source: Transfer of Copyright
es: Algunos proyectos intentan financiarse mediante el uso de concesiones de licencia duales, en los cuáles trabajos propietarios derivados deben pagar al propietario de los derechos para utilizar el código, mientras sigue siendo libre para el uso en otros proyectos libres. Esto tiende a funcionar mejor con bibliotecas más que con aplicaciones, naturalmente. Los términos exactos varían en cada caso. Comúnmente, la licencia para la parte libre es la GNU GPL, dado que ya previene que otros incorporen su código en productos propietarios sin permiso del titular de la propiedad intelectual, pero algunas veces es una licencia personalizada para el mismo efecto. Un ejemplo del primero es la licencia de MySQL, descrita en <ulink url="http://www.mysql.com/company/legal/licensing/"></ulink>; un ejemplo del segundo caso es la estrategia de licenciamiento de Sleepycat Software's, descrita en <ulink url="http://www.sleepycat.com/download/licensinginfo.shtml"></ulink>.

source: Copyright transfer means that the contributor assigns to the project copyright ownership on her contributions. Ideally, this is done on paper and either faxed or snail-mailed to the project.
es: Te debes estar preguntando: ¿cómo puede el propietario de los derechos ofrecer licencias propietarias a cambio de un pago obligatorio si los términos de la GNU GPL estipulan que el código debe estar disponible bajo términos menos restrictivos? La respuesta es que los términos de la GPL son algo que el dueño de los derechos impone al resto: es por tanto libre de decidir <emphasis>no</emphasis> aplicarse esos términos a sí mismo. Una buena manera de pensar acerca de ello es imaginar que el propietario tiene un infinito número de copias del software guardadas en un cubo. Cada vez que saca una copia del cubo para mandarla al mundo, puede decidir que licencia ponerle: GPL, propietaria, o cualquier otra. Su derecho a hacerlo no está restringido por la GPL u otra licencia de software libre: es simplemente un poder garantizado por las leyes de derechos de autor.

source: Some projects insist on full assignment because having a single legal entity own the copyright on the entire code base can be useful if the terms of the open source license ever need to be enforced in court. If no single entity has the right to do it, all the contributors might have to cooperate, but some might not have time or even be reachable when the issue arises.
es: El atractivo de las licencias duales es que, en el mejor de los casos, provee un modo de obtener una fuente de ingresos fiable para un proyecto libre. Desafortunadamente, también interfiere con la dinámica normal de los proyectos de software libre. El problema es que cualquier voluntario que haga una contribución está ahora contribuyendo a dos entidades distintas: la versión libre del código y la versión propietaria. Mientras un contribuyente puede estar cómodo contribuyendo a la versión libre, dado que es la norma en proyectos libres, puede sentirse incómodo al contribuir a la fuente de ingresos semipropietaria de otro. La incomodidad se agrava por el hecho de que el propietario de los derechos necesita realmente recoger un asignamiento formal y firmado de todos los contribuyentes, con el fin de protegerse de un contribuyente descontento que en el futuro reclame su porcentaje de los ingresos. El proceso de recolectar esos acuerdos significa que los contribuyentes se enfrentan al duro hecho de que están haciendo un trabajo que proporciona beneficios económicos para otro.
