Repository: amaneiro/poss-gl
Catalog: po/*/ch09.po
Languages: es

source: Licenses, Copyrights, and Patents
es: Licencias, Copyrights y Patentes

source: The license you select probably won't have a major impact on the adoption of your project, as long as the license is open source. Users generally choose software based on quality and features, not on the details of the license. Nevertheless, you still need a basic understanding of free software licensing issues, both to ensure that the project's license is compatible with its goals, and to be able to discuss licensing decisions with other people. Please note, however, that I am not a lawyer, and that nothing in this chapter should be construed as formal legal advice. For that, you'll need to hire a lawyer or be one.
es: La licencia que elijas probablemente no tendrá un gran impacto en la adopción de tu proyecto, siempre que sea software libre. Los usuarios generalmente eligen software basándose en la calidad y las funcionalidades, no en los detalles de la licencia. No obstante, necesitas una comprensión básica de las implicaciones de las licencias libres, tanto para asegurar que la licencia del proyecto es compatible con sus objetivos, como para discutir sobre las decisiones acerca de la licencia con otros. Por favor, ten en cuenta que no soy abogado, y nada contenido en este capítulo debe ser tenido en cuenta como advertencia legal. Para ello, necesitarás contratar un abogado o serlo.

source: Terminology
es: Terminología

source: In any discussion of open source licensing, the first thing that becomes apparent is that there seem to be many different words for the same thing: <firstterm>free&nbsp;software</firstterm>, <firstterm>open&nbsp;source</firstterm>, <firstterm>FOSS</firstterm>, <firstterm>F/OSS</firstterm>, and <firstterm>FLOSS</firstterm>. Let's start by sorting those out, along with a few other terms.
es: En cualquier discusión acerca de las licencias de software libre, lo primero que encuentras es que parece que hay diferentes nomenclaturas para los mismos conceptos: <firstterm>software libre (free&nbsp;software)</firstterm>, <firstterm>software de fuentes abiertas (open&nbsp;source)</firstterm>, <firstterm>FOSS</firstterm>, <firstterm>F/OSS</firstterm>, y <firstterm>FLOSS</firstterm>. Empecemos por ordenar estos términos, además de algunos otros.

source: free software
es: Software libre (free software)

source: Software that can be freely shared and modified, including in source code form. The term was first coined by Richard Stallman, who codified it in the GNU General Public License (GPL), and who founded the Free Software Foundation (<ulink url="http://www.fsf.org/"></ulink>) to promote the concept.
es: Software que puede ser compartido y modificado con libertad, incluyendo el código fuente. El término fue acuñado por Richard Stallman, quien lo utilizó en la GNU General Public License (GPL), y quien fundó la Free Software Foundation (<ulink url="http://www.fsf.org/"></ulink>) para promocionar el concepto.

source: Although "free software" covers almost exactly the same range of software as "open source", the FSF, among others, prefers the former term because it emphasizes the idea of freedom, and the concept of freely redistributable software as primarily a social movement rather than a technical one. The FSF acknowledges that the term is ambiguous&mdash;it could mean "free" as in "zero-cost", instead of "free" as in "freedom"&mdash;but feels that it's still the best term, all things considered, and that the other possibilities in English have their own ambiguities. (Throughout this book, "free" is used in the "freedom" sense, not the "zero-cost" sense.)
es: Aunque "software libre" cubre casi exactamente el mismo software que "software de fuentes abiertas", la FSF, entre otros, prefiere el término anterior porque hace hincapié en la idea de libertad, y el concepto de libre distribución del software principalmente como un movimiento social y no técnico. La FSF admite que el término es ambiguo&mdash;puede significar "free" como "de coste cero", en lugar de "free" como "libertad"&mdash; pero considera que aún es el mejor término, y que las otras alternativas en inglés tienen sus propias ambigüedades (a lo largo de este libro, "free" se utiliza con el sentido de libertad, y no con el concepto de gratuito).

source: open source software
es: Software de fuentes abiertas (open source)

source: Free software under another name. But the different name reflects an important philosophical difference: "open source" was coined by the Open Source Initiative (<ulink url="http://www.opensource.org/"></ulink>) as a deliberate alternative to "free software," in order to make such software a more palatable choice for corporations, by presenting it as a development methodology rather than a political movement. They may also have wanted to overcome another stigma: that anything "free" must be low quality.
es: Software libre bajo otro nombre. Pero la diferencia en el nombre refleja una importante diferencia filosófica: "open source" fue acuñado por la Open Source Initiative (<ulink url="http://www.opensource.org/"></ulink>) como una alternativa deliberada a "free software", con el fin de hacer este tipo de software una opción más apetecible para empresas, mediante su presentación como una metodología de desarrollo en vez de un movimiento político. También podrían haber querido sobreponerse a otro estigma: lo "gratuíto" es de baja calidad.

source: While any license that is free is also open source, and vice versa (with a few minor exceptions), people tend to pick one term and stick with it. In general, those who prefer "free software" are more likely to have a philosophical or moral stance on the issue, while those who prefer "open source" either don't view it as a matter of freedom, or are not interested in advertising the fact that they do. See <xref linkend="free-vs-open-source"/><phrase output="printed"> in <xref linkend="introduction"/></phrase> for a more detailed history of this schism.
es: Mientras que cualquier licencia que sea "free software" es también "open source", y viceversa (con unas pocas excepciones), la gente tiende a elegir un término y aferrarse a él. En general, aquellos que prefieren "software libre" suelen tener una postura más filosófica o moral sobre el tema, mientras que los que prefieren "open source" o no lo ven como un asunto de libertad, o no están interesados en publicitar el hecho de ese modo. Veáse <xref linkend="free-vs-open-source"/><phrase output="printed"> en <xref linkend="introduction"/></phrase> para una historia más detallada de este cisma.

source: The Free Software Foundation has an excellent&mdash;utterly unobjective, but nuanced and quite fair&mdash;exegesis of the two terms, at <ulink url="http://www.fsf.org/licensing/essays/free-software-for-freedom.html"></ulink>. The Open Source Initiative's take on it is (or was, in 2002) spread across two pages: <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/case_for_hackers.php#marketing"></ulink> and <ulink url="http://web.archive.org/web/20021204155022/http://www.opensource.org/advocacy/free-notfree.php"></ulink>.
es: La Free Software Foundation tiene una excelente &mdash;carente de objetividad, pero con matices y muy justa &mdash;exégesis de los dos términos, en <ulink url="http://www.fsf.org/licensing/essays/free-software-for-freedom.html"></ulink>. La visión de la Open Source Initiative al respecto está en dos páginas: <ulink url="http://www.opensource.org/advocacy/case_for_hackers.php#marketing"></ulink> y <ulink url="http://www.opensource.org/advocacy/free-notfree.php"></ulink>.

source: Where there are two of anything, there will soon be three, and that is exactly what is happening with terms for free software. The academic world, perhaps wanting precision and inclusiveness over elegance, seems to have settled on FOSS, or sometimes F/OSS, standing for "Free / Open Source Software". Another variant gaining momentum is FLOSS, which stands for "Free / Libre Open Source Software" (<foreignphrase>libre</foreignphrase> is familiar in many languages and does not suffer from the ambiguities of "free"; see <ulink url="http://en.wikipedia.org/wiki/FLOSS"></ulink> for more).
es: Donde caben dos, caben tres, y eso es exactamente lo que está ocurriendo con los términos para el software libre. El mundo académico, quizá buscando precisión e incluso por encima de la elegancia, parece haber establecido FOSS, o a veces F/OSS, significando "Free / Open Source Software". Otra variantes ganando adeptos es FLOSS, que quiere decir "Free / Libre Open Source Software" (<emphasis>libre</emphasis> es común en varios idiomas y no sufre de la ambigüedad de <foreignphrase>free</foreignphrase>; veáse <ulink url="http://en.wikipedia.org/wiki/FLOSS"></ulink> para más detalles).

source: All these terms mean essentially the same thing: software that can be modified and redistributed by everyone, sometimes&mdash;but not always&mdash;with the requirement that derivative works be freely redistributable under the same terms.
es: Todos estos términos significan esencialmente lo mismo: software que puede ser modificado y redistribuido por cualquiera, algunas veces&mdash;pero no siempre&mdash; con el requisito de que los trabajos derivados puedan ser distribuidos libremente bajo los mismos términos.

source: DFSG-compliant
es: Conforme con las DFSG

source: Compliant with the Debian Free Software Guidelines (<ulink url="http://www.debian.org/social_contract#guidelines"></ulink>). This is a widely-used test for whether a given license is truly open source (free, <foreignphrase>libre</foreignphrase>, etc.). The Debian Project's mission is to maintain an entirely free operating system, such that someone installing it need never doubt that she has the right to modify and redistribute any or all of the system. The Debian Free Software Guidelines are the requirements that a software package's license must meet in order to be included in Debian. Because the Debian Project spent a good deal of time thinking about how to construct such a test, the guidelines they came up with have proven very robust (see <ulink url="http://en.wikipedia.org/wiki/DFSG"></ulink>), and as far as I'm aware, no serious objection to them has been raised either by the Free Software Foundation or the Open Source Initiative. If you know that a given license is DFSG-compliant, you know that it guarantees all the important freedoms (such as forkability even against the original author's wishes) required to sustain the dynamics of an open source project. All of the licenses discussed in this chapter are DFSG-compliant.
es: Conforme con las Directrices de Software Libre de Debian ( <foreignphrase>Debian Free Software Guidelines</foreignphrase> ,<ulink url="http://www.debian.org/social_contract#guidelines"></ulink>). Ésta es una prueba ampliamente usada para comprobar si una licencia dada es verdaderamente software libre. La misión del proyecto Debian es mantener un sistema operativo totalmente libre, de modo que cualquiera que lo instale nunca dude de que tiene el derecho a modificar y redistribuir cualquier parte del sistema. Las Directrices de Software Libre de Debian son los requisitos que la licencia de un paquete software debe cumplir para poder ser incluído en Debian. Debido a que el proyecto Debian invirtió gran cantidad de tiempo pensando en cómo realizar una prueba, las directrices que surgieron han demostrado ser muy robustas (veáse <ulink url="http://en.wikipedia.org/wiki/DFSG"></ulink>), hasta donde yo sé, ninguna objección seria se ha lanzado ni por la Free Software Foundation ni por la Open Source Initiative. Si sabes que una licencia es conforme con las DFSG, sabes que garantiza todas las libertades importantes (tales como la posibilidad de un <foreignphrase>fork </foreignphrase> incluso en contra de los deseos del autor) requeridas para mantener la dinámica de un proyecto libre. Todas las licencias tratadas en este capítulo son conformes a las DFSG.

source: OSI-approved
es: Aprobadas por OSI

source: Approved by the Open Source Initiative. This is another widely-used test of whether a license permits all the necessary freedoms. The OSI's definition of open source software is based on the Debian Free Software Guidelines, and any license that meets one definition almost always meets the other. There have been a few exceptions over the years, but only involving niche licenses and none of any relevance here. Unlike the Debian Project, the OSI maintains a list of all licenses it has ever approved, at <ulink url="http://www.opensource.org/licenses/"></ulink>, so that being "OSI-approved" is an unambiguous state: a license either is or isn't on the list.
es: Aprobadas por la Open Source Initiative. Este es otra prueba ampliamente usada para comprobar si una licencia cumple todas las libertades necesarias. La definición de la OSI del software libre está basada en las DFSG, y una licencia que se ajusta a una prueba casi siempre se ajusta a la otra. A través de los años han habido contadas excepciones, pero sólo relativas a un nicho de licencias de ninguna relevancia aquí. Al contrario que el proyecto Debian, la OSI mantiene una lista de todas las licencias que ha aprobado, en <ulink url="http://www.opensource.org/licenses/"></ulink>, por lo que ser aprobada por OSI es un estado sin ambigüedades: una licencia está o no está en la lista.

source: The Free Software Foundation also maintains a list of licenses at <ulink url="http://www.fsf.org/licensing/licenses/license-list.html"></ulink>. The FSF categorizes licenses not only by whether they are free, but whether they are compatible with the GNU General Public License. GPL compatibility is an important topic, covered in <xref linkend="license-compatibility"/><phrase output="printed"> later in this chapter</phrase>.
es: La Free Software Foundation también mantiene una lista de licencias en <ulink url="http://www.fsf.org/licensing/licenses/license-list.html"></ulink>. La FSF clasifica las licencias no sólo por su libertad, sino también por su compatibilidad con la GNU General Public License. La compatibilidad con la GPL es un asunto importante, que será tratado <xref linkend="license-compatibility"/><phrase output="printed"> más tarde en este capítulo</phrase>.

source: <firstterm>proprietary</firstterm>, <firstterm>closed-source</firstterm>
es: <firstterm>Propietario</firstterm>, <firstterm>Código cerrado</firstterm>

source: The opposite of "free" or "open source." It means software distributed under traditional, royalty-based licensing terms, where users pay per copy, or under any other terms sufficiently restrictive to prevent open source dynamics from operating. Even software distributed at no charge can still be proprietary, if its license does not permit free redistribution and modification.
es: Lo opuesto al software libre. Significa que el software se distribuye bajo términos tradicionales, con licencias basadas en derechos de autor, donde los usuarios pagan por copia, o bajo otros términos cualesquiera suficientemente restrictivos para prevenir la dinámica del software libre. Incluso el software distribuido gratuítamente puede ser propietario, si su licencia no permite la libre redistribución y derecho a modificación.

source: Generally "proprietary" and "closed-source" are synonyms. However, "closed-source" additionally implies that the source code cannot even be seen. Since the source code cannot be seen with most proprietary software, this is normally a distinction without a difference. However, occasionally someone releases proprietary software under a license that allows others to view the source code. Confusingly, they sometimes call this "open source" or "nearly open source," etc., but that's misleading. The <emphasis>visibility</emphasis> of the source code is not the issue; the important question is what you're allowed to do with it. Thus, the difference between proprietary and closed-source is mostly irrelevant, and the two can be treated as synonyms.
es: Generalmente, software "propietario" y software "de código cerrado" son sinónimos. Sin embargo, "código cerrado" adicionalmente implica que el código fuente no puede ser visto. Debido a que el código no puede verse en la mayoría del software privativo, esta diferencia generalmente no afecta. Sin embargo, ocasionalmente alguien publica software propietario bajo una licencia que permite a otros ver el código. Equivocadamente, algunas veces llaman a esto "código abierto" o "cercano al código abierto", etc., pero es engañoso. La <emphasis>visibilidad</emphasis> del código no es el problema, el tema importante es que estás autorizado a hacer con él. Así, la diferencia entre el código cerrado o propietario es en gran parte intrascendente, y ambos términos pueden tratarse como sinónimos.

source: Sometimes <firstterm>commercial</firstterm> is used as a synonym for "proprietary," but properly speaking, the two are not the same thing. Free software can be commercial software. After all, free software can be sold, as long as the buyers are not restricted from giving away copies themselves. It can be commercialized in other ways as well, for example by selling support, services, and certification. There are multimillion dollar companies built on free software today, so it is clearly neither inherently anti-commercial nor anti-corporate. On the other hand, it <emphasis>is</emphasis> anti-proprietary by its nature, and this is the key way in which it differs from traditional per-copy license models.
es: Algunas veces <firstterm>comercial</firstterm> es usado como sinónimo de "propietario", pero hablando con propiedad, no es lo mismo. El software libre puede ser software comercial. Después de todo, el software libre puede venderse, siempre que los compradores no estén restringidos a distribuir copias. También puede comercializarse por otras vías, por ejemplo mediante la venta de soporte, servicios y certificaciones. Hoy existen empresas multimillonarias basadas en el software libre, por tanto claramente no es intrínsecamente anticomercial o contrario a las empresas. Por otro lado, <emphasis>es</emphasis> anti-proprietario por su naturaleza y ésta es la clave de la diferencia con los modelos tradicionales de licencia por copia.

source: public domain
es: Dominio público

source: Having no copyright holder, meaning that there is no one who has the right to restrict copying of the work. Being in the public domain is not the same as having no author. Everything has an author, and even if a work's author or authors choose to put it in the public domain, that doesn't change the fact that they wrote it.
es: Que no tiene derechos de autor, significa que no hay nada que tenga el derecho a restringir la copia de la obra. Estar en el dominio público no es lo mismo que no tener autor. Todo tiene un autor, e incluso si el autor del trabajo o los autores eligen ponerlo en el dominio público, no cambia el hecho de que ellos lo escribieron.

source: When a work is in the public domain, material from it can be incorporated into a copyrighted work, and thereafter <emphasis>that copy</emphasis> of the material is covered under the same copyright as the whole work. But this does not affect the availability of the original work, which remains in the public domain. Thus, releasing something into the public domain is technically one way to make it "free," according to the guidelines of most free software certifying organizations. However, there are usually good reasons to use a license instead of just releasing into the public domain: even with free software, certain restrictions can be useful, not only to the copyright holder but even to recipients as well, as the next section makes clear.
es: Cuando un trabajo está en el dominio público, material de éste puede ser incorporado en trabajos con derechos de autor, y entonces <emphasis> esa copia</emphasis> del material está cubierta bajo los mismos derechos de autor que el trabajo completo. Pero esto no afecta a la disponibilidad del trabajo original, que permanece en el dominio público. Así, publicar algo en el dominio público es técnicamente un modo de hacerlo "libre", de acuerdo con las directrices de la mayoría de organizaciones certificadoras de software libre. Sin embargo, normalmente hay buenas razones para usar una licencia en vez de publicar algo en el dominio público: incluso con el software libre, ciertas restricciones pueden ser útiles, no sólo para el poseedor de los derechos de autor sino también para los beneficiarios, como aclara la siguiente sección.

source: A license that uses copyright law to achieve a result opposite to traditional copyright. Depending on whom you ask, this means either licenses that permit the freedoms under discussion here, or, more narrowly, licenses that not only permit those freedoms but <emphasis>enforce</emphasis> them, by stipulating that the freedoms must travel with the work. The Free Software Foundation uses the second definition exclusively; elsewhere, it's a toss-up: a lot of people use the term the same way the FSF does, but others&mdash;including some who write for mainstream media&mdash;tend to use the first definition. It's not clear that everyone using the term is aware that there's a distinction to be made.
es: Una licencia que utiliza la ley de propiedad intelectual para lograr el resultado contrario al derecho de autor tradicional. Dependiendo de a quién preguntes, esto significa que cualquier licencia que permita las libertades bajo discusión aquí, o, más estrictamente, las licencias que no sólo permiten esas libertades sino que las <emphasis>imponen</emphasis>, estipulando que las libertades deben acompañar al trabajo. La Free Software Foundation usa la segunda definición exclusivamente; en otros sitios, es un complemento: mucha gente usa el término del mismo modo que la FSF, pero otros &mdash;incluyendo a algunos que escriben en los principales medios de comunicación&mdash; tienden a usar la primera definición. Está claro que no todo el mundo que usa el término es consciente de que hay distinciones que deben hacerse.

source: The canonical example of the narrower, stricter definition is the GNU General Public License, which stipulates that any derivative works must also be licensed under the GPL; see <xref linkend="license-compatibility"/><phrase output="printed"> later in this chapter</phrase> for more.
es: El ejemplo clásico de la más limitada, una definición más estricta es la GNU General Public License, que estipula que todo trabajo derivado debe estar también bajo dicha licencia, veáse <xref linkend="license-compatibility"/><phrase output="printed"> más tarde en este capítulo </phrase> para más detalles.

source: Aspects of Licenses
es: Aspectos de las licencias

source: Although there are many different free software licenses available, in the important respects they all say the same things: that anyone can modify the code, that anyone can redistribute it both in original and modified form, and that the copyright holders and authors provide no warranties whatsoever (avoiding liability is especially important given that people might run modified versions without even knowing it). The differences between licences boil down to a few oft-recurring issues:
es: Aunque hay muchas licencias distintas de software libre disponibles, en los aspectos importantes, todas dicen lo mismo: que cualquier persona puede modificar el código, que cualquier persona puede redistriburlo tanto en la forma original como modificada, y que los titulares del copyright y los autores no ofrecen garantía alguna (evitar las responsabilidades es especialmente importante teniendo en cuenta que la gente puede ejecutar versiones modificadas incluso sin saberlo). Las diferencias entre las licencias se reducen a unas pocas cuestiones muy recurrentes:
