Repository: amaneiro/poss-gl
Catalog: po/*/ch09.po
Languages: es

source: Different organizations apply different amounts of rigor to the task of collecting assignments. Some simply get an informal statement from a contributor on a public list mailing list&mdash;something to the effect of "I hereby assign copyright in this code to the project, to be licensed under the same terms as the rest of the code." At least one lawyer I've talked to says that's really enough, presumably because it happens in a context where copyright assignment is normal and expected anyway, and because it represents a <foreignphrase>bona fide</foreignphrase> effort on the project's part to ascertain the developer's true intentions. On the other hand, the Free Software Foundation goes to the opposite extreme: they require contributors to physically sign and mail in a piece of paper containing a formal statement of copyright assignment, sometimes for just one contribution, sometimes for current and future contributions. If the developer is employed, the FSF asks that the employer sign it too.
es: No todos los voluntarios se molestarán por esto: después de todo, sus contribuciones están también en la edición libre, y ahí es dónde su principal interés reside. No obstante, el licenciamiento dual es una muestra del propietario del copyright asignándose un derecho que otros en el proyecto no tienen, y por lo tanto puede provocar tensiones en algún punto, al menos con algunos voluntarios.

source: The FSF's paranoia is understandable. If someone violates the terms of the GPL by incorporating some of their software into a proprietary program, the FSF will need to fight that in court, and they want their copyrights to be as airtight as possible when that happens. Since the FSF is copyright holder for a lot of popular software, they view this as a real possibility. Whether your organization needs to be similarly scrupulous is something only you can decide, in consultation with lawyers. In general, unless there's some specific reason why your project needs full copyright assignment, just go with CLAs; they're easier for everyone.
es: Lo que parece ocurrir en la práctica es las empresas basadas en software de licencia dual no tienen verdaderas comunidades de desarrollo igualitarias. Obtienen correcciones de bugs de pequeña escala y parches de limpieza de código de fuentes externas, pero terminan haciendo la mayoría del trabajo duro con recursos propios. Por ejemplo, Zack Urlocker, vicepresidente de marketing en MySQL, me contó que la empresa generalmente termina contratando a los voluntarios más activos de todos modos. Así, a pesar de que el producto en sí es libre, licenciado bajo la GPL, su desarrollo es más o menos controlado por la empresa, aunque con la posibilidad (extremadamente poco probable) de que alguien realmente insatisfecho con la manera de la empresa de conducir el software pueda hacer un <foreignphrase>fork</foreignphrase> del proyecto. Se desconoce cómo las políticas de la empresa se amoldan a esta amenaza, pero en cualquier caso, MySQL no parece tener problemas de aceptación ni en el mundo del software libre ni más allá de éste.

source: Dual Licensing Schemes
es: Patentes

source: Some projects try to fund themselves by using a dual licensing scheme, in which proprietary derivative works may pay the copyright holder for the right to use the code, but the code still remains free for use by open source projects. This tends to work better with code libraries than with standalone applications, naturally. The exact terms differ from case to case. Often the license for the free side is the GNU GPL, since it already bars others from incorporating the covered code into their proprietary product without permission from the copyright holder, but sometimes it is a custom license that has the same effect. An example of the former is the MySQL license, described at <ulink url="http://www.mysql.com/company/legal/licensing/"></ulink>; an example of the latter is Sleepycat Software's licensing strategy, described at <ulink url="http://www.oracle.com/technology/software/products/berkeley-db/htdocs/licensing.html"></ulink>.
es: Las patentes de software son el varapalo del momento en el software libre, porque plantean la única amenaza contra la cual la comunidad del software libre no puede defenderse. Los problemas de copyright y de marcas registradas siempre se pueden sortear. Si parte de tu código parece que podría infringir el copyright de otro, puedes reescribir esa parte. Si resulta que alguien tiene el nombre de tu proyecto como marca registrada, en el peor de los casos puedes simplemente cambiáselo. A pesar de que cambiar nombres puede ser una inconveniencia temporal, no debería importar a largo plazo, ya que el propio código haría lo que siempre hizo.

source: You might be wondering: how can the copyright holder offer proprietary licensing for a mandatory fee if the terms of the GNU GPL stipulate that the code must be available under less restrictive terms? The answer is that the GPL's terms are something the copyright holder imposes on everyone else; the owner is therefore free to decide <emphasis>not</emphasis> to apply those terms to itself. A good way to think of it is to imagine that the copyright owner has an infinite number of copies of the software stored in a bucket. Each time it takes one out of the bucket to send into the world, it can decide what license to put on it: GPL, proprietary, or something else. Its right to do this is not tied to the GPL or any other open source license; it is simply a power granted by copyright law.
es: Pero una patente es un requerimiento judicial global contra la implementación de cierta idea. No importa quien escriba el código, ni siquiera el lenguaje de programación usado. Una vez que alguien amenaza a un proyecto de software libre de infrigir una patente, el proyecto debe detener la implementación de esa característica particular, o enfrentarse a un caro y largo juicio. Dado que los instigadores de esos juicios son generalmente empresas con los bolsillos profundos &mdash;esos son los que tienen los recursos y la inclinación para adquirir patentes en primer lugar &mdash; la mayoría de los proyectos de software libre no pueden afrontar la última opción, y deben abandonar inmediatamente incluso si piensan que la patente podría ser inaplicable en un juzgado. Para evitar llegar a estas situaciones en primer lugar, los proyectos de software libre están empezando a codificarse defensivamente, evitando algoritmos patentados por adelantado incluso cuando son la mejor o la única solución a un problema de programación.

source: The attractiveness of dual licensing is that, at its best, it provides a way for a free software project to get a reliable income stream. Unfortunately, it can also interfere with the normal dynamics of open source projects. The problem is that any volunteer who makes a code contribution is now contributing to two distinct entities: the free version of the code and the proprietary version. While the contributor will be comfortable contributing to the free version, since that's the norm in open source projects, she may feel funny about contributing to someone else's semi-proprietary revenue stream. The awkwardness is exacerbated by the fact that in dual licensing, the copyright owner really needs to gather formal, signed copyright assignments from all contributors, in order to protect itself from a disgruntled contributor later claiming a percentage of royalties from the proprietary stream. The process of collecting these assignment papers means that contributors are starkly confronted with the fact that they are doing work that makes money for someone else.
es: Sun Microsystems e IBM al menos han hecho un gesto hacia el problema desde la otra dirección, mediante la liberación de un gran número de patentes de software &mdash;1600 y 500 respectivamente &mdash; para uso de la comunidad del software libre. No soy un abogado y por tanto no puedo evaluar la utilidad real de estos derechos, pero incluso si todas son patentes importantes, y los términos de estos derechos las hace realmente libres para su uso por cualquier proyecto libre, todavía sería sólo una gota de agua en el oceáno.

source: Not all volunteers will be bothered by this; after all, their contributions go into the open source edition as well, and that may be where their main interest lies. Nevertheless, dual licensing is an instance of the copyright holder assigning itself a special right that others in the project do not have, and is thus bound to raise tensions at some point, at least with some volunteers.
es: Encuestas y la evidencia anecdótica muestran que no sólo la mayoría de los programadores de software libre, sino la mayoría de <emphasis>todos </emphasis> los programadores, piensan que las patentes de software deberían ser abolidas totalmente.<footnote><para>Veáse <ulink url="http://lpf.ai.mit.edu/Whatsnew/survey.html"></ulink> como una de esas encuestas.</para></footnote> Los programadores de software libre tienden a estar convencidos sobre esto, y pueden rehusar trabajar en proyectos que están muy asociados con la recolección o la aplicación de patentes de software. Si tu organización recolecta patentes de software, entonces deja claro, de manera pública e irrevocable, que esas patentes nunca serán forzadas a aplicarse a proyectos de software libre, y que sólo son en defensa en caso de que otra organización inicie un proceso por infringimiento contra tu organización. Esto no es sólo la manera correcta de hacerlo, sino que también es bueno para las relaciones públicas con el software libre.

source: What seems to happen in practice is that companies based on dual licensed software do not have truly egalitarian development communities. They get small-scale bug fixes and cleanup patches from external sources, but end up doing most of the hard work with internal resources. For example, Zack Urlocker, vice president of marketing at MySQL, told me that the company generally ends up hiring the most active volunteers anyway. Thus, although the product itself is open source, licensed under the GPL, its development is more or less controlled by the company, albeit with the (extremely unlikely) possibility that someone truly dissatisfied with the company's handling of the software could fork the project. To what degree this threat pre&euml;mptively shapes the company's policies I don't know, but at any rate, MySQL does not seem to be having acceptance problems either in the open source world or beyond.
es: Por ejemplo, Red Hat ha prometido que los proyectos libres están seguros de sus patentes, veáse <ulink url="http://www.redhat.com/legal/patent_policy.html"></ulink>.

source: Patents
es: Desafortunadamente, recolectar patentes para propósitos defensivos es una acción racional. El sistema actual de patentes es, al menos en los Estados Unidos, una carrera armamentística por naturaleza: si tu competencia ha adquirido muchas patentes, tu mejor defensa es que adquieras tú muchas patentes, de modo que si alguna vez eres denunciado por infringir alguna patente puedas responder con una amenaza similar &mdash;entonces las dos organizaciones generalmente se sientan y trabajan en un acuerdo de licenciamiento cruzado de modo que ninguna deba pagar nada, excepto a sus abogados expertos en propiedad intelectual, por supuesto.

source: Software patents are the lightning rod issue of the moment in free software, because they pose the only real threat against which the free software community cannot defend itself. Copyright and trademark problems can always be gotten around. If part of your code looks like it may infringe on someone else's copyright, you can just rewrite that part. If it turns out someone has a trademark on your project's name, at the very worst you can just rename the project. Although changing names would be a temporary inconvenience, it wouldn't matter in the long run, since the code itself would still do what it always did.
es: El daño hecho al software libre por las patentes de software es más insidioso que sólo las amenazas directas al desarrollo del código, sin embargo. Las patentes de software fomentan una atmósfera de secretismo entre diseñadores de <foreignphrase>firmware</foreignphrase>, que justificadamente se preocupan de que por publicar detalles de sus interfaces podrían proporcionar ayuda técnica a sus competidores en búsqueda de golpearles con juicios de infringimiento de patentes. Esto no es sólo un peligro teórico: aparentemente ha estado pasando durante mucho tiempo en la industria de las tarjetas gráficas, por ejemplo. Muchos fabricantes de tarjetas gráficas son reacios a publicar las especificaciones de programación detalladas necesarias para producir <foreignphrase>drivers</foreignphrase> libres de gran rendimiento para sus tarjetas, así haciendo imposible a sistemas operativos libres soportar esas tarjetas con su potencial completo. ¿Por qué los fabricantes harán esto? No tiene sentido que trabajen <emphasis>contra </emphasis> el soporte de software: después de todo, la compatibilidad con más sistemas operativos sólo puede inducir a más ventas de tarjetas. Pero resulta que, detrás de la puerta de la sala de diseño, estos fabricantes están violando patentes de otros, a veces deliberadamente y otras por desconocimiento. Estas patentes son tan impredecibles y potencialmente tan numerosas que ningún fabricante de tarjetas puede afirmar su seguridad, incluso tras hacer búsquedas de patentes. Así, los fabricantes no se atreven a publicar sus especificaciones de la interfaz completa, ya que facilitaría a los competidores a averiguar si alguna patente ha sido infringida. (Por supuesto, la naturaleza de esta situación es tal que no vas a encontrar una admisión escrita de una fuente primaria acerca de qué está ocurriendo: esto lo sé a través de comunicaciones personales).

source: But a patent is a blanket injunction against implementing a certain idea. It doesn't matter who writes the code, nor even what programming language is used. Once someone has accused a free software project of infringing a patent, the project must either stop implementing that particular feature, or face an expensive and time-consuming lawsuit. Since the instigators of such lawsuits are usually corporations with deep pockets&mdash;that's who has the resources and inclination to acquire patents in the first place&mdash;most free software projects cannot afford the latter possibility, and must capitulate immediately even if they think it highly likely that the patent would be unenforceable in court. To avoid getting into such a situation in the first place, free software projects are starting to code defensively, avoiding patented algorithms in advance even when they are the best or only available solution to a programming problem.
es: Algunas licencias de software libre tienen claúsulas especiales para combatir, o al menos desalentar, las patentes de software. La GNU GPL, por ejemplo, contiene estos pasajes:

source: Sun Microsystems and IBM have also made at least a gesture at the problem from the other direction, by freeing large numbers of software patents&mdash;1600 and 500 respectively&mdash;for use by the open source community. I am not a lawyer and thus can't evaluate the real utility of these grants, but even if they are all important patents, and the terms of the grants make them truly free for use by any open source project, it would still be only a drop in the bucket.
es: Esta es una traducción NO oficial de la "GNU General Public License" al español. No fué publicada por la "FSF Free Software Foundation", y no respalda legalmente los términos de distribución del software que utiliza la "GNU GPL", sólo el texto original en inglés lo hace. Sin embargo esperamos que esta traducción ayude a las personas de habla hispana a entender mejor la "GPL".

source: For example, RedHat has pledged that open source projects are safe from its patents, see <ulink url="http://www.redhat.com/legal/patent_policy.html"></ulink>.
es: La licencia Apache, Version 2.0 (<ulink url="http://www.apache.org/licenses/LICENSE-2.0"></ulink>) también contiene requisitos antipatentes. Primero, estipula que todo aquel distribuyendo código bajo la licencia debe ímplicitamente incluir una licencia de patente libre de regalías para aquellas patentes que posean que puedan aplicar al código. Segundo, y más ingeniosamente, castiga a cualquiera que inicie una reclamación de violación de patentes en el trabajo cubierto, automáticamente terminando su licencia de patente implícita en el momento que se haga dicha reclamación:

source: The harm done to free software by software patents is more insidious than just direct threats to code development, however. Software patents encourage an atmosphere of secrecy among firmware designers, who justifiably worry that by publishing details of their interfaces they will be giving technical help to competitors seeking to slap them with patent infringement suits. This is not just a theoretical danger; it has apparently been happening for a long time in the video card industry, for example. Many video card manufacturers are reluctant to release the detailed programming specifications needed to produce high-performance open source drivers for their cards, thus making it impossible for free operating systems to support those cards to their full potential. Why would the manufacturers do this? It doesn't make sense for them to work <emphasis>against</emphasis> software support; after all, compatibility with more operating systems can only mean more card sales. But it turns out that, behind the design room door, these shops are all violating one another's patents, sometimes knowingly and sometimes accidentally. The patents are so unpredictable and so potentially broad that no card manufacturer can ever be certain it's safe, even after doing a patent search. Thus, manufacturers dare not publish their full interface specifications, since that would make it much easier for competitors to figure out whether any patents are being infringed. (Of course, the nature of this situation is such that you will not find a written admission from a primary source that it is going on; I learned it through a personal communication.)
es: Aunque es útil, tanto legal como políticamente, construir defensas ante las patentes en las licencias de software libre, al final estos pasos no son suficientes para desvanecer los efectos que tienen las amenazas de pleitos sobre el software libre. Sólo los cambios en la raíz o la interpretación de las leyes internacionales de patentes pueden hacer eso. Para saber más sobre este problema, y cómo se está combatiendo, diríjase a <ulink url="http://www.nosoftwarepatents.com/"></ulink>. El artículo de la Wikipedia inglesa <ulink url="http://en.wikipedia.org/wiki/Software_patent"></ulink> también tiene mucha información útil sobre patentes de software. He escrito una entrada en mi blog resumiendo los argumentos en contra de las patentes de software en <ulink url="http://www.rants.org/2007/05/01/how-to-tell-that-software-patents-are-a-bad-idea/"></ulink>.

source: Some free software licenses have special clauses to combat, or at least discourage, software patents. The GNU GPL, for example, contains this language:
es: Recursos adicionales

source: 7. If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Program at all. For example, if a patent license would not permit royalty-free redistribution of the Program by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Program. [...] It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which is implemented by public license practices. Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.
es: Este capítulo es sólo una introducción a las incidencias del licenciamiento de software libre. A pesar de que espero que contenga suficiente información para iniciarte en tu propio proyecto de software libre, cualquier investigación seria acerca de las licencias puede fácilmente aumentar la que este libro ofrece. Aquí hay una lista de recursos acerca de licencias de software libre:

source: The Apache License, Version 2.0 (<ulink url="http://www.apache.org/licenses/LICENSE-2.0"></ulink>) also contains anti-patent requirements. First, it stipulates that anyone distributing code under the license must implicitly include a royalty-free patent license for any patents they might hold that could apply to the code. Second, and most ingeniously, it punishes anyone who initiates a patent infringement claim on the covered work, by automatically terminating their implicit patent license the moment such a claim is made:
es: <citetitle>Understanding Open Source and Free Software Licensing</citetitle> por Andrew M. St. Laurent. Publicado por O'Reilly Media, primera edición Agosto 2004, ISBN:&nbsp;0-596-00581-4.

source: 3. Grant of Patent License. Subject to the terms and conditions of this License, each Contributor hereby grants to You a perpetual, worldwide, non-exclusive, no-charge, royalty-free, irrevocable (except as stated in this section) patent license to make, have made, use, offer to sell, sell, import, and otherwise transfer the Work, where such license applies only to those patent claims licensable by such Contributor that are necessarily infringed by their Contribution(s) alone or by combination of their Contribution(s) with the Work to which such Contribution(s) was submitted. If You institute patent litigation against any entity (including a cross-claim or counterclaim in a lawsuit) alleging that the Work or a Contribution incorporated within the Work constitutes direct or contributory patent infringement, then any patent licenses granted to You under this License for that Work shall terminate as of the date such litigation is filed.
es: Se trata de un completo libro sobre licenciamiento de software libre en toda su complejidad, incluyendo muchos temas omitidos en este capítulo. Veáse <ulink url="http://www.oreilly.com/catalog/osfreesoft/"></ulink> para más detalle.
